{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "(\\[[^\\]]+\\]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\|\\/|:|@|\\?|>>|\\*|\\%[0-9]{2,3}|[0-9]+)"
    },
    "behavior": "MergedWithPrevious",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<s>": 0,
      "</s>": 1,
      "<unk>": 2,
      "<pad>": 3,
      "<mask>": 4,
      "#": 5,
      "%": 6,
      "(": 7,
      ")": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      "=": 23,
      "@": 24,
      "A": 25,
      "B": 26,
      "C": 27,
      "F": 28,
      "G": 29,
      "H": 30,
      "I": 31,
      "K": 32,
      "L": 33,
      "M": 34,
      "N": 35,
      "O": 36,
      "P": 37,
      "R": 38,
      "S": 39,
      "T": 40,
      "X": 41,
      "Z": 42,
      "[": 43,
      "\\": 44,
      "]": 45,
      "a": 46,
      "b": 47,
      "c": 48,
      "e": 49,
      "g": 50,
      "i": 51,
      "l": 52,
      "n": 53,
      "o": 54,
      "p": 55,
      "r": 56,
      "s": 57,
      "t": 58,
      "cc": 59,
      "CC": 60,
      "O)": 61,
      "c1": 62,
      "C(": 63,
      "=O)": 64,
      "c(": 65,
      "C)": 66,
      "c2": 67,
      "H]": 68,
      "[C": 69,
      "[C@": 70,
      "C(=O)": 71,
      "c1cc": 72,
      "H](": 73,
      "[C@@": 74,
      "c3": 75,
      "c2cc": 76,
      "2)": 77,
      "1)": 78,
      "F)": 79,
      "(=O)": 80,
      "(C)": 81,
      "[C@H](": 82,
      "[C@@H](": 83,
      "CCCC": 84,
      "cc(": 85,
      "CN": 86,
      "C(=O)N": 87,
      "c1ccc(": 88,
      "C1": 89,
      "ccc1": 90,
      "N)": 91,
      "Cl": 92,
      "3)": 93,
      "cn": 94,
      "cccc": 95,
      "CO": 96,
      "CCN": 97,
      "c2)": 98,
      "Cl)": 99,
      "NC(=O)": 100,
      "cc1": 101,
      "[C@H]": 102,
      "[C@@H]": 103,
      "C(C)": 104,
      "OC)": 105,
      "nc(": 106,
      "[n": 107,
      "c4": 108,
      "C(N": 109,
      "ccc(": 110,
      "c1ccccc1": 111,
      "(CC": 112,
      "cc1)": 113,
      "n1": 114,
      "[nH]": 115,
      "c1)": 116,
      "c2cccc": 117,
      "=O": 118,
      "c2ccc(": 119,
      "c2c(": 120,
      "c1c(": 121,
      "C2": 122,
      "c1cc(": 123,
      "C=": 124,
      "cc2)": 125,
      "OCC": 126,
      "O=": 127,
      "(C": 128,
      "S(=O)": 129,
      "(F)": 130,
      "(C)C)": 131,
      "OC": 132,
      "1CC": 133,
      "(=O)N": 134,
      "c1n": 135,
      "c3)": 136,
      "C(F)": 137,
      "cc2": 138,
      "C/": 139,
      "c3cccc": 140,
      "+]": 141,
      "CC1": 142,
      "C(F)(F)": 143,
      "c2n": 144,
      "c2ccccc2)": 145,
      "NC(": 146,
      "[C@H]1": 147,
      "c1ccccc1)": 148,
      "4)": 149,
      "-]": 150,
      "[C@]": 151,
      "[C@@H]1": 152,
      "n2": 153,
      "c1(": 154,
      "/C=": 155,
      "c3ccc(": 156,
      "2CC": 157,
      "[C@@]": 158,
      "c3c(": 159,
      "C(=": 160,
      "(O)": 161,
      "[N": 162,
      "C(O)": 163,
      "[O": 164,
      "[O-]": 165,
      "C(F)(F)F)": 166,
      "CCCN": 167,
      "c1cccc(": 168,
      "c2cc(": 169,
      "C(=O)N[C@@H](": 170,
      "S(=O)(=O)": 171,
      "CCN(": 172,
      "Br": 173,
      "n2)": 174,
      "Cc1ccc(": 175,
      "c2ccccc2": 176,
      "N1": 177,
      "CCC": 178,
      "[N+]": 179,
      "cc3)": 180,
      "[O-])": 181,
      "C(=O)O)": 182,
      "NC(=O)[C@H](": 183,
      "CC2)": 184,
      "c(=O)": 185,
      "C(C)C)": 186,
      "CC(": 187,
      "C(N)": 188,
      "[C@H]2": 189,
      "C#": 190,
      "N(": 191,
      "n1)": 192,
      "CC(C)": 193,
      "C2)": 194,
      "n(": 195,
      "C1)": 196,
      "CO)": 197,
      "=O)=O)": 198,
      "c3cc": 199,
      "CC)": 200,
      "[C@@H]2": 201,
      "C3": 202,
      "C[C@H](": 203,
      "Br)": 204,
      "CC(=O)N": 205,
      "CCN(CC": 206,
      "N=": 207,
      "/C=C/": 208,
      "c1ccc(cc1)": 209,
      "c3ccccc3)": 210,
      "CCO": 211,
      "c1nc(": 212,
      "c5": 213,
      "CC1)": 214,
      "C[C@@H](": 215,
      "CC(=O)": 216,
      "c(-": 217,
      "c1cn": 218,
      "CS": 219,
      "c3ccccc3": 220,
      "COc1ccc(": 221,
      "[C@H](O)": 222,
      "c12": 223,
      "O=C(": 224,
      "c1cc2": 225,
      "C#N)": 226,
      "CN(": 227,
      "c(C)": 228,
      "ccc2": 229,
      "cs": 230,
      "c[nH]": 231,
      "[C@@H](C)": 232,
      "nc2": 233,
      "cc3": 234,
      "CCCCCCCC": 235,
      "CN1": 236,
      "C(=O)O": 237,
      "(N": 238,
      "3CC": 239,
      "[C@@H](O)": 240,
      "ccc1)": 241,
      "CC(C)C)": 242,
      "=N": 243,
      "c4cccc": 244,
      "c(OC)": 245,
      "nc1": 246,
      "[N+](=O)": 247,
      "c2nc(": 248,
      "[C@H](C)": 249,
      "c(N": 250,
      "c4)": 251,
      "c2cccc(": 252,
      "O=C(N": 253,
      "C)=O)": 254,
      "Cc1ccccc1)": 255,
      "c3cc(": 256,
      "CNC(=O)": 257,
      "S(=O)(=O)N": 258,
      "OC(=O)": 259,
      "[C@H]3": 260,
      "S)": 261,
      "CC3)": 262,
      "-c2ccc(": 263,
      "nn": 264,
      "[C@@H]3": 265,
      "C(C)=O)": 266,
      "C(C)(C)C)": 267,
      "(=O)=O)": 268,
      "(C)C": 269,
      "[N+](=O)[O-])": 270,
      "ncn": 271,
      "C(=O)N[C@H](": 272,
      "NC(=O)[C@@H](": 273,
      "Cn1": 274,
      "N2": 275,
      "C3)": 276,
      "Cc1cc": 277,
      "c2cn": 278,
      "c(Cl)": 279,
      "c(O)": 280,
      "n3": 281,
      "OCC)": 282,
      "C\\": 283,
      "C(N)=O)": 284,
      "Cc1": 285,
      "([O-])": 286,
      "C(=N)": 287,
      "COC(=O)": 288,
      "cccc1": 289,
      "c1ccc2c(": 290,
      "/N=": 291,
      "=C(": 292,
      "cccc2)": 293,
      "cc(-": 294,
      "CCCCN)": 295,
      ".Cl": 296,
      "c2c1": 297,
      "5)": 298,
      "OC(": 299,
      "co": 300,
      "CCN(C": 301,
      "CC2": 302,
      "c(c(": 303,
      "c3n": 304,
      "c4ccc(": 305,
      "C(C)(C)": 306,
      "O=C(O)": 307,
      "Cc1cc(": 308,
      "[C@]1": 309,
      "S(": 310,
      "C(O)=O)": 311,
      "2)cc1": 312,
      "C[C@H]1": 313,
      "C(=N)N)": 314,
      "N1CC": 315,
      "N(CC": 316,
      "[n+]": 317,
      "c2ccc(cc2)": 318,
      "NC(=O)N": 319,
      "/C(=": 320,
      "[C@]2": 321,
      "CCN1": 322,
      "nc(-": 323,
      "O=C1": 324,
      "c1ccc(Cl)": 325,
      "[C@@]2": 326,
      "CN2": 327,
      "OCO": 328,
      "c(F)": 329,
      "CN(C)": 330,
      "C1CCCC": 331,
      "O[C@H](": 332,
      "c(n": 333,
      "cccc2": 334,
      "Cc1n": 335,
      "c1ccc(-": 336,
      "cccc1)": 337,
      "C)C)": 338,
      "c(c1)": 339,
      "COc1cc(": 340,
      "C1(": 341,
      "ccc3": 342,
      "Cc2ccccc2)": 343,
      "N)=O)": 344,
      "C2=O)": 345,
      "Cc1c(": 346,
      "4CC": 347,
      "Cc1ccccc1": 348,
      "S(=O)(": 349,
      "ccc2)": 350,
      "cc(C)": 351,
      "CN(CC": 352,
      "(C)CC": 353,
      "[C@@]1": 354,
      "c2ccc(Cl)": 355,
      "CCCNC(=N)N)": 356,
      "C(N[C@H](": 357,
      "c1cc2c(": 358,
      "cc(Cl)": 359,
      "C1=O": 360,
      "N/": 361,
      "n3)": 362,
      "C1=O)": 363,
      "CN(C": 364,
      "cc4)": 365,
      "c23)": 366,
      "P(=O)": 367,
      "C[C@@H]1": 368,
      "C(N[C@@H](": 369,
      "c1cccc2": 370,
      "C(F)(F)F": 371,
      "[C@H]1CC": 372,
      "nc(N": 373,
      "c2cc3": 374,
      "CCN(C(=O)": 375,
      "c1c2c(": 376,
      "c4cc": 377,
      "[N+]([O-])": 378,
      "cc(OC)": 379,
      "c1s": 380,
      "C(=O)N1": 381,
      "C(O": 382,
      "[C@@H]1CC": 383,
      "n(C)": 384,
      "c4c(": 385,
      "CCN(CC1)": 386,
      "CC(=O)O)": 387,
      "C1CC": 388,
      "[C@]3": 389,
      "c1ccc2c(c1)": 390,
      "s1": 391,
      "C1=": 392,
      "-c1ccc(": 393,
      "O[C@@H](": 394,
      "o1": 395,
      "NC([C@@H](": 396,
      "c2[nH]": 397,
      "c4ccccc4": 398,
      "c4ccccc4)": 399,
      "c2ccccc1": 400,
      "cn1": 401,
      "CCCCC2)": 402,
      "-c2ccccc2)": 403,
      "=S)": 404,
      "C/C=": 405,
      "CC(N": 406,
      "CC(C)(C)": 407,
      "(O": 408,
      "nc3": 409,
      "(CC)": 410,
      "NC([C@H](": 411,
      "C(CC": 412,
      "CCOC(=O)": 413,
      "OC)=O)": 414,
      "CCNC(=O)": 415,
      "c2ccc(F)": 416,
      "N(C)": 417,
      "ccc(c1)": 418,
      "[C@H](O": 419,
      "cn1)": 420,
      "CN1CC": 421,
      "cc2)cc1": 422,
      "=N)": 423,
      "cn2)": 424,
      "C(=O)N1CC": 425,
      "c1ccc(F)": 426,
      "cc(F)": 427,
      "O)O)": 428,
      "[C@@H]4": 429,
      "Cn2": 430,
      "c2s": 431,
      "c(N)": 432,
      "c(cc1)": 433,
      "C4": 434,
      "NS(=O)(=O)": 435,
      "C)=O": 436,
      "O1": 437,
      "N(C": 438,
      "CC(O)": 439,
      "C(\\": 440,
      "-c2n": 441,
      "[C@@H](O": 442,
      "-c3ccc(": 443,
      "[C@@]3": 444,
      "CCC(=O)O)": 445,
      "C)C": 446,
      "cccc3)": 447,
      "c(=O)[nH]": 448,
      "-c1n": 449,
      "C(C)C": 450,
      "3CCCC": 451,
      "C[C@H]2": 452,
      "c2=O)": 453,
      "[C@H]4": 454,
      "n1c(": 455,
      "CCC(=O)N": 456,
      "c3cn": 457,
      "1)=O)": 458,
      "Cc1cccc(": 459,
      "OCCO": 460,
      "OCC2)": 461,
      "CCCC)": 462,
      "N#": 463,
      "CCCC2)": 464,
      "c2)cc1": 465,
      "cc(c1)": 466,
      "Nc1n": 467,
      "c2ccc3c(": 468,
      "Cc2ccc(": 469,
      "C)cc1": 470,
      "N2CC": 471,
      "c1=O": 472,
      "S(C)": 473,
      "c1cc(ccc1": 474,
      "s2)": 475,
      "O)cc1)": 476,
      "no": 477,
      "s1)": 478,
      "C(=O)N2": 479,
      "/N=C/": 480,
      "-c1c(": 481,
      "[C@@H]2CC": 482,
      "cnc1": 483,
      "N(C(=O)": 484,
      "OCC1": 485,
      "N(C)C)": 486,
      "oc(": 487,
      "Cc1cn": 488,
      "n2)cc1": 489,
      "c1[nH]": 490,
      "-c1ccccc1": 491,
      "cc4": 492,
      "CNC(": 493,
      "c1(ccc(": 494,
      "Cc1c[nH]": 495,
      "NCC": 496,
      "c6": 497,
      "c1cccc(c1)": 498,
      "C[C@@H]2": 499,
      "c2c(cccc2)": 500,
      "c3cccc(": 501,
      "nn1": 502,
      "(=O)=O": 503,
      "CCN(C)": 504,
      "CCS": 505,
      "C(=O)OC)": 506,
      "c1cc(ccc1)": 507,
      "c2cc1": 508,
      "P(=O)(O)": 509,
      "nc(C)": 510,
      "CCC1": 511,
      "Cc1ccc(cc1)": 512,
      "CN1C(=O)": 513,
      "=O)C": 514,
      "OC)c(OC)": 515,
      "ccccc1": 516,
      "nc1)": 517,
      "c2c1)": 518,
      "ncc1": 519,
      "[C@H]2CC": 520,
      "c1c(C)": 521,
      "CN(C(=O)": 522,
      "C(=O)N(": 523,
      "CCCC1": 524,
      "c1o": 525,
      "[C@]4": 526,
      "C(=O)NCC": 527,
      "c3ccc(Cl)": 528,
      "CN2CC": 529,
      "C4)": 530,
      "-c2cc": 531,
      "/C=N/": 532,
      "O)=O)": 533,
      "cnc2": 534,
      "=C/": 535,
      "[nH]1": 536,
      "c12c(": 537,
      "c2n(": 538,
      "C(N1": 539,
      "CCC(": 540,
      "c2ccc(Cl)cc2)": 541,
      "OCC3)": 542,
      "-c3ccccc3)": 543,
      "[N+]([O-])=O)": 544,
      "n(C": 545,
      "c2ccccc12)": 546,
      ".[": 547,
      "c2ncn": 548,
      "O(": 549,
      "CC2)cc1": 550,
      "c3ccc(F)": 551,
      "[Na": 552,
      "c2o": 553,
      "-n2": 554,
      "CC=": 555,
      ".[Na": 556,
      "C2(": 557,
      "N3": 558,
      "NC": 559,
      "c1ccc(Cl)cc1": 560,
      ".[Na+]": 561,
      "[nH]2)": 562,
      "N(C(": 563,
      "CCCCCC": 564,
      "CN)": 565,
      "cn2": 566,
      "S(C)(=O)=O)": 567,
      "COc1cccc(": 568,
      "-c1cc": 569,
      "o2)": 570,
      "c1c(cccc1)": 571,
      "c1=O)": 572,
      "S(=O)(N": 573,
      "CCN(CC)": 574,
      "c3ccccc23)": 575,
      "cc(O)": 576,
      "-c1cc(": 577,
      "[S": 578,
      "OCC1)": 579,
      "O)O": 580,
      "c2ccccc21": 581,
      "C(=O)N)": 582,
      "COc1ccccc1": 583,
      "C(C(": 584,
      ".O=C(O)": 585,
      "ccn1": 586,
      "CCn1": 587,
      "C[C@H](O)": 588,
      "nc2)": 589,
      "C)O": 590,
      "n(CC": 591,
      "cc(cc1)": 592,
      "C2CC2)": 593,
      "c5cccc": 594,
      "-c1ccc(cc1)": 595,
      "NC(N": 596,
      "cccc3": 597,
      "c2ccc(F)cc2)": 598,
      "CC(N)=O)": 599,
      "c(c2)": 600,
      "(F)(F)": 601,
      "C[C@@H](O)": 602,
      "=C(N)": 603,
      "c2ccc3c(c2)": 604,
      "/C(": 605,
      "O)cc1": 606,
      "3CCOCC3)": 607,
      "C(=O)OC": 608,
      "(C1)": 609,
      "C(=O)NC": 610,
      "c2c3c(": 611,
      "-n1": 612,
      "CCN(CC2)": 613,
      "C(N(": 614,
      "c2c(C)": 615,
      "n4": 616,
      "CCN2": 617,
      "O2)": 618,
      "CCCCC1)": 619,
      "[nH]c(": 620,
      "c3ccc(cc3)": 621,
      "OCC(=O)N": 622,
      "(C)(": 623,
      "c2cc(Cl)": 624,
      "-c3cc": 625,
      "CCC(N)=O)": 626,
      "c2c[nH]": 627,
      "C1C(": 628,
      "C(=S)": 629,
      "c(C)c1": 630,
      "C(=O)N[C@@H](CC(C)C)": 631,
      "CCC1)": 632,
      "Cc1ccc(O)cc1)": 633,
      "=O)=O": 634,
      "(CC1)": 635,
      "CCN1CC": 636,
      "c1ccc(O": 637,
      "C)CC": 638,
      "c1cc(Cl)": 639,
      "O1)": 640,
      "OC)c(": 641,
      "[C@@]4": 642,
      "O[C@H](CO)": 643,
      "[C@@H](C)O)": 644,
      "cc1)=O": 645,
      "[C@@H]1O": 646,
      "Cl.": 647,
      "N1(": 648,
      "I)": 649,
      "S(N": 650,
      "c5)": 651,
      "Cc1nc(": 652,
      "CC(=O)O": 653,
      "o1)": 654,
      "nc(N)": 655,
      "C(/": 656,
      "C(=O)N2CC": 657,
      "CCC2)": 658,
      "Nc1nc(": 659,
      "c1O": 660,
      "NC(C)=O)": 661,
      "-c1ccccc1)": 662,
      "c1c(ccc(": 663,
      "c2cccc3": 664,
      "[C@H]1O": 665,
      "OC)OC)": 666,
      "CCCC1)": 667,
      "COc1cc": 668,
      "cc(C(F)(F)F)": 669,
      "ccc3)": 670,
      "#N)": 671,
      "c1OC": 672,
      "OCCOCC": 673,
      "CCCCC1": 674,
      "O)cc2)": 675,
      "c2ccn": 676,
      "cs2)": 677,
      "3)cc1": 678,
      "ccn1)": 679,
      "c2c(c1)": 680,
      "-c2cc(": 681,
      "nn2)": 682,
      "C(=O)N[C@@H](CCCCN)": 683,
      "CC4)": 684,
      "N\\": 685,
      "[C@@H]5": 686,
      "n[nH]": 687,
      "O)c(": 688,
      "c1c(Cl)": 689,
      "c1C": 690,
      "C#N": 691,
      "/C(=C/": 692,
      "=O)cc1": 693,
      "C2CC": 694,
      "[C@]12": 695,
      "C(C)(": 696,
      "N1CCN(": 697,
      "[C@@H](O)[C@H](O)": 698,
      "Cc2c(": 699,
      "cnc1)": 700,
      "c2n1": 701,
      "c(n1)": 702,
      "N=C(": 703,
      "C2=": 704,
      "c1(cc": 705,
      "cn3)": 706,
      "C(N)=N)": 707,
      "NC(=O)[C@H](CC(C)C)": 708,
      "ccc4": 709,
      "c34)": 710,
      "c2)c1": 711,
      "-c2c(": 712,
      "CC(=O)N[C@@H](": 713,
      "C(=O)N[C@@H](C)": 714,
      "C)cc2)": 715,
      "c1cccc2)": 716,
      "c2ccccc12": 717,
      "C2CCCCC2)": 718,
      "CC1CC": 719,
      "sc1": 720,
      "Nc1ccc(": 721,
      "C(=O)N[C@@H](CCCNC(=N)N)": 722,
      "=O)=O)=O)": 723,
      "C(C)(C)C": 724,
      "C=C(": 725,
      "c1ccc(Cl)cc1)": 726,
      "nn1)": 727,
      "CCCN=C(N)": 728,
      "c2cc1)": 729,
      "c2cc3c(": 730,
      "[C@]2(C)": 731,
      "[n+]1": 732,
      "(=O)O)": 733,
      "[nH]1)": 734,
      "C(CC1)": 735,
      "SCC(=O)N": 736,
      "[C@H](NC(=O)": 737,
      "cs1": 738,
      "/C=C\\": 739,
      "nn(": 740,
      "C(N)=O": 741,
      "C1CC1)": 742,
      "C3=O)": 743,
      "C(c1ccccc1)": 744,
      "[C@@H](C)CC)": 745,
      "Cc3ccccc3)": 746,
      "=N/": 747,
      "CS(=O)(=O)": 748,
      "c2cccn": 749,
      "Cl)Cl)": 750,
      ".O=C(O)C(F)(F)F": 751,
      "c1ccc(F)cc1": 752,
      "C1CC1": 753,
      "CC1(C)": 754,
      "(CO)": 755,
      "S(N)": 756,
      "c3[nH]": 757,
      "C(N2": 758,
      "C)c(": 759,
      "C(=O)OCC)": 760,
      "[C@]2(": 761,
      "c1ccc(OC)": 762,
      "cc(cc2)": 763,
      "Cl)c1": 764,
      "ncc1)": 765,
      "ncc2": 766,
      "c2ccccc2)cc1": 767,
      "cs1)": 768,
      "NC(=S)": 769,
      "OCCCC": 770,
      "c3ccc(F)cc3)": 771,
      "[C@@H](NC(=O)": 772,
      "c1c(c(": 773,
      "c1c(ccc(c1)": 774,
      "c12)": 775,
      "N=C(N)": 776,
      "C/C=C/": 777,
      "-c2cn": 778,
      "C)cc1)": 779,
      "c1n(": 780,
      "6)": 781,
      "c2ccc(-": 782,
      "nn2": 783,
      "OC(F)(F)F)": 784,
      "c1c(F)": 785,
      "-c2ccc(cc2)": 786,
      "[C@@](": 787,
      "[C@](": 788,
      "Cc1c[nH]c2ccccc12)": 789,
      "[C@@]2(C)": 790,
      "-c1cn": 791,
      "NC(=O)[C@H](C)": 792,
      "(C2)": 793,
      "CCC)": 794,
      "ccc1O": 795,
      "C[C@H]3": 796,
      "NC(=O)CNC(=O)": 797,
      "c1c[nH]": 798,
      "CCCN=C(N)N)": 799,
      "c21)": 800,
      "C(OCC)": 801,
      "F)cc1": 802,
      "P(O)": 803,
      "CCN(C)C)": 804,
      "C/C(=": 805,
      "=C1": 806,
      "[C@@H](CO)": 807,
      "[C@@]2(": 808,
      "c3cc4": 809,
      "C1CCCCC1)": 810,
      "C(=O)N(C)": 811,
      "CCCN1": 812,
      "[C@H]3CC": 813,
      "C(C)=O": 814,
      "C[C@@H]3": 815,
      "C(OC)=O)": 816,
      "Cc1cc(C)": 817,
      "c3ccc(Cl)cc3)": 818,
      "c1cc2c(cc1": 819,
      "NC(=O)[C@@H](N)": 820,
      "-c1nc(": 821,
      "c1(c(": 822,
      "OC1": 823,
      "C(C(=O)N": 824,
      "CN3": 825,
      "-2": 826,
      "N1C(=O)": 827,
      "c1nnc(": 828,
      "O[C@@H]1": 829,
      "cc21": 830,
      "c1c(O)": 831,
      "COC(": 832,
      "C2=O": 833,
      "c21": 834,
      "Cl)cc1": 835,
      "NC1": 836,
      "c1ccc(N": 837,
      "ccc21": 838,
      "[C@@H](N)": 839,
      "O[C@H]1": 840,
      "CCCC2": 841,
      "c2c(=O)": 842,
      "c2ccc(OC)": 843,
      "(CC(=O)N": 844,
      "c2cc(F)": 845,
      "c(O": 846,
      "c1c(cc(": 847,
      "c1cc(C)": 848,
      "2CCOCC2)": 849,
      "=C\\": 850,
      "S(N)(=O)=O)": 851,
      "c(C(=O)N": 852,
      "[C@H]5": 853,
      "c32)": 854,
      "c3c2)": 855,
      "C2)cc1": 856,
      "[nH]c(=O)": 857,
      "CN2C(=O)": 858,
      "c1cs": 859,
      "co2)": 860,
      "c1C)": 861,
      "CCCCCCCCCCCC": 862,
      "3CCCCC3)": 863,
      "C(F)F)": 864,
      "ccc(c2)": 865,
      "C(O)=O": 866,
      "C(C)C)=O)": 867,
      "C1CCCCC1": 868,
      "c1c2": 869,
      "-c2nc(": 870,
      "Cc2ccccc2": 871,
      "[C@]3(C)": 872,
      "c3c(cccc3)": 873,
      "nc2c1": 874,
      "c1c(OC)": 875,
      "Br-]": 876,
      "C(N1CC": 877,
      "NC(=O)[C@H](CCCNC(=N)N)": 878,
      "CC[C@H](C)": 879,
      "C12": 880,
      "cc2)c1": 881,
      "c3cccn": 882,
      "C2=N": 883,
      "c2ncc": 884,
      "c5ccc(": 885,
      "c1(cc(": 886,
      "F)F)": 887,
      "/C(=C\\": 888,
      "c1cc(F)": 889,
      "c2ccc(cc2": 890,
      "s3)": 891,
      "n1cn": 892,
      "CCCNC(N)=N)": 893,
      "C1CN(": 894,
      "NC(=O)[C@H](CCCCN)": 895,
      "CC3": 896,
      "C)c1": 897,
      "C(=O)N[C@@H](Cc1ccccc1)": 898,
      "[n+](": 899,
      "[N+](C)": 900,
      "c3ccccc32)": 901,
      "OC)=O": 902,
      "C1N(": 903,
      "Oc1ccc(": 904,
      "CC)=O)": 905,
      ".[Br-]": 906,
      "c3nc(": 907,
      "O)c(O)": 908,
      "c4n": 909,
      "c2ccccn2)": 910,
      "C3CCCC": 911,
      "C(=O)OCC": 912,
      "CSS": 913,
      "cc2)=O)": 914,
      "sc(": 915,
      "C3CC3)": 916,
      "C=C1": 917,
      "C/C=C\\": 918,
      "cc2c1": 919,
      "c2cs": 920,
      "ccc(cc1)": 921,
      "CCCO": 922,
      "c1ccc(F)cc1)": 923,
      "Cl)=O)": 924,
      "c2n1)": 925,
      "CCOc1ccc(": 926,
      "n1(": 927,
      "c2cccc(Cl)": 928,
      "cc(C(=O)N": 929,
      "CN1CCN(": 930,
      "[C@H](CC": 931,
      "S1": 932,
      "/C=C(\\": 933,
      "C(NC(=O)": 934,
      "C(=O)CC": 935,
      "OCc1ccccc1)": 936,
      "C(=O)N1CCC[C@H]1": 937,
      "CCC3)": 938,
      "SC": 939,
      "(CC2)": 940,
      "/C=C2": 941,
      "[N+](=O)[O-]": 942,
      "[C@H](N)": 943,
      "n4)": 944,
      "Br)cc1": 945,
      "[C@H](CC)": 946,
      "N1CCN(CC1)": 947,
      "NC(=O)[C@H](CO)": 948,
      "c2cccc(c2)": 949,
      "(C3)": 950,
      "c(Cl)c1": 951,
      "c2cc(C)": 952,
      "c1nc2c(": 953,
      "cc(N": 954,
      "C(=O)N(C": 955,
      "n2cn": 956,
      "3CCCC3)": 957,
      "C1CCN(": 958,
      "=N\\": 959,
      "C5": 960,
      "c3ccc(-": 961,
      "3C)": 962,
      "CN(C)C)": 963,
      "[S+]": 964,
      "c4cn": 965,
      "[C@@]12": 966,
      "c1ccco": 967,
      "OC(C)=O)": 968,
      "n1cc(": 969,
      "[C@]1(": 970,
      "[C@@H](CC": 971,
      "c(=O)n(": 972,
      "c2c1cccc2)": 973,
      "C(NCC": 974,
      "C(NC(": 975,
      "c3cc(Cl)": 976,
      "c3ncn": 977,
      "FC(F)(F)": 978,
      "/C(C)": 979,
      "c1)=O": 980,
      "(O)=O)": 981,
      "n2c(": 982,
      "F)=O)": 983,
      "4CCCC": 984,
      "C)O)": 985,
      "cc2)CC1": 986,
      "CC2)c1": 987,
      "C(=O)/C=C/": 988,
      "CCCCN": 989,
      "c1cn(": 990,
      "CCCN(": 991,
      "[C@H]([C@@H](": 992,
      "=CC": 993,
      "NC(=O)CC": 994,
      "cc2c(": 995,
      "C1\\": 996,
      "C=O)": 997,
      "cc12": 998,
      "n2)c1": 999,
      "c1(ccc(cc1)": 1000,
      "nc3)": 1001,
      "c2)CC1": 1002,
      "/C(=N/": 1003,
      "C(=O)(": 1004,
      "O[C@@H]2": 1005,
      "C(F)(": 1006,
      "OC(C)(C)C)": 1007,
      "c1ccc(cc1": 1008,
      "C(CC)": 1009,
      "c1)N": 1010,
      "[C@@H]3CC": 1011,
      "cc(OC)c1OC": 1012,
      "C[C@@H](C)": 1013,
      "nc2c(": 1014,
      "C=C": 1015,
      "cc(Br)": 1016,
      "-c2ccccc2": 1017,
      "=C2": 1018,
      "CS)": 1019,
      "SC)": 1020,
      "c(C(F)(F)F)": 1021,
      "[C@]1(C)": 1022,
      "c3s": 1023,
      "c3c2": 1024,
      "C(c2ccccc2)": 1025,
      "O3)": 1026,
      "[C@](C)": 1027,
      "F)c1": 1028,
      "=C)": 1029,
      "cs3)": 1030,
      "(F)F": 1031,
      "-c2ccc(Cl)": 1032,
      "CCC2": 1033,
      "OCC4)": 1034,
      "c1cc(OC)": 1035,
      "nnc(": 1036,
      "C(=O)N[C@H](C(=O)N[C@@H](": 1037,
      "O)c1": 1038,
      "CCCC(": 1039,
      "ccc12": 1040,
      "[C@@]5": 1041,
      "c2ccc(Br)": 1042,
      "ncc3)": 1043,
      "Cc2cc": 1044,
      "c(OC)c1": 1045,
      "c1ncc": 1046,
      "NC1=O": 1047,
      "=O)C)": 1048,
      "OC)OC": 1049,
      "c1ccc(NC(=O)": 1050,
      "N[C@@H](": 1051,
      "c2ccccc2)CC1": 1052,
      "[C@@H]12": 1053,
      "[C@@]1(": 1054,
      "COc1cc2": 1055,
      "C[C@H](NC(=O)": 1056,
      "[Cl": 1057,
      "[C@@H]1CCCN1C(=O)": 1058,
      "N2C(=O)": 1059,
      "c(n2)": 1060,
      "c(cc1": 1061,
      "nc(n1)": 1062,
      "C(O)(": 1063,
      "O=[N+]([O-])": 1064,
      "ncc(": 1065,
      "NC(=O)[C@H](Cc1ccccc1)": 1066,
      "CC(O)=O)": 1067,
      "nc4": 1068,
      "-c2ccc(F)": 1069,
      "[C@H](CO)": 1070,
      ".[Na+].[Na+]": 1071,
      "[nH]c1)": 1072,
      "OCc2ccccc2)": 1073,
      "c1(C)": 1074,
      "S(=O)(C)": 1075,
      "P(=O)(": 1076,
      "[nH]3)": 1077,
      "c1cccnc1": 1078,
      "O)=O": 1079,
      "cc(=O)": 1080,
      "CCNC(": 1081,
      "[C@H](OC(=O)": 1082,
      "4CCOCC4)": 1083,
      "Cc2c[nH]": 1084,
      "c2nnc(": 1085,
      "C1=C(": 1086,
      "c(NC(=O)": 1087,
      "OCO3)": 1088,
      "c3ccc4c(": 1089,
      "c2nc3ccccc3": 1090,
      "c1)C": 1091,
      "O(C)": 1092,
      "c(cc2)": 1093,
      "(F)(F)F)": 1094,
      "c1cc2c(cc1)": 1095,
      "CC(=O)N1": 1096,
      "nn3)": 1097,
      "cc2Cl)": 1098,
      "c2c(Cl)": 1099,
      "/C(=N\\": 1100,
      "c2nc(N": 1101,
      "c(c1": 1102,
      "[C@@](C)": 1103,
      "CSc1n": 1104,
      "cc5)": 1105,
      "no1": 1106,
      "C1CC(": 1107,
      "cccn": 1108,
      "c5ccccc5": 1109,
      "CC1(": 1110,
      "cc1)=O)": 1111,
      "c2nc3c(": 1112,
      "(=O)O": 1113,
      "c2)=O)": 1114,
      "c2cc(-": 1115,
      "c2cc(ccc2": 1116,
      "CCN(C1)": 1117,
      "CC(C)C)=O)": 1118,
      "C2=O)cc1": 1119,
      "c4ccc(F)": 1120,
      "C=1": 1121,
      "C(=O)N[C@@H](CO)": 1122,
      "c2ccc(N": 1123,
      "n(-": 1124,
      "P(": 1125,
      "cccc4)": 1126,
      "c[nH]1)": 1127,
      "CCN1C(=O)": 1128,
      "c3ccc(C)": 1129,
      "N(C)C(=O)": 1130,
      "oc(-": 1131,
      "cn(": 1132,
      "ccn2)": 1133,
      "Nc1ccccc1": 1134,
      ".Cl.Cl": 1135,
      "C1O": 1136,
      "c2C)": 1137,
      "cc2F)": 1138,
      "cc(c1": 1139,
      "c(C#N)": 1140,
      "c2c(F)": 1141,
      "CCSC)": 1142,
      "c4cc(": 1143,
      "4CC4)": 1144,
      "c2cc(ccc2)": 1145,
      "[C@@](C)(": 1146,
      "c5c(": 1147,
      "COCC": 1148,
      "[C@]5": 1149,
      "C(C": 1150,
      "C1=N": 1151,
      "CC[C@]4": 1152,
      "Cn1c(": 1153,
      "O[C@H]2": 1154,
      "C2CCCC2)": 1155,
      "(O)(": 1156,
      "OCCN": 1157,
      "[Cl-]": 1158,
      "C([C@@H](": 1159,
      "1)=O": 1160,
      "[C@@]1(C)": 1161,
      "CC[C@H](": 1162,
      "c(=O)c(": 1163,
      "c2ccccc2c1": 1164,
      "[C@H]2O)": 1165,
      "C([C@H](": 1166,
      "[nH]c1": 1167,
      "CC1)=O": 1168,
      "nc12": 1169,
      "Cn1cc(": 1170,
      "CC(=O)N1CC": 1171,
      "N(CC)": 1172,
      "C(F)(F)F)cc1": 1173,
      "CN(C)C": 1174,
      "C(OCC)=O)": 1175,
      "CCCCCCCCCCCCCCCC": 1176,
      "(C)(C)": 1177,
      "C(=O)N3": 1178,
      "NC(=N)": 1179,
      "c3ccccn3)": 1180,
      "C[C@H](C)": 1181,
      "c(Br)": 1182,
      "n1cc": 1183,
      "[C@@H]([C@H](": 1184,
      "c1ccc2": 1185,
      "S(=O)(=O)N2": 1186,
      "2)=O)": 1187,
      "c3cccc4": 1188,
      ".[Cl-]": 1189,
      "OC[C@H]1": 1190,
      "c2cccnc2)": 1191,
      "c1ccccc1)=O": 1192,
      "c5ccccc5)": 1193,
      "c(F)c1": 1194,
      "N(C)C": 1195,
      "c2c(c(": 1196,
      "CCO)": 1197,
      "c2ccco2)": 1198,
      "N2CCOCC2)": 1199,
      "co3)": 1200,
      "N)=O": 1201,
      "COc1c(": 1202,
      "(C#N)": 1203,
      "o3)": 1204,
      "c1ncc(": 1205,
      "c3c(C)": 1206,
      "c4ccc(Cl)": 1207,
      "c2c(O)": 1208,
      "/N=C(\\": 1209,
      "2CCC(": 1210,
      "P(=O)(O)O": 1211,
      "C2=C(": 1212,
      "[n+]2": 1213,
      "NC(=O)[C@@H](NC(=O)[C@H](": 1214,
      "[C@@H](OC(=O)": 1215,
      "c(OC)c1)": 1216,
      "c2cccs2)": 1217,
      "c2cc(O)": 1218,
      "COC)": 1219,
      "c2cccc(F)": 1220,
      "c3n(": 1221,
      "c3=O)": 1222,
      "c2ccccc21)": 1223,
      "C(CCCC": 1224,
      "[C@@]3(": 1225,
      "c2c(n1)": 1226,
      "%1": 1227,
      "O=S(=O)(": 1228,
      "Cn3": 1229,
      "CCCN)": 1230,
      "[C@@H]2O": 1231,
      "OC3": 1232,
      "c1ccc([N+](=O)[O-])": 1233,
      "c1cccc2c1": 1234,
      "C)=O)=O)": 1235,
      "Nc1cc(": 1236,
      "OCC(": 1237,
      "cc(C)c1": 1238,
      "CCCNC(=O)": 1239,
      "c4ccccc34)": 1240,
      "cc23)": 1241,
      "ccc2c1": 1242,
      "NCCC": 1243,
      "C(=O)N(CC": 1244,
      "c3ccc(O)": 1245,
      "O)C": 1246,
      "c2ccc(C)cc2)": 1247,
      "CCN(C(": 1248,
      "C3(": 1249,
      "I-]": 1250,
      "c2ccccc2n1": 1251,
      "/C=C2\\": 1252,
      "Cn1cn": 1253,
      "[C@@]3(C)": 1254,
      "C[C@H](N)": 1255,
      "c3nn": 1256,
      "c3o": 1257,
      "C(=O)NC(": 1258,
      "N1CCOCC1": 1259,
      "(C)C)=O)": 1260,
      "c2ccncc2)": 1261,
      "OC2": 1262,
      "C(=O)N[C@@H](CCC(=O)O)": 1263,
      "CCc1ccc(": 1264,
      "NCCCC": 1265,
      ".[I-]": 1266,
      "[C@]3(": 1267,
      "ncc3": 1268,
      "N[C@H](": 1269,
      "Cc2ccc(O)cc2)": 1270,
      "N)ncn": 1271,
      "5CC": 1272,
      "oc1": 1273,
      "c1(ccccc1)": 1274,
      "2)c1": 1275,
      "[C@](C)(": 1276,
      "c7": 1277,
      "c3ccc(OC)": 1278,
      "CC[C@H]1": 1279,
      "C(=N": 1280,
      "c(Cl)c1)": 1281,
      "cc(n1)": 1282,
      "-c1cccc(": 1283,
      "CCN)": 1284,
      "C1CCCC1": 1285,
      "C=C(C)": 1286,
      "/C=C/C(=O)": 1287,
      "cc1)C": 1288,
      "[N-]": 1289,
      "n12": 1290,
      "c1ncn": 1291,
      "OC)cc1": 1292,
      "c1ccccc1)=O)": 1293,
      "[C@H](O)[C@@H](O)": 1294,
      "c2ccccc2)c1": 1295,
      "OCO4)": 1296,
      "C1/": 1297,
      "P(=O)(O)O)": 1298,
      "Nc2n": 1299,
      "c1cc2cccc": 1300,
      "CN(C)C(=O)": 1301,
      "c3ccc4c(c3)": 1302,
      "CCCC(=O)N": 1303,
      "3CC3)": 1304,
      "c5cc": 1305,
      "C(=O)OC(C)(C)C)": 1306,
      "c(Cl)c2)": 1307,
      "nnc1": 1308,
      "C#C": 1309,
      "C(=O)N[C@H](C(=O)N[C@H](": 1310,
      "NC(=O)CS": 1311,
      "ccc23)": 1312,
      "l)": 1313,
      "OCO2": 1314,
      "O=C(/C=C/": 1315,
      "CC[C@@H](": 1316,
      "C(=O)NCC(=O)N[C@@H](": 1317,
      "(CC(": 1318,
      "Cl)=O": 1319,
      "c3c(=O)": 1320,
      "Cc1ccccc1)=O)": 1321,
      "c(OC)c2)": 1322,
      "[C@@H]([C@@H](": 1323,
      "C(=O)Nc1ccc(": 1324,
      "O[C@H](CO)[C@@H](O)[C@H](O)": 1325,
      "COc1ccc2c(c1)": 1326,
      "CC2)=O)": 1327,
      "C(C1)": 1328,
      "Cl)Cl": 1329,
      "CCC(=O)N)": 1330,
      "COC": 1331,
      "C(=O)C": 1332,
      "c2ccc([N+](=O)[O-])": 1333,
      "[C@H]1(": 1334,
      "c2ccccc2)=O)": 1335,
      "C(S": 1336,
      "C(C(N": 1337,
      "c2ccc(C(F)(F)F)": 1338,
      "c([N+](=O)[O-])": 1339,
      "[C@H](Cc1ccccc1)": 1340,
      "c2ccc(C)": 1341,
      "[C@@H]6": 1342,
      "OC)c1": 1343,
      "C)N": 1344,
      "[C@H](OC(C)=O)": 1345,
      "N2CCN(": 1346,
      "CC[C@@H]1": 1347,
      "c3cc(F)": 1348,
      "c1cc(c(cc1)": 1349,
      "CC(C)(C)O": 1350,
      "c1)=O)": 1351,
      "CO2)": 1352,
      "C1CCN(CC1)": 1353,
      "n1c2c(": 1354,
      "C(CN": 1355,
      "2CC2)": 1356,
      "S(=O)(=O)c1ccc(": 1357,
      "S(=O)(=O)O)": 1358,
      "c(=O)n2": 1359,
      "c1c(cccc1": 1360,
      "NC(=O)C": 1361,
      "CCC3": 1362,
      "C(C)(C)C)=O)": 1363,
      "nc(c1)": 1364,
      "O[C@@H]3": 1365,
      "[C@H](O)[C@H](O)": 1366,
      "c2cn(": 1367,
      "c3ncc": 1368,
      "ncn2)": 1369,
      "c2ncccc2": 1370,
      "c1(Cl)": 1371,
      "OC1)": 1372,
      "nc2n1": 1373,
      "=C": 1374,
      "c1cccnc1)": 1375,
      "C(=O)O)cc1": 1376,
      "OCc1ccccc1": 1377,
      "ccc(-": 1378,
      "CC#": 1379,
      "Cc1ccc2c(c1)": 1380,
      "C1CN(CC": 1381,
      "CCC(O)=O)": 1382,
      "CCN(CC3)": 1383,
      "C1N(CC": 1384,
      "cc(c2)": 1385,
      "C12CC": 1386,
      "[C@@H]1(": 1387,
      "NC(=S)N": 1388,
      "C=C2": 1389,
      "cc2)n1": 1390,
      "[C@H]12": 1391,
      "c2cc(OC)": 1392,
      "C(/C=C/": 1393,
      "Cc2ccc(cc2)": 1394,
      "C(=S)N": 1395,
      "(c1ccccc1)": 1396,
      "c(-c3ccccc3)": 1397,
      "c1ccncc1": 1398,
      "c3cccnc3)": 1399,
      "CCCCC": 1400,
      "C(=O)N[C@@H](CCC(N)=O)": 1401,
      "C(=O)NCC(=O)N": 1402,
      "N4": 1403,
      "cc1)N": 1404,
      "c1cc(O)": 1405,
      "c2c(cc(": 1406,
      "C(O)=O)=O)": 1407,
      "Cl)c1)": 1408,
      "c(-c2ccccc2)": 1409,
      "Cc1cnc[nH]1)": 1410,
      "c2nc1": 1411,
      "-c2cccc(": 1412,
      "cccc4": 1413,
      "C(CO": 1414,
      "N1(CC": 1415,
      "C(C(=O)O)": 1416,
      "c3cc4c(": 1417,
      "C3CCCCC3)": 1418,
      "NC(=O)[C@H](CCC(=O)O)": 1419,
      "c-2": 1420,
      "c2cccc(Cl)c2)": 1421,
      "CNCC": 1422,
      "Cc1o": 1423,
      "C3CC": 1424,
      "CC(C)(": 1425,
      "/C=C(/": 1426,
      "C(N[C@H](C(N[C@H](": 1427,
      "C1C2": 1428,
      "c2=O)cc1": 1429,
      "OC(C)C)": 1430,
      "[N+](": 1431,
      "c(N2": 1432,
      "N#Cc1ccc(": 1433,
      "cc5": 1434,
      "c1ccc(-c2n": 1435,
      "c(=O)n1": 1436,
      "CCCCNC(=O)": 1437,
      "CCCC3)": 1438,
      "c1ccc(c(c1)": 1439,
      "Cn1c(=O)": 1440,
      "c3ccncc3)": 1441,
      "c(Cl)c3)": 1442,
      "n2cc(": 1443,
      "c(nn1)": 1444,
      "c3ccco3)": 1445,
      "nc21": 1446,
      "CCc1n": 1447,
      "CN(C(": 1448,
      "(CCC)": 1449,
      "CC(C)C": 1450,
      "O2": 1451,
      "[C@H]6": 1452,
      "CCC4": 1453,
      "c1ccc2[nH]": 1454,
      "NC(=O)[C@H](CC(=O)O)": 1455,
      "cc(Cl)c3)": 1456,
      "CC(C": 1457,
      "n2cc": 1458,
      "[C@H]([C@H](": 1459,
      "O=S(=O)(N": 1460,
      "CCC(C)": 1461,
      "[P": 1462,
      "C2(CC1)": 1463,
      "COc1cc2c(cc1": 1464,
      "c(c(c1)": 1465,
      "FC(F)(": 1466,
      "O[C@H](CO": 1467,
      "c(C)c(": 1468,
      "Br.": 1469,
      "Oc2ccc(": 1470,
      "Cc3c(": 1471,
      "c(O)c1": 1472,
      "=S": 1473,
      "c2cccc3)": 1474,
      "c2ccccc2Cl)": 1475,
      "ncc2)": 1476,
      "CC(=O)N)": 1477,
      "c(cc2": 1478,
      "n2)CC1": 1479,
      "c1c(cc(cc1)": 1480,
      "c2ccc(OC)cc2)": 1481,
      "NC(=O)[C@@H](NC(=O)[C@@H](": 1482,
      "c1cc(C(F)(F)F)": 1483,
      "N1C(": 1484,
      "[C@@H](C1)": 1485,
      "F)cc1)": 1486,
      "c3cc(-": 1487,
      "C1CO": 1488,
      "OCO2)": 1489,
      "c1nc(N": 1490,
      "NC(=O)[C@H](CCC(N)=O)": 1491,
      "OC(=O)C)": 1492,
      "CO)=O)": 1493,
      "[C@H](CC(C)C)": 1494,
      "CCCN2": 1495,
      "c2cc(Cl)ccc2": 1496,
      "o2)cc1": 1497,
      "[C@@H](OC(C)=O)": 1498,
      "O=S(": 1499,
      "c1c(=O)": 1500,
      "Cc1[nH]": 1501,
      "nn3": 1502,
      "c1cccc(Cl)c1": 1503,
      "c1ccc(Br)": 1504,
      "CS(=O)(=O)N": 1505,
      "c1ccccn1)": 1506,
      "ccccc3": 1507,
      "C(c1ccc(cc1)": 1508,
      "C(=O)N[C@@H](CC(=O)O)": 1509,
      "cc3F)": 1510,
      "C1C": 1511,
      "[C@@H](C": 1512,
      "O=c1[nH]": 1513,
      "NC(=O)C)": 1514,
      "c3c[nH]": 1515,
      "C1CCCC1)": 1516,
      "-c1o": 1517,
      "S(=O)(C)=O)": 1518,
      "[S+]([O-])": 1519,
      "OCC(O)": 1520,
      "CCC(N": 1521,
      "on1)": 1522,
      "CCNCC3)": 1523,
      "CC1CCCCC1)": 1524,
      "[C@H](CC)C)": 1525,
      "c2nc(C)": 1526,
      "/c(": 1527,
      "Cn1cc": 1528,
      "C(=O)NO)": 1529,
      "[Si": 1530,
      "c3ccc(Br)": 1531,
      "CCCCN)=O)": 1532,
      "NC([C@@H](NC([C@@H](": 1533,
      "[C@@H](CO": 1534,
      "c(F)c2)": 1535,
      "c2cc(C(F)(F)F)": 1536,
      "C(=O)N[C@@H](CC(N)=O)": 1537,
      "sc2": 1538,
      "CCN3": 1539,
      "[Si]": 1540,
      "CCN(S(=O)(=O)": 1541,
      "c2ccc(O": 1542,
      "C(=O)NCCCC": 1543,
      "c1ncccc1": 1544,
      "C(=O)c1ccccc1": 1545,
      "C2)c1": 1546,
      "c2cccc(C(F)(F)F)": 1547,
      "OCc3ccccc3)": 1548,
      "(CC)CC)": 1549,
      "[C@H]1O)": 1550,
      "c(c2": 1551,
      "OC)C": 1552,
      "O=C1N": 1553,
      "C(N(C": 1554,
      "[N+]=": 1555,
      "C(=O)C)": 1556,
      "(F)F)": 1557,
      "cccc(": 1558,
      "NC1=O)": 1559,
      "c1cc(Cl)ccc1": 1560,
      "c1ccncc1)": 1561,
      "Cc1ccc(Cl)": 1562,
      "C)C)=O)": 1563,
      "=O)c1": 1564,
      "C(=O)(N": 1565,
      "C=C(C)C)": 1566,
      "Oc1ccccc1": 1567,
      "c2ccccc2F)": 1568,
      "ccc1)=O": 1569,
      "c2nc(-": 1570,
      "c1ccco1)": 1571,
      "C(=O)C(": 1572,
      "/N=N/": 1573,
      "OCC(N": 1574,
      "OC(C)(C)": 1575,
      "c4ccc(F)cc4)": 1576,
      "CC1)=O)": 1577,
      "e]": 1578,
      "[nH]c2": 1579,
      "CCCN1CC": 1580,
      "c2ccc(O)cc2)": 1581,
      "c2cc(OC)c(OC)": 1582,
      "CC(N)": 1583,
      "c4ccccc43)": 1584,
      "c2c(c1": 1585,
      "ncn1": 1586,
      "c2ccc3ccccc3": 1587,
      "c3cc(C)": 1588,
      "Cc3ccccc3": 1589,
      "c(c3)": 1590,
      "Cc2c[nH]c3ccccc23)": 1591,
      "c1cccs1)": 1592,
      "CCNCC2)": 1593,
      "cc(cc3)": 1594,
      "3CCC(": 1595,
      "S(=O)(=O)[O-])": 1596,
      "=CC(=O)": 1597,
      "c2ncc(": 1598,
      "[C@H](O)C)": 1599,
      "c2c(OC)": 1600,
      "nc(n2)": 1601,
      "c3c(F)": 1602,
      "-c2ccc(F)cc2)": 1603,
      "Nc1c(": 1604,
      "NC(=O)c1ccc(": 1605,
      "[N+]([O-])=O": 1606,
      "c(=O)o": 1607,
      "N)cc1": 1608,
      "n3cn": 1609,
      "C1)=O": 1610,
      "no2)": 1611,
      "n(-c2ccccc2)": 1612,
      "CC[C@H](C)[C@H](": 1613,
      "CO1)": 1614,
      "c2ccc(O)": 1615,
      "CCCn1": 1616,
      "C2CCCC": 1617,
      "C=C)": 1618,
      "c3c4c(": 1619,
      "C(=C)": 1620,
      "C=CC": 1621,
      "[C@H](C": 1622,
      "s2)cc1": 1623,
      "C(F)(F)F)cc1)": 1624,
      "-c1s": 1625,
      "c2ccc(Cl)cc2": 1626,
      "c3ccccc3)CC2)": 1627,
      "[C@]12CC": 1628,
      "F)c1)": 1629,
      "[C@]12C": 1630,
      "/C(C)=C/": 1631,
      "ccc1OC": 1632,
      "=C(C)": 1633,
      "C(=N)N": 1634,
      "CO1": 1635,
      "c2)n1": 1636,
      "[C@@H](O)[C@H](": 1637,
      "=C(N": 1638,
      "Cc1ccc(NC(=O)": 1639,
      "c1(OC)": 1640,
      "Cc1c[nH]cn1)": 1641,
      "c3ccc(C(F)(F)F)": 1642,
      "C/C(=C\\": 1643,
      "c2nc(-c3ccc(": 1644,
      "c2cc(Br)": 1645,
      "1C": 1646,
      "CCCCO": 1647,
      "C2)=O)": 1648,
      "c4cccc(": 1649,
      "sc2c1": 1650,
      "C(CO)": 1651,
      "c3c(Cl)": 1652,
      "cc(F)c3)": 1653,
      "sc1)": 1654,
      "4)cc3)": 1655,
      "[C@H]1CC[C@H](": 1656,
      "OCC2": 1657,
      "n(c(": 1658,
      "C(c1ccc(": 1659,
      "[n+]([O-])": 1660,
      "[N+]=[N-]": 1661,
      "nc(S": 1662,
      "cc32)": 1663,
      "[C@@]4(C)": 1664,
      "C(=O)[O-])": 1665,
      "Cc1cn(": 1666,
      "O[C@H](CO)[C@@H](O)": 1667,
      "c2ccc3c(c2)OCO3)": 1668,
      "[C@]23": 1669,
      "CCc1ccccc1": 1670,
      "c(N3": 1671,
      "C(N[C@H](C(N[C@@H](": 1672,
      "C(NC": 1673,
      "CCN(C)CC": 1674,
      "c3cccs3)": 1675,
      "N2CCN(CC2)": 1676,
      "C#N)cc1": 1677,
      "C(=O)N[C@H](C(N[C@@H](": 1678,
      "F)=O": 1679,
      "no1)": 1680,
      "3CC(CC": 1681,
      "N1CCCC1": 1682,
      "c3ccc(C)cc3)": 1683,
      "c1ncn2": 1684,
      "/C=C/C=": 1685,
      "ccc(=O)": 1686,
      "CCN(C)CC2)": 1687,
      "c1ccccn1": 1688,
      "NC(=O)CO": 1689,
      "c1cc(Br)": 1690,
      "c1ccc(OC)cc1": 1691,
      "c2ccc1": 1692,
      "[C@@H](NC(": 1693,
      "C2C(": 1694,
      "nc1N": 1695,
      "-c2ccc(Cl)cc2)": 1696,
      "CC5)": 1697,
      "[C@H](C1)": 1698,
      "[C@@H]4CC": 1699,
      "c1c2cccc": 1700,
      "NC(N)": 1701,
      "c3nc(-": 1702,
      "c(=O)n(C)": 1703,
      "cc12)": 1704,
      "c3ccc(OC)cc3)": 1705,
      "2H]": 1706,
      "c2ccc(C(=O)N": 1707,
      "C(F)(F)F)c1": 1708,
      "C(=O)N[C@H]1": 1709,
      "c1(F)": 1710,
      "cc3Cl)": 1711,
      "CC(C)C[C@H](": 1712,
      "[2H]": 1713,
      "O)C)": 1714,
      "n2C)": 1715,
      "(C3": 1716,
      "on1": 1717,
      "Cc1cc2": 1718,
      "[C@H](C(C)C)": 1719,
      "CNS(=O)(=O)": 1720,
      "CCN(C)CC3)": 1721,
      "Oc1c(": 1722,
      "(c2ccccc2)": 1723,
      "(Cc2ccccc2)": 1724,
      "NC(=O)[C@H](CC(N)=O)": 1725,
      "NS(=O)(": 1726,
      "co1": 1727,
      "C(N(C)": 1728,
      "Cc1cccc2": 1729,
      "C(N)=": 1730,
      "/C1=": 1731,
      "nnn1": 1732,
      "NCCN": 1733,
      "ccc(c3)": 1734,
      "NS(": 1735,
      "c1cccs1": 1736,
      "c1ccc(OC)cc1)": 1737,
      "ccc12)": 1738,
      "NC(=O)[C@@H](NC(=O)": 1739,
      "c2c(ccc(": 1740,
      "CCN(CC(=O)N": 1741,
      "c4ccc(cc4)": 1742,
      "C2(C)C)": 1743,
      "ccccc23)": 1744,
      "CC(CC": 1745,
      "c1)OC": 1746,
      "NC)": 1747,
      "CNC": 1748,
      "Cc1cs": 1749,
      "c1)O": 1750,
      "c(OC)c3)": 1751,
      "c(S": 1752,
      "[C@@H]1O)": 1753,
      "c3C)": 1754,
      "/N=C(/": 1755,
      "/C=C1\\": 1756,
      "OCC)=O)": 1757,
      "C1)=O)": 1758,
      "[C@@H](C)O": 1759,
      "C[C@@H]1CC": 1760,
      "[C@H]3O)": 1761,
      "CCNCC1": 1762,
      "C(=O)N(C)C)": 1763,
      "NC(=O)[C@@H](NC([C@H](": 1764,
      "CC1=C(": 1765,
      "C1(CC": 1766,
      "c3nc4ccccc4": 1767,
      "S(=O)(=O)N1": 1768,
      "C(OC": 1769,
      "cn3": 1770,
      "C1CC2": 1771,
      "C1(=O)": 1772,
      "c1nc(C)": 1773,
      "c(O)c(": 1774,
      "c4ccc(Cl)cc4)": 1775,
      "c3c2cccc3)": 1776,
      "Cc1ccc(cc1)O)": 1777,
      "Cc1ccc(S(=O)(=O)N": 1778,
      "c3ccc4": 1779,
      "cnc2)": 1780,
      "NC(C)": 1781,
      "NC([C@@H](NC([C@H](": 1782,
      "c-": 1783,
      "C(c1c(": 1784,
      "ccc2n1": 1785,
      "[C@@H]2CCCN2C(=O)": 1786,
      "c3ccc(O)cc3)": 1787,
      "c3ccccc3Cl)": 1788,
      "C1=C(C)": 1789,
      "ccc1Cl": 1790,
      "CO[C@@H]1": 1791,
      "CN2CCN(": 1792,
      "C4=O)": 1793,
      "CNC(=O)N": 1794,
      "C(C)C)C(C)C)": 1795,
      "O=C(CC": 1796,
      "(CC3)": 1797,
      "Cc2n": 1798,
      "c2ccc(NC(=O)": 1799,
      "C1(N": 1800,
      "c[nH]2)": 1801,
      "c2ccc(cc2)Cl)": 1802,
      "c4c3)": 1803,
      "OO": 1804,
      "CC)=O": 1805,
      "CCOCC": 1806,
      "O[C@H]3": 1807,
      "c1cc(cc(c1)": 1808,
      "cc(cc1": 1809,
      "NC(=O)C(": 1810,
      "N1CCOCC1)": 1811,
      "cc(OC)c1": 1812,
      "oc2c1": 1813,
      "[C@H]4CC": 1814,
      "c1ccc(O)cc1": 1815,
      "C1(C)": 1816,
      "C(C)=": 1817,
      "Cc1s": 1818,
      "c(-c3ccc(": 1819,
      "[C@]4(C)": 1820,
      "N1)": 1821,
      "c3n2)": 1822,
      "c2cccnc2": 1823,
      "n3c(": 1824,
      "C(N(CC": 1825,
      "ccc5": 1826,
      "c1co": 1827,
      "c1ccc(C(=O)N": 1828,
      "c3ccccc3F)": 1829,
      "c2cc1OC": 1830,
      "c2c(cc(cc2)": 1831,
      "c1cccc(c1": 1832,
      "CCN1CCN(": 1833,
      "c1ccc(-n2": 1834,
      "S(=O)(=O)N1CC": 1835,
      "c2c1cc(": 1836,
      "C(=O)N[C@@H](Cc1c[nH]c2ccccc12)": 1837,
      "ncn1)": 1838,
      "c(=O)[nH]c1=O": 1839,
      "c2nc(N)": 1840,
      "C2CCN(": 1841,
      "C(C)C)cc1": 1842,
      "COc2ccc(": 1843,
      "C(N2CC": 1844,
      "C(=O)C=": 1845,
      "[C@@](O)(": 1846,
      "[N+]1": 1847,
      "CC2)CC1": 1848,
      "c2ccc1)": 1849,
      "c1sc(": 1850,
      "c3cc(ccc3": 1851,
      "c1cccc2ccccc1": 1852,
      "[N+]=[N-])": 1853,
      "ccc1F": 1854,
      "CO[C@H]1": 1855,
      "n1nc(": 1856,
      "(F)(F)F": 1857,
      "ncn2": 1858,
      "Cc2cn": 1859,
      "c1cc(-": 1860,
      "c1ccc(-c2ccc(": 1861,
      "C/C(=N\\": 1862,
      "nc3c(": 1863,
      "S(C)(=O)=O": 1864,
      "c1ccc(cc1)Cl)": 1865,
      "C(Cl)": 1866,
      "OCC2)cc1": 1867,
      "c3cc(OC)c(OC)": 1868,
      "Nc1cccc(": 1869,
      "NC(=O)[C@@H]1CCCN1C(=O)": 1870,
      "CCCCC)": 1871,
      "C(C1": 1872,
      "CC=C(C)C)": 1873,
      "c2cccc(F)c2)": 1874,
      "[C@@H]4[C@@]5": 1875,
      "/C=N/NC(=O)": 1876,
      "CCN2CC": 1877,
      "n1C": 1878,
      "c1c2c(ccc1)": 1879,
      "=O)CC": 1880,
      "F)cc3)": 1881,
      "CN1CCN(CC1)": 1882,
      "B(O)": 1883,
      "Cl.Cl": 1884,
      "COc1cc(OC)": 1885,
      "cc(NC(=O)": 1886,
      "CO3)": 1887,
      "(C4)": 1888,
      "c2cc3ccccc3": 1889,
      "c4cccn": 1890,
      "[C@@H]1C": 1891,
      "3CC4CC": 1892,
      "Cc1no": 1893,
      "c(C(=O)O)": 1894,
      "[n+](C)": 1895,
      "ncc": 1896,
      "c(-c2ccc(": 1897,
      "[C@](C)(O)": 1898,
      "C(=O)N[C@@H](Cc1ccc(O)cc1)": 1899,
      "4)CC3)": 1900,
      "[C@H](O1)": 1901,
      "nnc2": 1902,
      "CCOc1ccccc1": 1903,
      "c3ccc(cc3": 1904,
      "CN(CC)": 1905,
      "OC(C)": 1906,
      "OC[C@H]1O[C@@H](": 1907,
      "N=C(N": 1908,
      "ccc(Cl)": 1909,
      "F)F": 1910,
      "c1nn(": 1911,
      "c12cc(": 1912,
      "Nc1cc": 1913,
      "SS": 1914,
      "c2cc(N": 1915,
      "c2c3ccccc3": 1916,
      "-c1[nH]": 1917,
      "c1(=O)": 1918,
      "c1ccco1": 1919,
      "C(N)=O)=O)": 1920,
      "C(OC)": 1921,
      "COc1ccc(-": 1922,
      "OCCOCCOCCOCC": 1923,
      "CCCCCCCCCC": 1924,
      "c1n2": 1925,
      "[C@@H](C2)": 1926,
      "c2c(cccc2": 1927,
      "c6cccc": 1928,
      "OCC(=O)": 1929,
      "c1ccc(C)cc1)": 1930,
      "c2ccc(C#N)": 1931,
      "[C@@]23": 1932,
      "NC(=O)[C@H](C(C)C)": 1933,
      "c3cccc(Cl)c3)": 1934,
      "cc([N+](=O)[O-])": 1935,
      "Cn2cn": 1936,
      "[C@@]1(O)": 1937,
      "4CCCCC4)": 1938,
      "c2c3": 1939,
      "COc1ccc2c(": 1940,
      "OC[C@@H]1": 1941,
      "nn(C)": 1942,
      "c2ccc(cc2)F)": 1943,
      "ccc(C)": 1944,
      "NCCCN": 1945,
      "C(F)(F)F)=O)": 1946,
      "FC(": 1947,
      "CCCCCCCC)": 1948,
      "Cc1ccccc1)=O": 1949,
      "CN(C1)": 1950,
      "Cc1c(C)": 1951,
      "n2cnc3c(": 1952,
      "[C@@H](O)[C@@H](": 1953,
      "[C@@H]3O": 1954,
      "C[n+]1": 1955,
      "oc(=O)": 1956,
      "[C@H]1C": 1957,
      "COc1ccc(NC(=O)": 1958,
      "c2cccc3ccccc23)": 1959,
      "CC(=O)N(": 1960,
      "[C@H]([C@H](O)": 1961,
      "C2)C1": 1962,
      "C(=O)N1)": 1963,
      "C(N3": 1964,
      "N1CCCC": 1965,
      "nn2)cc1": 1966,
      "CCCCCC)": 1967,
      "C1)C": 1968,
      "C)=O)C": 1969,
      "n(CC(=O)N": 1970,
      "N1CCC(": 1971,
      "[C@@]4(": 1972,
      "C1CCN(C": 1973,
      "c4ccccc4)CC3)": 1974,
      "c45)": 1975,
      "C(=O)NS(=O)(=O)": 1976,
      "c(n(": 1977,
      "c3ccccc23)cc1": 1978,
      "c2cc(NC(=O)": 1979,
      "[C@H]1CC[C@H]2": 1980,
      "c4ccc(O)": 1981,
      "C4CC4)": 1982,
      "NC(=O)c1ccccc1": 1983,
      "c2ccccc2c1)": 1984,
      "sc2)": 1985,
      "c1ccc(S(=O)(=O)N": 1986,
      "c1ccc(Br)cc1": 1987,
      "c2ccc(Br)cc2)": 1988,
      "c3cc(Cl)ccc3": 1989,
      "C(C#N)": 1990,
      "c4ccccc4)cc3)": 1991,
      "COc1ccc(-c2n": 1992,
      "NC(=O)[C@H](Cc1ccc(O)cc1)": 1993,
      "n1)C": 1994,
      "[C@]1(O)": 1995,
      "(O)=O": 1996,
      "C)(": 1997,
      "c3c(-": 1998,
      "OC2)": 1999,
      "c1ccc(OC": 2000,
      "Cc1ccc(C(=O)N": 2001,
      "Oc1cc(": 2002,
      "C(N)=N": 2003,
      "C[N+](C)": 2004,
      "c2nc(-c3cc": 2005,
      "C(=O)[C@H](": 2006,
      "NC(=O)CNC(=O)[C@H](": 2007,
      "CC[C@]43C)": 2008,
      "c2cccc(C)": 2009,
      "c1ccc(O)cc1)": 2010,
      "C2=O)=O)": 2011,
      "c1nc2ccccc2": 2012,
      "c(OCC": 2013,
      "Cc2cc(": 2014,
      "c1(C": 2015,
      "C(=O)N1CCN(": 2016,
      "CSSC[C@@H](": 2017,
      "c2c1cccc2": 2018,
      "cc(n2)": 2019,
      "cc2C)": 2020,
      "(CC(N": 2021,
      "C2CCN(CC2)": 2022,
      "ccc2)=O)": 2023,
      "[2H])": 2024,
      "Cl)cc3)": 2025,
      "COc1cc2c(cc1OC)": 2026,
      "CN1C(": 2027,
      "CCCN3": 2028,
      "c3cc2)": 2029,
      "c%1": 2030,
      "on2)": 2031,
      "c3cc(O)": 2032,
      "c1(N": 2033,
      "O)CC": 2034,
      "C(=C/": 2035,
      "Oc1ccc(cc1)": 2036,
      "N1CCN(C(=O)": 2037,
      "Nc1ccc(cc1)": 2038,
      "c6)": 2039,
      "N1CCCCC1": 2040,
      "c3cc(OC)": 2041,
      "c(Cl)cc1": 2042,
      "c43)": 2043,
      "c12cccc": 2044,
      "c1ccc(N2": 2045,
      "ccc(OC)": 2046,
      "n3cc": 2047,
      "c3ncccc3": 2048,
      "NC(=O)c1cc(": 2049,
      "C1=O)=O)": 2050,
      "C5)": 2051,
      "n5": 2052,
      "c(F)c1)": 2053,
      "c4cc5": 2054,
      "OC)cc2)": 2055,
      "c1nc(N)": 2056,
      "n2c1": 2057,
      "ccc(N": 2058,
      "c3ccccc32)cc1": 2059,
      "NC(=O)/C=C/": 2060,
      "NC(=O)[C@@H]1": 2061,
      "c2ccc3": 2062,
      "[C@@]2(O)": 2063,
      "COc1ccc(cc1)": 2064,
      "OC(F)F)": 2065,
      "P(O": 2066,
      "S2": 2067,
      "c(ccc1)": 2068,
      "C[C@@H]4": 2069,
      "Cc1c2c(": 2070,
      "[C@@H](CC(C)C)": 2071,
      "[C@H]1[C@@H](": 2072,
      "c2nnc(-": 2073,
      "[C@@H]2[C@H](": 2074,
      "OC)cc1)": 2075,
      "Cc1ccc(Cl)cc1": 2076,
      "c3cccc(c3)": 2077,
      "CC[C@H]2": 2078,
      "c2c(N": 2079,
      "c1cc(N": 2080,
      "CCN(C)C": 2081,
      "CCCC4)": 2082,
      "N1CCN(C": 2083,
      "N=C1": 2084,
      "[C@@H](N": 2085,
      "c1ncnc2": 2086,
      "c1c(N": 2087,
      "CC1)C": 2088,
      "Nc1ncnc2": 2089,
      "CN(S(=O)(=O)": 2090,
      "Cn1nc(": 2091,
      "c([nH]": 2092,
      "c4ccn": 2093,
      "C(CC2)": 2094,
      "c2ccc(cc2)OC)": 2095,
      "O4)": 2096,
      "co1)": 2097,
      "C(C)=C/": 2098,
      "C(C)C)=O": 2099,
      "CC2)n1": 2100,
      "[C@H](C(=O)N": 2101,
      "c1ccccc1)c1ccccc1": 2102,
      "CCC4)": 2103,
      "[nH]c2c1": 2104,
      "[nH]c2)": 2105,
      "c(n3)": 2106,
      "C(=O)C1": 2107,
      "n(c1)": 2108,
      "c1cc(=O)": 2109,
      "3)c1": 2110,
      "[C@@H]2O)": 2111,
      "-c1": 2112,
      "=O)=O)=O)=O)": 2113,
      "C)C(": 2114,
      "-c3c(": 2115,
      "COc1ccc(S(=O)(=O)N": 2116,
      "nc(O)": 2117,
      "Clc1ccc(": 2118,
      "C(=O)N[C@H](C(N[C@H](": 2119,
      "CN3CC": 2120,
      "[C@H](C)[C@@H](O": 2121,
      "COCCO": 2122,
      "onc1": 2123,
      "[nH]c(-": 2124,
      "7)": 2125,
      "/C=C/C(=O)N": 2126,
      "c2c(ccc(c2)": 2127,
      "C(F)(F)F)=O": 2128,
      "c2ccc(S(=O)(=O)N": 2129,
      "(CC(=O)": 2130,
      "NC(=O)[C@H](Cc1c[nH]c2ccccc12)": 2131,
      "c1ccc(-c2cn": 2132,
      "c2O)": 2133,
      "Cc1cc(Cl)": 2134,
      "c1cc(c(": 2135,
      "cc21)": 2136,
      "SCC(N": 2137,
      "C[C@H]4": 2138,
      "c2n(C)": 2139,
      "/C=C(\\C)": 2140,
      "cccn2)": 2141,
      "C[C@@H](O": 2142,
      "cc(C(=O)O)": 2143,
      "CC1=": 2144,
      "Cc1ccc(F)cc1": 2145,
      "[C@H]2[C@@H](": 2146,
      "C(C)(C)C)cc1": 2147,
      "C(=O)N[C@@H](CCCN=C(N)N)": 2148,
      "c1ccc(C)cc1": 2149,
      "c1cnc(N": 2150,
      "[C@@H]5CC[C@]43C)": 2151,
      "C[C@H]1CC": 2152,
      "C(CS": 2153,
      "c2cc(-c3ccc(": 2154,
      "[C@](O)": 2155,
      "[C@H]2C": 2156,
      "C(=O)Nc1ccccc1": 2157,
      "ccc(N)": 2158,
      "c1cnc(": 2159,
      "C2(CC": 2160,
      "[C@]3(C)CC": 2161,
      "CCCC(=O)": 2162,
      "C(N)=N)=O)": 2163,
      "cc(O": 2164,
      "[C@H](N": 2165,
      "c1c(cc2": 2166,
      "nc4)": 2167,
      "CCCC3": 2168,
      "n(-c3ccccc3)": 2169,
      "c1ccc([N+](=O)[O-])cc1": 2170,
      "n4cn": 2171,
      "N1CCN(CC": 2172,
      "C2C3": 2173,
      "CC(O": 2174,
      "[C@H]2O": 2175,
      "c3cc(ccc3)": 2176,
