{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "(\\[[^\\]]+\\]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\|\\/|:|@|\\?|>>|\\*|\\%[0-9]{2,3}|[0-9]+)"
    },
    "behavior": "MergedWithPrevious",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<s>": 0,
      "</s>": 1,
      "<unk>": 2,
      "<pad>": 3,
      "<mask>": 4,
      "\n": 5,
      "#": 6,
      "%": 7,
      "(": 8,
      ")": 9,
      "+": 10,
      "-": 11,
      ".": 12,
      "/": 13,
      "0": 14,
      "1": 15,
      "2": 16,
      "3": 17,
      "4": 18,
      "5": 19,
      "6": 20,
      "7": 21,
      "8": 22,
      "9": 23,
      "=": 24,
      "@": 25,
      "A": 26,
      "B": 27,
      "C": 28,
      "F": 29,
      "G": 30,
      "H": 31,
      "I": 32,
      "K": 33,
      "L": 34,
      "M": 35,
      "N": 36,
      "O": 37,
      "P": 38,
      "R": 39,
      "S": 40,
      "T": 41,
      "X": 42,
      "Z": 43,
      "[": 44,
      "\\": 45,
      "]": 46,
      "a": 47,
      "b": 48,
      "c": 49,
      "e": 50,
      "g": 51,
      "i": 52,
      "l": 53,
      "n": 54,
      "o": 55,
      "p": 56,
      "r": 57,
      "s": 58,
      "t": 59,
      "cc": 60,
      "CC": 61,
      "O)": 62,
      "=O)": 63,
      "C(": 64,
      "c1": 65,
      "c(": 66,
      "c2": 67,
      "H]": 68,
      "[C": 69,
      "[C@": 70,
      "C)": 71,
      "C(=O)": 72,
      "c1cc": 73,
      "c3": 74,
      "H](": 75,
      "[C@@": 76,
      "c2cc": 77,
      ")cc": 78,
      "(=O)": 79,
      "1\n": 80,
      "(C)": 81,
      "C(=O)N": 82,
      "CCCC": 83,
      "CN": 84,
      "[C@H](": 85,
      "F)": 86,
      "c1ccc(": 87,
      "c3cc": 88,
      "2)": 89,
      "[C@@H](": 90,
      "CO": 91,
      "NC(=O)": 92,
      "Cl": 93,
      "c1cccc": 94,
      "cn": 95,
      "N)": 96,
      "c2cccc": 97,
      "c4": 98,
      "CCN": 99,
      "C1": 100,
      "[C@H]": 101,
      "3)": 102,
      "[C@@H]": 103,
      "=C(": 104,
      "c1\n": 105,
      "[n": 106,
      "c2ccc(": 107,
      "nc(": 108,
      "c2ccccc2": 109,
      "C2": 110,
      "C(C)": 111,
      "[nH]": 112,
      "c3cccc": 113,
      "CC(=O)": 114,
      "1)": 115,
      "CCO": 116,
      "O\n": 117,
      "S(=O)": 118,
      ")cc1\n": 119,
      "(F)": 120,
      "c1)": 121,
      "O=C(": 122,
      "CCN(": 123,
      "S(=O)(=O)": 124,
      "=C": 125,
      "Cl)": 126,
      "OC)": 127,
      "cccc": 128,
      "CC(C)": 129,
      "c3ccccc3": 130,
      "c1cc(": 131,
      "n1": 132,
      "F)cc": 133,
      "n2": 134,
      "cc(": 135,
      "CCCN": 136,
      "[C@H]1": 137,
      "C(F)": 138,
      "c1n": 139,
      "c3ccc(": 140,
      "c2c(": 141,
      "CCC": 142,
      "2\n": 143,
      "[C@@H]1": 144,
      "C(F)(F)": 145,
      "/C": 146,
      "(C": 147,
      "Cl)cc": 148,
      "OC": 149,
      "C(=O)N[C@@H](": 150,
      "+]": 151,
      "c2n": 152,
      "CC(=O)N": 153,
      "c2)": 154,
      "NC(=O)[C@H](": 155,
      "[C@]": 156,
      "c2ccccc2)": 157,
      "4)": 158,
      "-]": 159,
      "Cc1ccc(": 160,
      "c(=O)": 161,
      "(O)": 162,
      "CC1\n": 163,
      "=O\n": 164,
      "=C/": 165,
      "COc1ccc(": 166,
      "Cc1cccc": 167,
      "O)cc": 168,
      "[N": 169,
      "[C@@]": 170,
      "[O": 171,
      "CC1": 172,
      "[O-]": 173,
      "[C@H]2": 174,
      "[C@@H]2": 175,
      "c2cc(": 176,
      "c(-": 177,
      "C(=": 178,
      "Cc1": 179,
      "N1": 180,
      "Br": 181,
      "C\n": 182,
      "c5": 183,
      "C3": 184,
      "[N+]": 185,
      "CCC(": 186,
      "c4cccc": 187,
      "C(=O)O)": 188,
      "N2": 189,
      "CC2)": 190,
      "n1\n": 191,
      "O=": 192,
      "c1ccccc1": 193,
      "[C@H](O)": 194,
      "CC(": 195,
      "C)cc": 196,
      "c1cccc(": 197,
      "C(C)(C)": 198,
      "CC2": 199,
      "c3c(": 200,
      "C1\n": 201,
      "3)cc": 202,
      "[C@@H](O)": 203,
      "c3)": 204,
      "ccc(": 205,
      "nn": 206,
      "nc(-": 207,
      "=N": 208,
      "c3ccccc3)": 209,
      "CO)": 210,
      "/C=C/": 211,
      "cs": 212,
      "O=C(N": 213,
      "[C@@H](C)": 214,
      "C#": 215,
      "c[nH]": 216,
      "[C@H](C)": 217,
      "N)=O)": 218,
      "ncc": 219,
      "CS": 220,
      "C(F)(F)F)": 221,
      "CN1": 222,
      ")cc1": 223,
      "c4ccccc4": 224,
      "(=O)[O-]": 225,
      "[N+](=O)[O-]": 226,
      "(-": 227,
      "(CC": 228,
      "c(C)": 229,
      "C2)": 230,
      "Cc1cc": 231,
      "CNC(=O)": 232,
      "2)cc1\n": 233,
      "CCCCCCCC": 234,
      "[C@H]3": 235,
      "c12\n": 236,
      "c1ccccc1)": 237,
      "CC3)": 238,
      "c1ccccc1\n": 239,
      "COC(=O)": 240,
      "c(N": 241,
      "C[C@H](": 242,
      "nc2": 243,
      "Cl\n": 244,
      "O=C(O)": 245,
      "[C@@H]3": 246,
      "C(=O)N1": 247,
      "C(C)C)": 248,
      "CN(": 249,
      "nc(N": 250,
      "C(=O)O": 251,
      "CC)": 252,
      "Cn1": 253,
      "n2)": 254,
      "CN(C)": 255,
      "C(=N)": 256,
      "c(OC)": 257,
      "=O)cc": 258,
      "c2cn": 259,
      "S(=O)(=O)N": 260,
      "CC(C)C)": 261,
      "n3": 262,
      "COc1cc(": 263,
      "c(O)": 264,
      "CC[C@]": 265,
      "C=": 266,
      "F\n": 267,
      "c1ccc(-": 268,
      "/N": 269,
      "c4ccc(": 270,
      "c2cccc(": 271,
      "OC(=O)": 272,
      "S)": 273,
      "c1cn": 274,
      "COc1cc": 275,
      "Cc1cc(": 276,
      "Cc1ccccc1)": 277,
      "OC\n": 278,
      "c2c(c1)": 279,
      "co": 280,
      "c3n": 281,
      "O=C1": 282,
      "CC(C)(C)": 283,
      "C(F)(F)F)cc": 284,
      "c(Cl)": 285,
      "NC(=O)[C@@H](": 286,
      "C(C)=O)": 287,
      "CCN1": 288,
      "CN2": 289,
      "4)cc": 290,
      "C1=O\n": 291,
      "C[C@@H](": 292,
      "Cc1n": 293,
      "c3cc(": 294,
      "=C\\": 295,
      "Br)": 296,
      "CCOC(=O)": 297,
      "C(=N)N)": 298,
      "N(C)": 299,
      "C(=O)N2": 300,
      "c2ccc(Cl)cc": 301,
      "C3)": 302,
      "cc(-": 303,
      "c1-": 304,
      "N(": 305,
      "5)": 306,
      "cc1": 307,
      "C1)": 308,
      "C(=O)N[C@H](": 309,
      "/C(": 310,
      "P(=O)": 311,
      "CCN(C(=O)": 312,
      "c23)": 313,
      "CC1)": 314,
      "C(N)=O)": 315,
      "ncn": 316,
      "OCC": 317,
      "CCCNC(=N)N)": 318,
      "CCCCN)": 319,
      "NC(=O)N": 320,
      "C[C@@H]1": 321,
      "c1c(": 322,
      "CC(=O)O)": 323,
      "[O-])": 324,
      "cc2": 325,
      "C[C@H]1": 326,
      "C(=O)O\n": 327,
      "Br)cc": 328,
      "c4cc": 329,
      "C#N)": 330,
      "O[C@H](": 331,
      "[N+](=O)[O-])": 332,
      "c2ccc(F)cc": 333,
      "c1=O\n": 334,
      "[n+]": 335,
      "Cc2ccccc2)": 336,
      "c1nc(": 337,
      "N#": 338,
      "C2\n": 339,
      "OCO": 340,
      "[C@]1": 341,
      "c(F)": 342,
      "[C@@]2": 343,
      "2)c1\n": 344,
      "c2nc(": 345,
      "NS(=O)(=O)": 346,
      "CCN(C)": 347,
      "c(=O)[nH]": 348,
      "c12)": 349,
      "C(C)(C)C)": 350,
      "N3": 351,
      "2)CC1\n": 352,
      "c2c1\n": 353,
      "o1\n": 354,
      "CC[C@H](": 355,
      "n(C)": 356,
      "CCCN1": 357,
      "c2ccc(-": 358,
      "c4)": 359,
      "nc3": 360,
      "c2[nH]": 361,
      "s1\n": 362,
      "C4": 363,
      "CC3": 364,
      "n(": 365,
      "N=C(": 366,
      "C(O)": 367,
      "c4ccccc4)": 368,
      ".Cl\n": 369,
      "[C@@H]4": 370,
      "c1ccc2c(c1)": 371,
      ")cc2": 372,
      "c1cc2": 373,
      "c2c1": 374,
      "CCN(C": 375,
      "[C@@]1": 376,
      "CCn1": 377,
      ")cc1)": 378,
      "OC)cc": 379,
      "c3cccc(": 380,
      "c21\n": 381,
      "CCNC(=O)": 382,
      "c3cn": 383,
      "c4c(": 384,
      "C(=S)": 385,
      "n(-": 386,
      "c2ccc3c(": 387,
      "c2cc3": 388,
      "C1CCCC": 389,
      "CCC(=O)O)": 390,
      "=C(C)": 391,
      "Nc1n": 392,
      "n1)": 393,
      "CCC(=O)N": 394,
      "P(=O)(O)": 395,
      "n3)": 396,
      "[C@H]4": 397,
      "CC4)": 398,
      "COc1cccc(": 399,
      "([O-])": 400,
      "COc1ccc(-": 401,
      "(C)(=O)": 402,
      "nc1": 403,
      "c3ccc(F)cc": 404,
      "Cc1cn": 405,
      "cn1\n": 406,
      ")cc(": 407,
      ".O=C(O)": 408,
      "c(N)": 409,
      "c5cccc": 410,
      "Cc2ccc(": 411,
      "C(F)(F)F\n": 412,
      "C(=O)O)cc": 413,
      "[C@@H](O": 414,
      "c6": 415,
      "S(C)(=O)": 416,
      ")ccc1": 417,
      "3(C)": 418,
      "c3ccc(Cl)cc": 419,
      "n2)cc1\n": 420,
      "COc1ccccc1": 421,
      "c1cccc2": 422,
      "CN(C": 423,
      "cc3": 424,
      "C(N)": 425,
      "c2ccccc21\n": 426,
      "Cc1c[nH]": 427,
      "=C2": 428,
      "=C1": 429,
      "Cc1cccc(": 430,
      "c2ccc(Cl)cc2)": 431,
      "C(=N": 432,
      "CCS": 433,
      "c1ccc(O": 434,
      ")cc2)": 435,
      "C[C@H]2": 436,
      "CC3)cc": 437,
      "OC)c(OC)": 438,
      "C#N": 439,
      "C2CCCC": 440,
      "O)cc1)": 441,
      "CC2)cc1\n": 442,
      "Cc1ccc(-": 443,
      "c2ccc3c(c2)": 444,
      "Cn2": 445,
      "3CCCC": 446,
      "3)cc1\n": 447,
      "[C@]2": 448,
      "c2cccn": 449,
      "=O)cc1\n": 450,
      "CC1(C)": 451,
      "CC(N)=O)": 452,
      "c2ccccc12)": 453,
      "CCCO": 454,
      "CCN2": 455,
      "=C(\\": 456,
      "CC(O)": 457,
      "COc1cc2": 458,
      "C[C@@H]2": 459,
      "CCC2": 460,
      "F)cc1\n": 461,
      "CC(=O)N1": 462,
      "(C)C)": 463,
      "CCC1": 464,
      "c2)cc1\n": 465,
      "c2nc(-": 466,
      "c(C(=O)N": 467,
      "CC(=O)O": 468,
      "CCN(CC)": 469,
      "c2ccc(F)cc2)": 470,
      "2)cc1": 471,
      "c1ccc(N": 472,
      "c1cc(-": 473,
      "n(C": 474,
      "c2cc(-": 475,
      "C=C": 476,
      "C)cc1\n": 477,
      "no": 478,
      "CCCN(": 479,
      "/C(=N": 480,
      "/N=C/": 481,
      "Cl)cc1\n": 482,
      "Cc1ccccc1": 483,
      "O[C@@H](": 484,
      "C2=O)": 485,
      "=N/": 486,
      "c2ncn": 487,
      "n4": 488,
      "CCC(N)=O)": 489,
      "c1ccc(Cl)cc": 490,
      "O[C@H](CO)": 491,
      "C[C@H](O)": 492,
      "Cl.": 493,
      "O1\n": 494,
      "cn2": 495,
      "C(=O)N[C@@H](CC(C)C)": 496,
      "CCCN2": 497,
      "C[C@@H](O)": 498,
      "CCOCCO": 499,
      "c1OC\n": 500,
      "Cl)c(Cl)": 501,
      "C(=O)N(": 502,
      "c2c[nH]": 503,
      "c3ccccc23)": 504,
      "[C@H](O": 505,
      "CCC[C@H]1": 506,
      "CC(=O)N[C@@H](": 507,
      "N1CCN(": 508,
      "c2n1\n": 509,
      "/C=C\\": 510,
      "C(=O)N[C@@H](CCCCN)": 511,
      "C(=O)N[C@@H](CCCNC(=N)N)": 512,
      "c5ccccc5": 513,
      "CS(=O)(=O)": 514,
      "CC[C@@H](": 515,
      "OC(": 516,
      "CN(C(=O)": 517,
      "CC2\n": 518,
      "CC(C": 519,
      "(N)": 520,
      "4(C)": 521,
      "c34)": 522,
      "c2cc1": 523,
      "c1C\n": 524,
      "c3[nH]": 525,
      "C(=O)[C@H](": 526,
      "(O": 527,
      "c4cc(": 528,
      "[C@@H](O)[C@H](O)": 529,
      "c(O": 530,
      "c2ccccc12\n": 531,
      "c2cccc3": 532,
      "C(C)C\n": 533,
      "c1nc(-": 534,
      "Cc1ccc(O)cc1)": 535,
      "c2ccccc2)cc1\n": 536,
      "1)N": 537,
      "NC(=O)[C@H](CC(C)C)": 538,
      "c2=O)": 539,
      "nc(C)": 540,
      "CC[C@H](C)": 541,
      "C(=O)N(C)": 542,
      "n1-": 543,
      "CCOCC2)": 544,
      "[C@@H](C)O)": 545,
      "c3ccc(F)cc3)": 546,
      "c2s": 547,
      "OCCO": 548,
      "C(=O)N[C@@H](C)": 549,
      "n[nH]": 550,
      "Cc1c[nH]c2ccccc12)": 551,
      "NC(=O)CNC(=O)": 552,
      "Cc1c(": 553,
      "S(=O)(=O)N2": 554,
      "=C(N)": 555,
      "O=S(=O)": 556,
      "C(=O)NC": 557,
      "c1O\n": 558,
      "Cc1cc(C)": 559,
      "c(cc1": 560,
      "CC[C@]2": 561,
      "C(=S)N": 562,
      "[C@@H]5": 563,
      "c1cccn": 564,
      "-]\n": 565,
      "Cc1ccccc1\n": 566,
      "c2ncc": 567,
      "C4)": 568,
      "12\n": 569,
      "3\n": 570,
      "c1ccc(F)cc": 571,
      "N=C(N)": 572,
      "CCCC(=O)": 573,
      "N(C": 574,
      "O)cc2)": 575,
      "c2ccc(O": 576,
      "c3cccn": 577,
      "NC(=O)[C@@H]1": 578,
      "CN3": 579,
      "cccc2": 580,
      "CCOCC3)": 581,
      "[Na": 582,
      "CC[C@@H]1": 583,
      ".[": 584,
      "c2)c1\n": 585,
      "[Na+]": 586,
      "#N)": 587,
      "C2)cc1\n": 588,
      "NC": 589,
      "/C(=C\\": 590,
      ".[Na+]": 591,
      "cs1\n": 592,
      "NC1": 593,
      "O=c1": 594,
      "NC(=O)[C@H](C)": 595,
      "c3ccc(Cl)cc3)": 596,
      "C(N)=O\n": 597,
      "c3c2": 598,
      "c1ccc(Cl)cc1\n": 599,
      "/C=C": 600,
      "CC[C@H]2": 601,
      "nc(N)": 602,
      "c1cccc(-": 603,
      "c2nc(N": 604,
      "[S": 605,
      "NC(=O)[C@H](CCCNC(=N)N)": 606,
      "O)cc1\n": 607,
      "CC[C@@]": 608,
      "(Cl)": 609,
      "3)cc2": 610,
      "(F)(F)": 611,
      "nn2": 612,
      "c2o": 613,
      "C=C(": 614,
      "N4": 615,
      "c3ccc(-": 616,
      ".O=C(O)C(F)(F)F\n": 617,
      ")cc3)": 618,
      "3C)": 619,
      "C(=O)OC": 620,
      "c1O": 621,
      "[C@@]2(C)": 622,
      "c2ccc(Cl)cc2": 623,
      "NC(=O)[C@@H](N)": 624,
      "[C@]12": 625,
      "(C(F)(F)F)": 626,
      "N1CCCC": 627,
      "(CC)": 628,
      "Cl)c(": 629,
      "(C)(": 630,
      "C=C1": 631,
      "CN1CCN(": 632,
      "CCOc1ccc(": 633,
      "nc1\n": 634,
      "4)cc3)": 635,
      "c2nc3ccccc3": 636,
      "C2=O\n": 637,
      "(N)(=O)": 638,
      "C(=O)OC)": 639,
      "CN1C(=O)": 640,
      "C[C@@H]3": 641,
      "CC[C@H]1": 642,
      "C(=O)N[C@@H](Cc1ccccc1)": 643,
      "C)cc1": 644,
      "c2ccncc": 645,
      "c2cc(Cl)cc": 646,
      "/C(=C/": 647,
      "OC)c1OC\n": 648,
      "c1s": 649,
      "s2)": 650,
      "C(=O)N1CCC[C@H]1": 651,
      "C(=O)NCC": 652,
      "C2(": 653,
      "c3cc4": 654,
      "c2c(-": 655,
      "NC(=O)[C@H](CCCCN)": 656,
      "S(C)(=O)=O)": 657,
      "C2CC2)": 658,
      "nc(S": 659,
      "CCC(C)": 660,
      "c2cccc(Cl)": 661,
      "Cc2ccccc2": 662,
      "c(NC(=O)": 663,
      "cn2)": 664,
      "3)cc2)": 665,
      "O=S(=O)(": 666,
      "cn1)": 667,
      "c2)CC1\n": 668,
      "C[C@H]3": 669,
      "Nc1ccc(": 670,
      "CCOCC1\n": 671,
      "C1=": 672,
      "c3ccc4c(": 673,
      "CCCCC2)": 674,
      "/C(=N\\": 675,
      "C2=N": 676,
      "C(=O)N3": 677,
      "S(N)(=O)": 678,
      "n2cn": 679,
      "CC4": 680,
      "c5ccc(": 681,
      "O)c(": 682,
      "c2cccs": 683,
      "/C=C(\\": 684,
      "C1(": 685,
      "c2ccco": 686,
      "O)c(O)": 687,
      "O)cc2": 688,
      "[n+]1": 689,
      "CCC3": 690,
      "[N+]([O-])": 691,
      "NC(=O)[C@H](CO)": 692,
      "C1CCN(": 693,
      "c4cn": 694,
      "N\n": 695,
      "c2c(C)": 696,
      "5(C)": 697,
      "CCO)": 698,
      "NC1=O\n": 699,
      "5)cc": 700,
      "C1=O)": 701,
      "cccc1": 702,
      "NC(=O)O": 703,
      "[C@@H]1O\n": 704,
      "N2CCN(": 705,
      "CCCCCCCCCCCC": 706,
      "n2cc": 707,
      "Cc3ccccc3)": 708,
      "/C(C)": 709,
      "=C(N)N)": 710,
      "c(S": 711,
      "C3CCCC": 712,
      "c1c[nH]": 713,
      "C3=O)": 714,
      "C(=O)[C@@H](": 715,
      "s1)": 716,
      "cnc2": 717,
      "n2)c1\n": 718,
      "c2c(=O)": 719,
      "c1nc(N": 720,
      "3)CC2)": 721,
      "/C=N/": 722,
      "CCS(=O)(=O)": 723,
      "C)cc2)": 724,
      "(C)(C)": 725,
      "N1\n": 726,
      "(CO)": 727,
      "CSc1n": 728,
      "c1ccc(NC(=O)": 729,
      "CCc1n": 730,
      "c2cs": 731,
      "O=[N+]([O-])": 732,
      "N(C)C)": 733,
      "C1=C(": 734,
      "CC(=O)N2": 735,
      "CCCNC(=O)": 736,
      "c1cccc(Cl)": 737,
      "CCCN=C(N)N)": 738,
      "c2)cc1": 739,
      "C[C@@]": 740,
      "c3ncc": 741,
      "CCCn1": 742,
      "C(=O)N[C@@H](CO)": 743,
      "O2)": 744,
      "N1CCC(": 745,
      "6)": 746,
      "Cl)cc1": 747,
      "c2ccc(N": 748,
      "c3ccc4c(c3)": 749,
      "[nH]c(=O)": 750,
      "c1ccc(F)cc1\n": 751,
      "c1c(C)": 752,
      "c1ccc(Cl)cc1)": 753,
      "=S)": 754,
      "c32)": 755,
      "nc12\n": 756,
      "cc(C)": 757,
      "[C@H]1O\n": 758,
      "F)c(F)": 759,
      "NC(=O)[C@H](Cc1ccccc1)": 760,
      "c2ccc(Br)cc": 761,
      "no1\n": 762,
      "CCCCN": 763,
      "C)cc2": 764,
      "CCN3": 765,
      "CC[C@H](C)[C@H](": 766,
      "c3ccc(O": 767,
      "[C@H]5": 768,
      "ncc2": 769,
      "nn1\n": 770,
      "/C=C2": 771,
      "Cc1cc2": 772,
      "(C)C\n": 773,
      "[C@@]1(C)": 774,
      "C(=O)N(C": 775,
      "c2ccccn2)": 776,
      "C(=O)N[C@@H](CCC(=O)O)": 777,
      "C(=N)N": 778,
      "OC)c(OC)c(OC)": 779,
      "c1Cl\n": 780,
      "c1ccco": 781,
      "c2-": 782,
      "c4n": 783,
      "c3ncn": 784,
      "C2CCCCC2)": 785,
      "[nH]1\n": 786,
      "CCCC2)": 787,
      "C5": 788,
      "CN)": 789,
      "NC(C)=O)": 790,
      "O=C1N": 791,
      "[C@]1(C)": 792,
      "oc(": 793,
      "(C(=O)N": 794,
      "CC(C)C[C@H](": 795,
      "[C@]3": 796,
      "c2ccc(F)cc2": 797,
      "nc2c1\n": 798,
      "CCc1ccc(": 799,
      "N2C(=O)": 800,
      "c2c[nH]c3ccccc23)": 801,
      "C[C@@H](C)": 802,
      "Cc1nc(": 803,
      "CN(CC": 804,
      "Oc1ccc(": 805,
      "CC1CCCC": 806,
      "CC[C@]1": 807,
      "N1C(=O)": 808,
      "c(C)c1": 809,
      "c3ccncc": 810,
      "O[C@@H]2": 811,
      "C=C(C)": 812,
      "N(C(=O)": 813,
      "[C@H]2O)": 814,
      "c(C(=O)O)": 815,
      "c1ccccc1-": 816,
      "C)cc3)": 817,
      "COc1ccc2c(c1)": 818,
      "c1ncc": 819,
      "c1ccncc": 820,
      "C1=N": 821,
      "c(C)c1\n": 822,
      "c2cccnc2)": 823,
      "nn1": 824,
      "c2cc(C)": 825,
      ".[Na+]\n": 826,
      "c23)cc1\n": 827,
      "CC(C)(C)O": 828,
      "CC[C@]3(C)": 829,
      "c3cccc4": 830,
      "O[C@H](CO)[C@@H](O)[C@H](O)": 831,
      "c3cc(Cl)cc": 832,
      "O[C@@H]1": 833,
      "NC(=O)[C@@H]2": 834,
      "CCN1C(=O)": 835,
      "o2)": 836,
      "c1cc(Cl)cc": 837,
      "c4ccc(F)cc": 838,
      "[N+](=O)[O-])cc": 839,
      "c2cccc(F)": 840,
      "OP(=O)(O)": 841,
      "c2cc(O)": 842,
      "c(-c2ccccc2)": 843,
      "Cn1cc(": 844,
      "c2ccc3ccccc3": 845,
      "C3CC3)": 846,
      "[C@]2(C)": 847,
      "C2=C(": 848,
      "NCC": 849,
      "c2ccc(N3": 850,
      "[C@@]12": 851,
      "c3)cc": 852,
      "cc4": 853,
      "C(=O)/C=C/": 854,
      "O[C@H]1": 855,
      "CCC[C@H](": 856,
      "4CCCC": 857,
      "CCOCC": 858,
      "O)cc1": 859,
      "c(=O)n2": 860,
      "cccc3": 861,
      "OC(C)": 862,
      "C12": 863,
      "CC[C@@H]2": 864,
      "c3ccco": 865,
      "NC(": 866,
      "NC(=O)[C@H](CCC(=O)O)": 867,
      "C(=O)N[C@@H](CCC(N)=O)": 868,
      "c2C)": 869,
      "cc(O)": 870,
      "nc4": 871,
      "c(F)cc": 872,
      "[C@@H](C)CC)": 873,
      "C2=O)cc1\n": 874,
      "(C)(O)": 875,
      "cccn": 876,
      "c1ccc(F)cc1)": 877,
      "c1cs": 878,
      "c3s": 879,
      "C(=O)NCC(=O)N[C@@H](": 880,
      "c3ccccc32)": 881,
      "N[C@@H](": 882,
      "CC2)cc1": 883,
      "NC(=O)[C@H](CC(=O)O)": 884,
      "CCC(=O)": 885,
      "c1=O)": 886,
      "OC(C)=O)": 887,
      "C1CCCCC1\n": 888,
      "CC2)c1\n": 889,
      "c(-c2ccc(": 890,
      "c3cccc(Cl)": 891,
      "O=C(/C=C/": 892,
      "C(=O)N[C@@H](CC(=O)O)": 893,
      "c2ccco2)": 894,
      "c3c2)": 895,
      "(C#N)": 896,
      "c2ccccc2)CC1\n": 897,
      "cs1)": 898,
      "C(=O)NC(": 899,
      "NC(=O)[C@H](C": 900,
      "COc1cc2c(cc1": 901,
      "O2\n": 902,
      "N1CC": 903,
      "CN(C)C(=O)": 904,
      "NC(=O)C(": 905,
      "c(N3": 906,
      "/C=C(\\C)": 907,
      "OCO3)": 908,
      "CCCC2": 909,
      "c2cccs2)": 910,
      "NC(=O)[C@@H]1CCCN1": 911,
      "Cc3ccccc3": 912,
      "Nc1nc(": 913,
      "c1ccc(Cl)cc1": 914,
      "c2ccccc2Cl)": 915,
      "CC\n": 916,
      ".[Br": 917,
      "Br\n": 918,
      "n4)": 919,
      "c2cc3c(": 920,
      "c2cc(F)cc": 921,
      "c4ccccc34)": 922,
      "c3nn": 923,
      "CC(=O)N(": 924,
      "Cc1ccc2c(c1)": 925,
      "CSS": 926,
      "3)cc1": 927,
      "c3ccccn3)": 928,
      "nc1-": 929,
      "c1nc2ccccc2": 930,
      ")cc(OC)c1OC\n": 931,
      "c1ccc(-c2n": 932,
      "C(=O)Nc1ccc(": 933,
      "cs3)": 934,
      "n1cn": 935,
      "C2CCN(": 936,
      "c3ccc(O)cc": 937,
      "CC[C@@H]4": 938,
      "4)cc3": 939,
      "CCOCC1)": 940,
      "NC(=O)[C@H](CCC(N)=O)": 941,
      "c1c(O)": 942,
      "nn2)": 943,
      "c(=O)o": 944,
      "(O)(": 945,
      "c2cccc(-": 946,
      "Cc1ccc(NC(=O)": 947,
      "c4ccc(Cl)cc": 948,
      "c1[nH]": 949,
      "c3o": 950,
      "S(C)(=O)=O)cc": 951,
      "C1CC1\n": 952,
      "OC[C@H]1": 953,
      "CC(CC(C": 954,
      "/C=C2\\": 955,
      "c1cccc(F)": 956,
      "=C(/": 957,
      "N)ncn": 958,
      "C(=O)N[C@@H](CC(N)=O)": 959,
      "P(=O)(": 960,
      "c3nc(": 961,
      "C[C@H](C)": 962,
      "=C1\\": 963,
      "CCCC1": 964,
      "c2c1)": 965,
      "c(OC)c1\n": 966,
      "/C=N": 967,
      "c2ccc(NC(=O)": 968,
      "CC1(": 969,
      "/N=C(\\": 970,
      "c(Br)": 971,
      "c4[nH]": 972,
      "C[C@]": 973,
      "n2)CC1\n": 974,
      "c2ccccc2-": 975,
      "cn3)": 976,
      "Cc2ccc(O)cc2)": 977,
      "c2ncc(": 978,
      "s3)": 979,
      "CCCCCC": 980,
      "=CC(=O)": 981,
      "I)": 982,
      "NC(=O)CNC(=O)[C@H](": 983,
      "COc1cc(-": 984,
      "CCCCCCCCCCCCCCCC": 985,
      "c(C(F)(F)F)": 986,
      "NC(=O)OC": 987,
      "COP(=O)(O)": 988,
      "c2cccc(C(F)(F)F)": 989,
      "n2cc(": 990,
      "[N+](=O)[O-]\n": 991,
      "[S+]": 992,
      "Cc1cc(-": 993,
      "c[nH]1)": 994,
      "c3cccnc3)": 995,
      "c2ccc(C(F)(F)F)cc": 996,
      "Cn1cn": 997,
      "O[C@H]2": 998,
      "[C@H](O)[C@@H](O)": 999,
      "CC[C@]2(C)": 1000,
      "c1ccc2c(": 1001,
      "c-": 1002,
      "ccc3": 1003,
      "(C(=O)O)": 1004,
      "c2cccc(Cl)c2)": 1005,
      "c5c(": 1006,
      "c2ccncc2)": 1007,
      "nc21\n": 1008,
      "c3ccccc3)cc": 1009,
      "C(=O)N[C@H]1": 1010,
      "%1": 1011,
      "[C@@H]6": 1012,
      "CCOCC4)": 1013,
      "C(C)(C)C\n": 1014,
      "CC1=C(": 1015,
      "nc(NC(=O)": 1016,
      "CO\n": 1017,
      "c([N+](=O)[O-])": 1018,
      "c3ccco3)": 1019,
      "c1ccc2[nH]": 1020,
      "O[C@@H]3": 1021,
      "S(N)(=O)=O)cc": 1022,
      "S(=O)(=O)c1ccc(": 1023,
      "CCC(O)": 1024,
      "CCCCO": 1025,
      "CCC4": 1026,
      "c(C#N)": 1027,
      "c7": 1028,
      "/C1": 1029,
      "NC(=O)c1ccc(": 1030,
      "c1F\n": 1031,
      "c1ccc2ccccc2": 1032,
      "OCO2\n": 1033,
      "CC[C@H]3": 1034,
      "c(-c3ccc(": 1035,
      "[C@H](O)[C@H](O)": 1036,
      "c5)": 1037,
      "[C@@]3": 1038,
      "3)c1\n": 1039,
      "CS)": 1040,
      "O=C(Nc1ccc(": 1041,
      "c5ccccc5)": 1042,
      "CC[C@]4": 1043,
      "[n+]2": 1044,
      "[C@@H](N)": 1045,
      "COc1cc(OC)": 1046,
      "OC1": 1047,
      "C[N+]": 1048,
      "c2ccccc2F)": 1049,
      "n2)cc1": 1050,
      "4)CC3)": 1051,
      "ccc2": 1052,
      "c3ccc(Cl)cc3": 1053,
      "1C\n": 1054,
      "[C@H](OC(C)=O)": 1055,
      "CCCN(C": 1056,
      "Cn1c(=O)": 1057,
      "CC3)cc2": 1058,
      "c2ccc([N+](=O)[O-]": 1059,
      "CC[C@H](O)": 1060,
      "N2CCOCC2)": 1061,
      ")cc3": 1062,
      "c5cc": 1063,
      "c3cc(-": 1064,
      "NCCCC": 1065,
      "CCCN(C(=O)": 1066,
      "COc1cccc2": 1067,
      "[C@@]5(C)": 1068,
      "=[N+]": 1069,
      "C(=O)N[C@@H](Cc1c[nH]c2ccccc12)": 1070,
      "c3)cc2": 1071,
      "NC(C)": 1072,
      "sc1": 1073,
      "CC[C@@H]3": 1074,
      "C=O)": 1075,
      "C[C@]12": 1076,
      "Cc1cccc2": 1077,
      "/C=C/C(=O)": 1078,
      "CC[C@]12": 1079,
      "CCN1CCN(": 1080,
      "n1C\n": 1081,
      "NC(=O)[C@H](CC(N)=O)": 1082,
      "n(CC": 1083,
      "C(F)F)": 1084,
      "Cc1no": 1085,
      "Cc1cnc[nH]1)": 1086,
      "[Cl": 1087,
      "(CC1)": 1088,
      "C(F)(F)F": 1089,
      "c2c(F)cc": 1090,
      "c2c(O)": 1091,
      "C/C=C\\": 1092,
      "CC(C)=": 1093,
      "c3cc4c(": 1094,
      "c1ncn2": 1095,
      "ncc1": 1096,
      "N#Cc1ccc(": 1097,
      "COc1ccc(NC(=O)": 1098,
      "C(=O)C(": 1099,
      "CCCN3": 1100,
      "c3ccc(Br)cc": 1101,
      "nc2)": 1102,
      "n3cn": 1103,
      "[C@]3(C)": 1104,
      ".[Br-]\n": 1105,
      "cc(OC)": 1106,
      "CCN)": 1107,
      "c2cccc3cccc": 1108,
      "CC(=O)Nc1ccc(": 1109,
      "CC[C@]4(C)": 1110,
      "c2nc3c(": 1111,
      "c2ncccc2": 1112,
      "(CCCC": 1113,
      "S(=O)(=O)O)": 1114,
      "c2nnn": 1115,
      "c2F)": 1116,
      "C(=O)O)cc1\n": 1117,
      "c2ccc(S(=O)(=O)N": 1118,
      "CCN(C)C)": 1119,
      "C(c2ccccc2)": 1120,
      "[C@@H](OC(=O)": 1121,
      "c2ccc(C(=O)N": 1122,
      "CN2CCN(": 1123,
      "CCCC(": 1124,
      "c1cc(C)": 1125,
      "CC(F)(F)": 1126,
      "(=O)o": 1127,
      "Cn1cc": 1128,
      "CC5)": 1129,
      "c1ccc(F)cc1": 1130,
      "[C@H](OC(=O)": 1131,
      "C1CCCCC1)": 1132,
      "nc2-": 1133,
      "OC(C)(C)": 1134,
      "C[C@H](N)": 1135,
      "n(-c2ccccc2)": 1136,
      "c3ccccc3)cc2)": 1137,
      "O[C@H](C)": 1138,
      "n2c(": 1139,
      "c3cccc(F)": 1140,
      "CN1CCC(": 1141,
      "ncc(": 1142,
      "[C@@H](OC(C)=O)": 1143,
      "C(F)(F)F)cc1\n": 1144,
      "c3ccncc3)": 1145,
      "c2c(Cl)cc": 1146,
      "c(=O)[nH]c1=O\n": 1147,
      "c2ccc3c(c2)OCO3)": 1148,
      "3CCCCC3)": 1149,
      "c3c[nH]": 1150,
      "c2c3c(": 1151,
      "/C(=N/": 1152,
      "S(=O)(=O)c2ccc(": 1153,
      "Br)cc1\n": 1154,
      "[C@H](N)": 1155,
      "c2cc3cccc": 1156,
      "n2-": 1157,
      "CCC3)": 1158,
      "N1CCOCC1\n": 1159,
      "C2=": 1160,
      "c2cc(NC(=O)": 1161,
      "c(Cl)c1\n": 1162,
      "c3ccc(F)cc3": 1163,
      "Cl)cc2": 1164,
      "1(=O)": 1165,
      "[C@H]6": 1166,
      "C(=O)N[C@@H](Cc1ccc(O)cc1)": 1167,
      "FC(F)(F)": 1168,
      "c(N2": 1169,
      "CCCN)": 1170,
      "c(=O)n(C)": 1171,
      "[C@@H](CO)": 1172,
      "C[C@H](NC(=O)": 1173,
      "c2ccccc2)c1\n": 1174,
      "c3cccs3)": 1175,
      "c1ccc([N+](=O)[O-]": 1176,
      "CC#": 1177,
      "c3cc(C)": 1178,
      "O[C@H](CO)[C@@H](O)": 1179,
      "=C(C)C)": 1180,
      "COc1cccc(-": 1181,
      "Cc1cccc(-": 1182,
      "Cc3ccc(": 1183,
      "N(CC": 1184,
      "C(=O)NCC(=O)N": 1185,
      "CCC[C@@H]1": 1186,
      "2)C1\n": 1187,
      "N(C)C(=O)": 1188,
      "CCOC(=O)C1": 1189,
      "c(-c3ccccc3)": 1190,
      "C(=O)N1CCC(": 1191,
      "c2)n1\n": 1192,
      "c3nc4ccccc4": 1193,
      "NC(=S)N": 1194,
      "CC2(": 1195,
      "c3c(C)": 1196,
      "c2=O)cc1\n": 1197,
      "/C(C)=C/": 1198,
      "c2cc(C": 1199,
      "OCC(=O)N": 1200,
      "=O)cc1": 1201,
      "C#N\n": 1202,
      "O3)": 1203,
      "COc1n": 1204,
      "n3cc": 1205,
      "(C)c1": 1206,
      "[nH]c(": 1207,
      "n12\n": 1208,
      "c3=O)": 1209,
      "/C=N/N": 1210,
      "c3nc(-": 1211,
      "cnc1": 1212,
      "c2Cl)": 1213,
      "c(F)c1\n": 1214,
      "c1cccs1\n": 1215,
      "c1cccnc1\n": 1216,
      "(c2ccccc2)": 1217,
      "c2nnc(-": 1218,
      "c2ccc(OC)cc": 1219,
      "C(=O)N1CCN(": 1220,
      "o2)cc1\n": 1221,
      "c2n1": 1222,
      ".[Cl": 1223,
      "CO[C@H]1": 1224,
      "OCCCC": 1225,
      "c3cc(O)": 1226,
      "n3)cc": 1227,
      "n2nc(": 1228,
      "c1ccccc1)c1ccccc1\n": 1229,
      "c2nnc(": 1230,
      "3CCCC3)": 1231,
      "NC(=O)[C@H](Cc1ccc(O)cc1)": 1232,
      "c1cc2cccc": 1233,
      "c3ccc(N4": 1234,
      "C2)c1\n": 1235,
      "c3ccccc3)CC2)": 1236,
      "OCO4)": 1237,
      "C(C(=O)N": 1238,
      "CCCCNC(=O)": 1239,
      "CC[C@]43C)": 1240,
      "c6cccc": 1241,
      "O[C@H]3": 1242,
      "2)n1\n": 1243,
      "c3ccc(C(F)(F)F)cc": 1244,
      "c3ccccc3)cc2": 1245,
      "c1)N": 1246,
      "CC[C@H]4": 1247,
      "ncc3": 1248,
      "N=C(N)N": 1249,
      "nn3": 1250,
      "CO[C@@H]1": 1251,
      "C(F)(F)F)c1\n": 1252,
      "Cc2cn": 1253,
      "C(=O)Nc2ccc(": 1254,
      "c2nc(C)": 1255,
      "COc1cc2c(cc1OC)": 1256,
      "c2c(c1": 1257,
      "CC=C": 1258,
      "[n+](": 1259,
      "OC3": 1260,
      "C2)cc1": 1261,
      "CC[C@@]2": 1262,
      "c1ccccn1\n": 1263,
      "nc(N3": 1264,
      "c1cc(F)cc": 1265,
      "n1cc(": 1266,
      "CC=": 1267,
      "o1)": 1268,
      "CCSC)": 1269,
      "C)cc3": 1270,
      "C3)cc": 1271,
      "OC)c(": 1272,
      "NC(=O)[C@H](Cc1c[nH]c2ccccc12)": 1273,
      "cn3": 1274,
      "c2cc3c(cc2": 1275,
      "CCC2(CC1)": 1276,
      "CCCCC1\n": 1277,
      "c1c(-": 1278,
      "C/C=C/": 1279,
      "NC(=O)OC(C)(C)C)": 1280,
      ".[I": 1281,
      "C1CCCC1\n": 1282,
      "c2ccc(Br)cc2)": 1283,
      "c1cccnc1)": 1284,
      "c1cn(": 1285,
      "c4cccn": 1286,
      "c3cc(F)cc": 1287,
      "CCl": 1288,
      "Cc1cs": 1289,
      "c45)": 1290,
      "c2no": 1291,
      "[C@@]3(C)": 1292,
      "C)cc(C)": 1293,
      "CN2C(=O)": 1294,
      "C/C(=C\\": 1295,
      "c3cccc(Cl)c3)": 1296,
      "=N\\": 1297,
      "c2cc(C(=O)N": 1298,
      "c2ccccc2)cc1)": 1299,
      "c2cc1OC\n": 1300,
      "c1ccc(N2": 1301,
      "c1cccc2cccc": 1302,
      "CN4": 1303,
      "s2)cc1\n": 1304,
      "CC(C)[C@H](": 1305,
      "C/C(=N\\": 1306,
      "Br)cc1": 1307,
      "c1cc2c(cc1": 1308,
      "Cc1ccc(S(=O)(=O)N": 1309,
      "CCCC)": 1310,
      "CCCN1C(=O)": 1311,
      "CCc1cc(": 1312,
      "C(F)(F)F)cc(C(F)(F)F)": 1313,
      "CCC[C@H]2": 1314,
      "/C=C/C": 1315,
      "c3ccc(OC)cc": 1316,
      "C3CCCCC3)": 1317,
      "ccc1": 1318,
      "N)cc": 1319,
      "CCC(C)(C)": 1320,
      "COc1c(": 1321,
      "CC[C@@H]4[C@@]5(C)": 1322,
      "CNS(=O)(=O)": 1323,
      "CCC1\n": 1324,
      "CCC[C@@H](": 1325,
      "CCn1cc(": 1326,
      "C#N)cc": 1327,
      "CC[C@@]2(C)": 1328,
      "c3cc4c(cc3": 1329,
      "nc3)": 1330,
      "c2ccc(Cl)cc2Cl)": 1331,
      "CCC2)": 1332,
      "CS(=O)(=O)N": 1333,
      "CC[C@@H](C)": 1334,
      "CCC2\n": 1335,
      "(CCC)": 1336,
      "[C@@H]5CC[C@]43C)": 1337,
      "n2cnc3c(": 1338,
      "OC2": 1339,
      "c(C(=O)": 1340,
      "CCc1ccccc1)": 1341,
      "COc1ccc(C2": 1342,
      "[C@H]3O)": 1343,
      "C1CC1)": 1344,
      "c2ccc(O)cc2)": 1345,
      "C[C@@H]4": 1346,
      "O[C@H](CO": 1347,
      "c1cc2c(": 1348,
      "c2ccs": 1349,
      "CCCC2\n": 1350,
      "OC)cc1\n": 1351,
      "C[C@]1": 1352,
      "c2cccc(F)c2)": 1353,
      "CC2CC2)": 1354,
      "OCC(O)": 1355,
      "c3C)": 1356,
      "F)cc1": 1357,
      ".[Cl-]\n": 1358,
      "nn3)": 1359,
      "c1cccc(N": 1360,
      "[C@H](Cc1ccccc1)": 1361,
      "c3ccc(O)cc3)": 1362,
      "CC(=O)O\n": 1363,
      "CCCS": 1364,
      "[S+]([O-])": 1365,
      "c1ccc(OC": 1366,
      "C(=O)OC(C)(C)C)": 1367,
      "c3ccc(C(=O)N": 1368,
      "nc2c1": 1369,
      "CCC3(": 1370,
      "CC(C)O": 1371,
      "c2cc(F)": 1372,
      "2)ccc1": 1373,
      "c4ccccc43)": 1374,
      "c1ccco1\n": 1375,
      "3)CC1\n": 1376,
      "CCCC1\n": 1377,
      "C5)": 1378,
      "COc1ccc(N": 1379,
      "Cc1c[nH]cn1)": 1380,
      "c2[nH]1\n": 1381,
      "c1ccccc1Cl\n": 1382,
      "c3c(F)cc": 1383,
      "NC(=O)C1": 1384,
      "c1nc2c(": 1385,
      "P(=O)(O)O)": 1386,
      "[C@H](CO)": 1387,
      "Cc1o": 1388,
      "[nH]2)": 1389,
      "Cc1ccc(N": 1390,
      "2)cc1OC\n": 1391,
      "c2ccc3ccccc3c2)": 1392,
      "c4ccc(F)cc4)": 1393,
      "o3)": 1394,
      "NC(=O)[C@@H]2CCCN2": 1395,
      "[N-]": 1396,
      "c3ccc4ccccc4": 1397,
      "CC[C@H]2[C@@H]3": 1398,
      "c1cccc(NC(=O)": 1399,
      "Oc2ccc(": 1400,
      "c1-c1ccc(": 1401,
      "S1(=O)": 1402,
      "on1\n": 1403,
      "c4cccc(": 1404,
      "Cc1ccc(C(=O)N": 1405,
      "c1ccc(-c2cn": 1406,
      "n1cc": 1407,
      "Cc1cc(N": 1408,
      "CC(N)": 1409,
      "c(=O)n1": 1410,
      "c1ccco1)": 1411,
      "C(=O)N2CCN(": 1412,
      "Cc1nc(-": 1413,
      "c1cccc(Cl)c1\n": 1414,
      "C3\n": 1415,
      "N2CCC(": 1416,
      ".[I-]\n": 1417,
      "CCOc1cc(": 1418,
      "c2nc(N)": 1419,
      "F)c(Cl)": 1420,
      "Nc1ncn": 1421,
      "c1ccncc1\n": 1422,
      "c2ccc(Cl)c(Cl)": 1423,
      "c1ncc(": 1424,
      "CN2CCC(": 1425,
      "C(N": 1426,
      "c5cc(": 1427,
      "O=c1[nH]": 1428,
      "CCOCC3)cc": 1429,
      "c3c(-": 1430,
      ".O=C(O)C(F)(F)F": 1431,
      "nc1)": 1432,
      "CCCC[C@H](": 1433,
      "OC(C)=O\n": 1434,
      "c1ncn": 1435,
      "n2C)": 1436,
      "c1N": 1437,
      "c3ccccc3Cl)": 1438,
      "C2CCCC2)": 1439,
      "c4c3": 1440,
      "(CC(=O)N": 1441,
      "c2cc(O": 1442,
      "C4=O)": 1443,
      "=C3": 1444,
      "[nH]1)": 1445,
      "c2O)": 1446,
      "CCCC(=O)N": 1447,
      "[C@](C)(": 1448,
      "C)cc1)": 1449,
      "COCCO": 1450,
      "NC(=O)[C@H](Cc2ccccc2)": 1451,
      "c3cc2": 1452,
      "4)cc2": 1453,
      "/C=N/NC(=O)": 1454,
      "O=S(=O)(N": 1455,
      "c3ccc(C)cc3)": 1456,
      "CNC(=O)N": 1457,
      "c13)": 1458,
      "Cl.Cl\n": 1459,
      "P(=O)(O": 1460,
      "O[C@@H](C)": 1461,
      "nc2c(": 1462,
      "c1cc(N": 1463,
      "C4CC4)": 1464,
      "Cc1ccc(C)": 1465,
      "C(F)(F)F)cc1)": 1466,
      "nn(-": 1467,
      "c2cccc3ccccc23)": 1468,
      "CC1CCCCC1)": 1469,
      "c2cc(S(=O)(=O)N": 1470,
      "[C@H](C)[C@@H](O": 1471,
      "c3ccccc23)cc1\n": 1472,
      "CC12": 1473,
      "CCCC3)": 1474,
      "[C@@]1(O)": 1475,
      "CN1CC": 1476,
      "CC(=O)O[C@H]1": 1477,
      "c2cc(OC)c(OC)c(OC)": 1478,
      "/C=C/C(=O)N": 1479,
      "c2cccc(C(F)(F)F)c2)": 1480,
      "c1ccc(Cl)c(Cl)": 1481,
      "CC2)ccc1": 1482,
      "c2ccc3n": 1483,
      "c2ccc3[nH]": 1484,
      "Cn1cc(-": 1485,
      "c3ccccc3F)": 1486,
      "Cc2c(": 1487,
      "C(=O)N[C@@H](CCCN=C(N)N)": 1488,
      "OO": 1489,
      "[P": 1490,
      "[C@@](C)(": 1491,
      "c1ccccn1)": 1492,
      "c(=O)c(C(=O)O)": 1493,
      "[C@@]2(": 1494,
      "C(=O)OCC)": 1495,
      "c3cccc(C(F)(F)F)": 1496,
      "c(=O)[nH]1\n": 1497,
      "CCN(CC": 1498,
      "c3ccccc32)cc1\n": 1499,
      "C[n+]1": 1500,
      "CC(NC(=O)": 1501,
      "CC[C@]12C\n": 1502,
      "C23": 1503,
      ")cc(-": 1504,
      "CSCC[C@H](": 1505,
      "N5": 1506,
      "C(=O)N[C@@H](C": 1507,
      "4\n": 1508,
      ")cc12\n": 1509,
      "CCCCC1)": 1510,
      "[C@@H]12\n": 1511,
      "c3)CC2)": 1512,
      "NC(=O)CS": 1513,
      "Cc1ccc(O": 1514,
      "Cl)cccc1": 1515,
      "n4cn": 1516,
      "Br.": 1517,
      "Cc1ccco": 1518,
      "c2cccc(O)": 1519,
      "c2ccccc21)": 1520,
      "c2ccc(OC": 1521,
      "c2cc(N": 1522,
      "CCCN(C)": 1523,
      "CCC(=O)N1": 1524,
      "c1C(=O)": 1525,
      "CC(C)(": 1526,
      "nn2)cc1\n": 1527,
      "[C@@]4(C)": 1528,
      "Cc1cn(": 1529,
      "CCOc1ccccc1": 1530,
      "COc1ccc(C(=O)N": 1531,
      "C(N)=N": 1532,
      "c2ccccc2)cc1": 1533,
      "3)C1)": 1534,
      "Cn1c(": 1535,
      "c1O)": 1536,
      "nc2ccccc12\n": 1537,
      "c2cccnc2": 1538,
      "c4ccc(Cl)cc4)": 1539,
      "[C@@H](C)O\n": 1540,
      "c1c(F)cc": 1541,
      "c1nnc(": 1542,
      "Cn3": 1543,
      "CC[C@]4(C)[C@H]3": 1544,
      "C[C@H]4": 1545,
      "OC[C@H]1O[C@@H](": 1546,
      "cc(Cl)": 1547,
      "N1CCN(C(=O)": 1548,
      "CCOCCOCCOCCO": 1549,
      "c1ccc(C(=O)N": 1550,
      "c(=O)n(": 1551,
      "COc1ccc(S(=O)(=O)N": 1552,
      "c2n[nH]": 1553,
      "c1o": 1554,
      "C(C)C)C(C)C)": 1555,
      "C(C)(C)[C@@H]5CC[C@]43C)": 1556,
      "C#C": 1557,
      "[Si": 1558,
      "c-2": 1559,
      "c1ccccc12\n": 1560,
      "Nc1cc": 1561,
      "c1cccc(O": 1562,
      "c3cccnc3": 1563,
      "4CCOCC4)": 1564,
      "c2ccc(C)": 1565,
      "C=C2": 1566,
      "cn1": 1567,
      "[C@H](O)[C@@H]1O\n": 1568,
      "NC(=O)CO": 1569,
      "CCNCC3)": 1570,
      "c1cccs1)": 1571,
      "C1CC": 1572,
      "[Si]": 1573,
      "C(Cl)": 1574,
      "c(O)c(": 1575,
      "nn1)": 1576,
      "COc1ccccc1-": 1577,
      "c3ccc4c(c3)OCO4)": 1578,
      "Cl.Cl.": 1579,
      "c1C(=O)N": 1580,
      "CC(=O)N(C)": 1581,
      "c2nc(N3": 1582,
      "c6ccccc6": 1583,
      "c4c3)": 1584,
      "c1cccc(C": 1585,
      "CC1=O\n": 1586,
      "S(C)(=O)=O\n": 1587,
      "c1cccc(O)": 1588,
      "C2)n1\n": 1589,
      "CC[N+]": 1590,
      "c2ccn": 1591,
      "COC(=O)N": 1592,
      "c1ccccc1F\n": 1593,
      ".O=C(O)C(=O)O\n": 1594,
      "COC(=O)C1": 1595,
      "c43)": 1596,
      "c(=O)n3": 1597,
      "Cc1[nH]": 1598,
      "/c(": 1599,
      "c2ccc([N+](=O)[O-])cc2)": 1600,
      "NS(=O)(=O)c1ccc(": 1601,
      "Br)cc1)": 1602,
      "Cc1cccn": 1603,
      "[C@@H]2O)": 1604,
      "e]": 1605,
      "SCC(=O)N": 1606,
      "S(N)(=O)=O)": 1607,
      "c2ccc(C)cc2)": 1608,
      "(OC)": 1609,
      "CC1=": 1610,
      "c4ccccc4)cc3)": 1611,
      "Cc1ccc(S(=O)(=O)": 1612,
      "3)cc2)cc1\n": 1613,
      "C4CCCC": 1614,
      "cnc2c1ncn2": 1615,
      ".[Na+].[Na+]": 1616,
      "n2cc(-": 1617,
      "CC(C)N": 1618,
      "[C@H]1CC[C@H](": 1619,
      "nc(O)": 1620,
      "S(=O)(=O)[O-])": 1621,
      "c1nc(C)": 1622,
      "c2cc(Cl)ccc2": 1623,
      "P(=O)([O-])": 1624,
      "CC[C@]3": 1625,
      "c2cc(Br)cc": 1626,
      "N2CCN(C(=O)": 1627,
      "c1c2c(": 1628,
      "c2c(F)cccc2": 1629,
      "CNC": 1630,
      "c1nnc(-": 1631,
      "CCC(CC)": 1632,
      "c3cccc(F)c3)": 1633,
      "[C@]23": 1634,
      "C(=O)N[C@@H](Cc2ccccc2)": 1635,
      "=C(O)": 1636,
      "[nH]cc": 1637,
      "c2C1\n": 1638,
      "4)ccc3": 1639,
      "S\n": 1640,
      "CC(C)(O)": 1641,
      "c(S(=O)(=O)N": 1642,
      "NC(=O)[C@@H]1CCCN1C(=O)[C@H](": 1643,
      "c2cc(=O)": 1644,
      "COc1ccc(C(=O)": 1645,
      "C)cc2)cc1\n": 1646,
      "Cc1cc(C)cc(": 1647,
      "CCCO)": 1648,
      "C(c1ccccc1)": 1649,
      "CC[C@@H](O)": 1650,
      "C(C#N)": 1651,
      "C=CC(=O)N": 1652,
      "c2cccc(C)": 1653,
      "CCc2ccccc2)": 1654,
      "c1ccc(-c2ccc(": 1655,
      "Cc1ccccc1-": 1656,
      "3CC3)": 1657,
      "CCl)": 1658,
      "c2cc(N3": 1659,
      "c4ccc5c(": 1660,
      "CCCCC3)": 1661,
      "CC(N": 1662,
      "OC[C@H]3": 1663,
      "c1ccccc1Cl)": 1664,
      "/N=N/": 1665,
      "CCC)": 1666,
      "C(=O)N2CCC(": 1667,
      "[C@](C)(O)": 1668,
      "c4ccc(-": 1669,
      "[C@@]1(": 1670,
      "2)cc1)": 1671,
      "CC2)CC1\n": 1672,
      "COC(=O)c1ccc(": 1673,
      "[N+](=O)[O-])c1\n": 1674,
      "[n+]([O-])": 1675,
      "C(=O)O1\n": 1676,
      "C(=O)C1": 1677,
      "O=C(CSc1n": 1678,
      "c54)": 1679,
      "O[C@@H](O": 1680,
      "COc2ccc(": 1681,
      "c1ccc(Br)cc1\n": 1682,
      "Cn2cn": 1683,
      "4)C2)": 1684,
      "OCc1ccccc1\n": 1685,
      "c(=O)n(C": 1686,
      "c1cc(O)": 1687,
      "CC1CCN(": 1688,
      "N1CCCC1\n": 1689,
      "N=C1": 1690,
      "c34)cc": 1691,
      "cc(C(=O)N": 1692,
      "c2ccc(OC)cc2)": 1693,
      "c(F)c2)": 1694,
      "c2ccc(C(F)(F)F)cc2)": 1695,
      "n5": 1696,
      "/C1=C\\": 1697,
      "C(N)=O)cc": 1698,
      "c1nc(N)": 1699,
      "(Cc2ccccc2)": 1700,
      "OCc2ccccc2)": 1701,
      "N[C@H](": 1702,
      "(F)(F)F)": 1703,
      "ncn2": 1704,
      "CN(C)C)": 1705,
      "NC(=O)OCc1ccccc1)": 1706,
      "C(=O)[O-])": 1707,
      "c4ccncc": 1708,
      "COC1": 1709,
      "c2nc(-c3ccccc3)": 1710,
      "[C@@H](O)[C@H](": 1711,
      "c3c(Cl)cc": 1712,
      "c2c1=O\n": 1713,
      "c2cccc(O": 1714,
      "c4=O)": 1715,
      "c1cc2cc(": 1716,
      "OCC\n": 1717,
      "[C@H]1CC[C@H]2[C@@H]3": 1718,
      "[C@@H]7": 1719,
      "CCCCC2": 1720,
      "c3ccs": 1721,
      "c2ccc(OC)": 1722,
      "c2)ccc1": 1723,
      "c2cccc([N+](=O)[O-])": 1724,
      "CC[C@@H]12\n": 1725,
      "CC2)n1\n": 1726,
      "2H]": 1727,
      "CC3CC(CC(C": 1728,
      "ccc(-": 1729,
      "c4ccc(O)cc": 1730,
      "c1ccccc1)N": 1731,
      "c4cc5": 1732,
      "sc2c1\n": 1733,
      "c1cn(-": 1734,
      "C6": 1735,
      "OCCO2\n": 1736,
      "c4ccccc4)CC3)": 1737,
      "[2H]": 1738,
      "c23)cc": 1739,
      "c(=O)[nH]c2=O)": 1740,
      "[C@@]23": 1741,
      "c3ccc(Br)cc3)": 1742,
      "C(C)(C)O)": 1743,
      "CC5": 1744,
      "COC(": 1745,
      "ccc(N)": 1746,
      "n1-c1ccccc1\n": 1747,
      "CCN(C)CC3)": 1748,
      "c3nc(N": 1749,
      "nc(SCC(=O)N": 1750,
      "Cc1c(-": 1751,
      "c3ccc(N": 1752,
      "c(SCC(=O)N": 1753,
      "CCCCCCCC(=O)": 1754,
      "NC(=O)CC": 1755,
      "CCNS(=O)(=O)": 1756,
      "c2)C1\n": 1757,
      "N2CCO": 1758,
      "OCO2)": 1759,
      "CN(C)c1ccc(": 1760,
      "cccc4": 1761,
      "/C=C1\\": 1762,
      "[O-]\n": 1763,
      "Clc1ccc(": 1764,
      "CC3CC(CC(C3)C1)": 1765,
      "c%1": 1766,
      "B(O)": 1767,
      "c(C": 1768,
      "cc1-": 1769,
      "C2)C1\n": 1770,
      "OCCCO": 1771,
      "Cl)cc1)": 1772,
      "N1CCN(C": 1773,
      "CCC3(CC2)": 1774,
      "[C@@H](NC(=O)": 1775,
      "cc12\n": 1776,
      "c1ccc2c(c1)OCO2\n": 1777,
      "CC(C(=O)N": 1778,
      "c2cncc": 1779,
      "c3ccc(NC(=O)": 1780,
      "C(=O)N[C@@H]1": 1781,
      "5)cc4)": 1782,
      "O1)": 1783,
      "c2ccc(Cl)": 1784,
      "OC)c1\n": 1785,
      "c4)cc": 1786,
      "[nH]3)": 1787,
      "C(=O)N[C@@H](CCCCN)C(=O)N[C@@H](CCCCN)": 1788,
      "NC(=O)[C@H]([C@@H](C)O)": 1789,
      "nc2ccccc21\n": 1790,
      "C[C@@H]1CN(": 1791,
      "CC1CC1)": 1792,
      "nc3c(": 1793,
      "C3=": 1794,
      "c3cccc4cccc": 1795,
      "COc1ccc(-c2n": 1796,
      "CCCCn1": 1797,
      "nn12\n": 1798,
      "C2=O)c1\n": 1799,
      "COc1ccc(Cl)cc1": 1800,
      "c2c(Cl)cccc2": 1801,
      "C(C)=O)cc": 1802,
      "c1ccc(O)cc1\n": 1803,
      "c1cccc(F)c1\n": 1804,
      "c3cc(Cl)ccc3": 1805,
      "[C@H]12\n": 1806,
      "CCC(=O)O": 1807,
      "c1nc(-c2ccccc2)": 1808,
      "NC(=O)[C@H]1": 1809,
      "C1(C)C\n": 1810,
      "CSSC[C@@H](": 1811,
      "C(=O)N2CC": 1812,
      ".Cl.Cl\n": 1813,
      "NC(=O)[C@H](C(C)C)": 1814,
      "C(=O)c2ccccc2": 1815,
      "Nc1ccccc1": 1816,
      "[C@]4": 1817,
      "c1cccc(Cl)c1)": 1818,
      "CC[C@@]4(C)": 1819,
      "c(O)c1\n": 1820,
      "CC4)cc3)": 1821,
      "CCn1c(=O)": 1822,
      "Cc1nn(C)": 1823,
      "Fc1ccc(": 1824,
      "(c1ccccc1)": 1825,
      "O)cc3": 1826,
      "c4ccco": 1827,
      "C(F)(F)F)cc1": 1828,
      ")ccn1\n": 1829,
      "C3=N": 1830,
      "NC(=O)/C=C/": 1831,
      "O=C1c2ccccc2": 1832,
      "CCCC1)": 1833,
      "c3ccc(Cl)c(Cl)": 1834,
      "c2nccc(": 1835,
      "NC(=O)c1cc(": 1836,
      "=C1/": 1837,
      "c3ccc(OC)cc3)": 1838,
      "n(-c3ccccc3)": 1839,
      "F)cc1)": 1840,
      "NC(=O)[C@H](Cc2ccc(O)cc2)": 1841,
      "C[C@@H](O": 1842,
      "oc2c1\n": 1843,
      "Cc1s": 1844,
      "COc1ccc2[nH]": 1845,
      "c2ccccc2c1=O\n": 1846,
      "C3=C(": 1847,
      "C(=O)N1CC": 1848,
      "c3cs": 1849,
      "Cc2ccccc2)CC1\n": 1850,
      "c1ccncc1)": 1851,
      "c(F)cc2": 1852,
      "C(C(=O)O)": 1853,
      "CCNC(=O)N": 1854,
      "cs2)": 1855,
      "c2cccc3c2": 1856,
      "CCNCC2)": 1857,
      "C2)CC1\n": 1858,
      "CC[C@H](C)[C@@H]1": 1859,
      "c1ccc(O)cc1)": 1860,
      "n2)C1\n": 1861,
      "C(O)C(O)": 1862,
      "oc(-": 1863,
      "C(=O)N1\n": 1864,
      "CCn1c(": 1865,
      "NC(=O)c1cn": 1866,
      "N1CCCCC1\n": 1867,
      "c3ccc4": 1868,
      "C3)cc2": 1869,
      "CC1=N": 1870,
      "Cc1nc(N": 1871,
      "c4cccc5": 1872,
      "c1cc(=O)": 1873,
      "N=": 1874,
      "CCN(S(=O)(=O)": 1875,
      "N2CCCC": 1876,
      "c4ccccn4)": 1877,
      "C1CCCC1)": 1878,
      "[C@@](C)": 1879,
      "C2CC3": 1880,
      "c(N)n": 1881,
      "CN(C)S(=O)(=O)": 1882,
      "c3F)": 1883,
      "c(NC": 1884,
      "CCN1CCC(": 1885,
      "c4cc(Cl)cc": 1886,
      "c1cccc2c1": 1887,
      "[C@H]7": 1888,
      "c3ncccc3": 1889,
      "c1Cl)": 1890,
      "C(=O)N[C@H](C)": 1891,
      "c2co": 1892,
      "O=C(N/N=C/": 1893,
      "=N)": 1894,
      "c1ncccc1": 1895,
      "cc(C)c(=O)[nH]": 1896,
      "CCN2C(=O)": 1897,
      "C(=O)NCCCC": 1898,
      "F)cc2": 1899,
      "C(F)(F)F)c1)": 1900,
      "OC[C@H]3O[C@@H](": 1901,
      "c1cccc2ccccc12\n": 1902,
      "C(CO)": 1903,
      "C(=O)NS(=O)(=O)": 1904,
      "C(NC(=O)": 1905,
      "c1ccc(F)cc1F\n": 1906,
      "c32)cc1\n": 1907,
      "CC(O": 1908,
      "c1ccc2ccccc2c1\n": 1909,
      "c2ccc(Br)cc2": 1910,
      "CC2CCCCC2)": 1911,
      "C(=O)N[C@@H](CCCNC(=N)N)C(=O)N[C@@H](CCCNC(=N)N)": 1912,
      "OCCN": 1913,
      "c2ccc(O)cc2": 1914,
      "C=C(C)[C@@H]1": 1915,
      "c3ccc(C)": 1916,
      "nc2n1": 1917,
      "CC(=O)OC": 1918,
      "Cc1ccc(S(=O)(=O)N2": 1919,
      "c(F)c(F)": 1920,
      "Nc1nc(N": 1921,
      "[C@]4(C)": 1922,
      "c1ccc([N+](=O)[O-])cc1\n": 1923,
      "=[N+]=": 1924,
      "O=C(CN1": 1925,
      "Cn2cc": 1926,
      "C3=O)cc": 1927,
      "(CO": 1928,
      "Cc1noc(C)c1": 1929,
      "CC4CC(CC(C": 1930,
      "CCN(CC)C(=O)": 1931,
      "CO1\n": 1932,
      "C[C@H]1CN(": 1933,
      "c23)c1\n": 1934,
      "c3cccc(C)": 1935,
      "/C=C(/": 1936,
      "Cc1c(C(=O)N": 1937,
      "Cn2cc(": 1938,
      "c1ccc(-n2": 1939,
      "C(F)(F)F)cc2": 1940,
      "c(OC": 1941,
      "c2ccccc2n1\n": 1942,
      "c8": 1943,
      "c3c(O)": 1944,
      "nn(C)": 1945,
      "Cc2n": 1946,
      "c2ccc(F)cc2F)": 1947,
      "O.": 1948,
      "c1cncc(": 1949,
      "CCO\n": 1950,
      "c6ccc(": 1951,
      "c2ccnc(N": 1952,
      "1.Cl\n": 1953,
      "c(O)c1": 1954,
      "[C@@H]1O)": 1955,
      "[C@@]4": 1956,
      "c3ccc(C(F)(F)F)cc3)": 1957,
      "c2cccc(OC)": 1958,
      "c1ccccc1F)": 1959,
      "c3cccc(-": 1960,
      "/N=C1\\": 1961,
      "CC[C@H]1OC(=O)": 1962,
      "c2ccc(Cl)cc2)cc1\n": 1963,
      "c3cc4cccc": 1964,
      "NC(=O)[C@H](CCCN=C(N)N)": 1965,
      "c4ccc5c(c4)": 1966,
      "c1ccc(O)c(O)": 1967,
      "c23)CC1\n": 1968,
      "2(=O)": 1969,
      "c21)": 1970,
      "CCCN(CCC)": 1971,
      "c2cnn3": 1972,
      "(OC)c1OC\n": 1973,
      "c2c(N": 1974,
      "c3c[nH]c4ccccc34)": 1975,
      ".O=C(O)C(F)(F)F.O=C(O)C(F)(F)F\n": 1976,
      "c(n2)": 1977,
      "(C#": 1978,
      "CCN(C)CC2)": 1979,
      "c1.Cl\n": 1980,
      "c1cc(-c2ccccc2)": 1981,
      "C)c1\n": 1982,
      "C(=O)c1ccccc1": 1983,
      "c5cn": 1984,
      "c4cccc(Cl)": 1985,
      "cn2)CC1\n": 1986,
      "C(=O)N2\n": 1987,
      "S)=N": 1988,
      "c2ccc(-c3ccccc3)cc2)": 1989,
      "c4ncc": 1990,
      "[C@](C)": 1991,
      "S1\n": 1992,
      "CCN(CC(=O)N": 1993,
      "C(O)(": 1994,
      "O=C(O": 1995,
      "NC(=O)[C@H](Cc2c[nH]c3ccccc23)": 1996,
      "C(=O)O)cc2)": 1997,
      "CCCN(C)C)": 1998,
      "CC[C@@]3(C)": 1999,
      "CC=C(C)C)": 2000,
      "CC3)cc2)": 2001,
      "c(n1)": 2002,
      "NC1=N": 2003,
      "COc1cc(/C=C/": 2004,
      "c1cccc(Br)": 2005,
      "n3cc(": 2006,
      "c2ccncc2": 2007,
      "CC4CC(CC(C4)C2)": 2008,
      "NC1=O)": 2009,
      "[C@@H]2O[C@H](C)": 2010,
      "3)ccc2": 2011,
      "c1NC(=O)": 2012,
      "CC[C@]3(C)[C@H](": 2013,
      "[C@H]1O": 2014,
      "CC(C)(C)c1ccc(": 2015,
      "N2CC": 2016,
      "c3n2": 2017,
      "c3)cc2)": 2018,
      "c(=O)cc": 2019,
      "O=C(CCCC": 2020,
      "c2ccc(Cl)c(Cl)c2)": 2021,
      "O=C(CC": 2022,
      "[n+](C)": 2023,
      "c3cccc(C(F)(F)F)c3)": 2024,
      "c3c(F)cccc3": 2025,
      "Cc2cc(": 2026,
      "c[nH]1\n": 2027,
      "c(C(N)=O)": 2028,
      "C1=C(O)": 2029,
      "CNC(=O)[C@H](": 2030,
      "c1ccc2o": 2031,
      "(F)F)": 2032,
      "CC(=O)N[C@H](": 2033,
      "[C@@H]2C1\n": 2034,
      "C(=O)NC2": 2035,
      "[N+](=O)[O-])cc3)": 2036,
      "c2ccc(-c3ccc(": 2037,
      "Nc1cc(": 2038,
      "c3cc(OC)c(OC)c(OC)": 2039,
      "C(=O)N[C@H](C(=O)N[C@H](": 2040,
      "O4)": 2041,
      "CC2)cc1)": 2042,
      "CCNCC1\n": 2043,
      "N)ncnc32)": 2044,
      "nn2-": 2045,
      "n4cc": 2046,
      "C(C)(C)C)cc": 2047,
      "c1c(N": 2048,
      "CCOC)": 2049,
      "C3CCCC3)": 2050,
      "4C)": 2051,
      "C(C)C)cc": 2052,
      "n(CC(=O)N": 2053,
      "nc1C\n": 2054,
      "C(=O)N(C)[C@@H](": 2055,
      "CCCCC": 2056,
      "CN2CC": 2057,
      "CNCC": 2058,
      "n4cnc5": 2059,
      "N=C2": 2060,
      "CSSC[C@H](": 2061,
      "[N+](C)(C)": 2062,
      "C(F)(F)C(F)(F)": 2063,
      "Cc1c(C)": 2064,
      "C(F)(F)F)cc2)": 2065,
      "c1ccc(Cl)": 2066,
      "nc3ccccc3": 2067,
      "CCCCN(": 2068,
      "c2ccc(C#N": 2069,
      "c1cccc(C(F)(F)F)c1\n": 2070,
      "c2cccc(Br)": 2071,
      "c2=O)c1\n": 2072,
      "c4ccccc4)cc": 2073,
      "c1ncc(-": 2074,
      "c3ccccc3-": 2075,
      "c3c(=O)": 2076,
      "C(=O)N(C)C)": 2077,
      "c3cco": 2078,
      "cn2)cc1\n": 2079,
      "c2cc3cc(": 2080,
      "Cc4ccccc4)": 2081,
      "CC1CCCO": 2082,
      "n[nH]1\n": 2083,
      "CC(C)=CCC": 2084,
      "C3)cc2)": 2085,
      "c2cn(": 2086,
      "c2ccc([N+](=O)[O-])cc2": 2087,
      "CC4)cc": 2088,
      "c2ccc(F)cc2)CC1\n": 2089,
      "nc(-c2ccccc2)": 2090,
      "c1co": 2091,
      "3)ccc21\n": 2092,
      "C3(": 2093,
      "N[C@H]1": 2094,
      "=[N+]=[N-]": 2095,
      "CCCCC1": 2096,
      "COC(=O)[C@H](": 2097,
      "c2s1\n": 2098,
      "ncnc(N": 2099,
      "NC(=O)C2": 2100,
      "C(C)(C)C)cc1\n": 2101,
      "C3)cc1\n": 2102,
      "C[C@H](OC(=O)": 2103,
      "c1cccc(F)c1)": 2104,
      "c2ccc(F)": 2105,
      "c1n[nH]": 2106,
      "c2cn(-": 2107,
      "c2ccc3c(c2)OCCO": 2108,
