{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "(\\[|\\]|\\.|\\(|\\)|=|#|-|\\+|\\\\|\\/|:|~|@|\\?|>|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "MergedWithPrevious",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<s>": 0,
      "</s>": 1,
      "<unk>": 2,
      "<pad>": 3,
      "<mask>": 4,
      "\n": 5,
      "#": 6,
      "%": 7,
      "(": 8,
      ")": 9,
      "+": 10,
      "-": 11,
      ".": 12,
      "/": 13,
      "0": 14,
      "1": 15,
      "2": 16,
      "3": 17,
      "4": 18,
      "5": 19,
      "6": 20,
      "7": 21,
      "8": 22,
      "9": 23,
      "=": 24,
      "@": 25,
      "A": 26,
      "B": 27,
      "C": 28,
      "F": 29,
      "G": 30,
      "H": 31,
      "I": 32,
      "K": 33,
      "L": 34,
      "M": 35,
      "N": 36,
      "O": 37,
      "P": 38,
      "R": 39,
      "S": 40,
      "T": 41,
      "X": 42,
      "Z": 43,
      "[": 44,
      "\\": 45,
      "]": 46,
      "a": 47,
      "b": 48,
      "c": 49,
      "e": 50,
      "g": 51,
      "i": 52,
      "l": 53,
      "n": 54,
      "o": 55,
      "p": 56,
      "r": 57,
      "s": 58,
      "t": 59,
      "cc": 60,
      "CC": 61,
      "O)": 62,
      "C(": 63,
      "=O)": 64,
      "c1": 65,
      "c(": 66,
      "c2": 67,
      "H]": 68,
      "[C": 69,
      "[C@": 70,
      "C)": 71,
      "C(=O)": 72,
      "c1cc": 73,
      "c3": 74,
      "H](": 75,
      "[C@@": 76,
      "c2cc": 77,
      ")cc": 78,
      "(=O)": 79,
      "1\n": 80,
      "(C)": 81,
      "C(=O)N": 82,
      "CCCC": 83,
      "CN": 84,
      "c3cc": 85,
      "[C@H](": 86,
      "F)": 87,
      "c1ccc(": 88,
      "[C@@H](": 89,
      "2)": 90,
      "CO": 91,
      "NC(=O)": 92,
      "Cl": 93,
      "c1cccc": 94,
      "cn": 95,
      "N)": 96,
      "c2cccc": 97,
      "c4": 98,
      "CCN": 99,
      "3)": 100,
      "C1": 101,
      "=C(": 102,
      "[H]": 103,
      "c1\n": 104,
      "[n": 105,
      "C2": 106,
      "]1": 107,
      "C(C)": 108,
      "nc(": 109,
      "c2ccc(": 110,
      "c2ccccc2": 111,
      "[nH]": 112,
      "c3cccc": 113,
      "1)": 114,
      "CC(=O)": 115,
      "CCO": 116,
      "O\n": 117,
      "S(=O)": 118,
      "(F)": 119,
      "c1)": 120,
      "OC)": 121,
      ")cc1\n": 122,
      "(C": 123,
      "[C@H]": 124,
      "=C": 125,
      "S(=O)(=O)": 126,
      "O=C(": 127,
      "Cl)": 128,
      "cccc": 129,
      "[C@@H]": 130,
      "c3ccccc3": 131,
      "[H])": 132,
      "CC(C)": 133,
      "([H])": 134,
      "n1": 135,
      "CCN(": 136,
      "c1cc(": 137,
      "F)cc": 138,
      "n2": 139,
      "c3ccc(": 140,
      "CCCN": 141,
      "C(F)": 142,
      "c1n": 143,
      "cc(": 144,
      "c2c(": 145,
      "CCC": 146,
      "[C@]": 147,
      "C(F)(F)": 148,
      "Cl)cc": 149,
      "2\n": 150,
      "/C": 151,
      "[C@@]1": 152,
      "C\n": 153,
      "C(=O)N[C@@H](": 154,
      "[C@@]": 155,
      "c2n": 156,
      "CC(=O)N": 157,
      "NC(=O)[C@H](": 158,
      "c2)": 159,
      "[C@]1": 160,
      "+]": 161,
      "4)": 162,
      "c2ccccc2)": 163,
      "-]": 164,
      "Cc1ccc(": 165,
      "c(=O)": 166,
      "(O)": 167,
      "Cc1cccc": 168,
      "=O\n": 169,
      "CC1\n": 170,
      "=C/": 171,
      "O)cc": 172,
      "COc1ccc(": 173,
      "[N": 174,
      "C(=": 175,
      "[C@H]1": 176,
      "[O": 177,
      "[O-]": 178,
      "c(-": 179,
      "N1": 180,
      "c2cc(": 181,
      "Cc1": 182,
      "CC1": 183,
      "c5": 184,
      "Br": 185,
      "(CC": 186,
      "2CC": 187,
      "C3": 188,
      "c4cccc": 189,
      "[C@@H]1": 190,
      "C(=O)O)": 191,
      "[N+]": 192,
      "C(C)(C)": 193,
      "C)cc": 194,
      "n1\n": 195,
      "c1ccccc1": 196,
      "c3c(": 197,
      "[C@H](O)": 198,
      "[C@@H](O)": 199,
      "O=": 200,
      "c1cccc(": 201,
      "c3)": 202,
      "CC2)": 203,
      "OC": 204,
      "3)cc": 205,
      "nn": 206,
      "2)cc1\n": 207,
      "[C@@H](C)": 208,
      "[H][C@@]1": 209,
      "c3ccccc3)": 210,
      "=N": 211,
      "nc(-": 212,
      "ccc(": 213,
      "C1\n": 214,
      "/C=C/": 215,
      "CO)": 216,
      "CCC(": 217,
      "cs": 218,
      "CC(": 219,
      "N2": 220,
      "O=C(N": 221,
      "N)=O)": 222,
      "ncc": 223,
      "c[nH]": 224,
      "[C@H](C)": 225,
      "C(F)(F)F)": 226,
      "CS": 227,
      "c4ccccc4": 228,
      ")cc1": 229,
      "(=O)[O-]": 230,
      "[N+](=O)[O-]": 231,
      "CN1": 232,
      "C#": 233,
      "(-": 234,
      "c(C)": 235,
      "CC)": 236,
      "[H][C@]1": 237,
      "Cc1cc": 238,
      "CNC(=O)": 239,
      "CCCCCCCC": 240,
      "c12\n": 241,
      "C(=O)O": 242,
      "c(N": 243,
      "CC3)": 244,
      "C(C)C)": 245,
      "nc2": 246,
      "C2)": 247,
      "CN(": 248,
      "c1ccccc1)": 249,
      "[C@H]2": 250,
      "nc(N": 251,
      "C(C)=O)": 252,
      "O=C(O)": 253,
      "Cl\n": 254,
      "C(=O)N1": 255,
      "c(OC)": 256,
      "C[C@H](": 257,
      "c1ccccc1\n": 258,
      "COC(=O)": 259,
      "[C@@H]2": 260,
      "C(=N)": 261,
      "Cn1": 262,
      "S(=O)(=O)N": 263,
      "CC(C)C)": 264,
      "n2)": 265,
      "CC2": 266,
      "CN(C)": 267,
      "OC(=O)": 268,
      "n3": 269,
      "Cc1ccccc1)": 270,
      "c(O)": 271,
      "c2cn": 272,
      "c1ccc(-": 273,
      "[H][C@@]12": 274,
      "c2cccc(": 275,
      "/N": 276,
      "c4ccc(": 277,
      "S)": 278,
      "F\n": 279,
      "c1cn": 280,
      "COc1cc(": 281,
      "C2\n": 282,
      "=O)cc": 283,
      "COc1cc": 284,
      "[C@]3": 285,
      "c3n": 286,
      "co": 287,
      "CC(C)(C)": 288,
      "NC(=O)[C@@H](": 289,
      "c3cc(": 290,
      "C(F)(F)F)cc": 291,
      "c(Cl)": 292,
      "C1)": 293,
      "Cc1cc(": 294,
      "OC\n": 295,
      "c2c(c1)": 296,
      "N(C)": 297,
      "CCN1": 298,
      "4)cc": 299,
      "O=C1": 300,
      "=C\\": 301,
      "Br)": 302,
      "C(=N)N)": 303,
      "Cc1n": 304,
      "C=": 305,
      "[C@@]3": 306,
      "C[C@@H](": 307,
      "N(": 308,
      "NC(=O)N": 309,
      "c2ccc(Cl)cc": 310,
      "CCN(C": 311,
      "cc1": 312,
      "C1=O\n": 313,
      "cc(-": 314,
      "CCOC(=O)": 315,
      "CC1)": 316,
      "c1-": 317,
      "C3)": 318,
      "(O": 319,
      "/C(": 320,
      "C(N)=O)": 321,
      "CCN(C(=O)": 322,
      "P(=O)": 323,
      "5)": 324,
      "(C)CC": 325,
      "[C@@]2": 326,
      "ncn": 327,
      "c23)": 328,
      "OCC": 329,
      "CCCNC(=N)N)": 330,
      "CCCCN)": 331,
      "[H][C@]12": 332,
      "C(=O)N[C@H](": 333,
      "CC(=O)O)": 334,
      "[C@@]1([H])": 335,
      "c1c(": 336,
      "[O-])": 337,
      "Br)cc": 338,
      "cc2": 339,
      "C(=O)O\n": 340,
      "CCCN1": 341,
      "c4cc": 342,
      "[N+](=O)[O-])": 343,
      "c2ccc(F)cc": 344,
      "O[C@H](": 345,
      "[C@H]3": 346,
      "c1=O\n": 347,
      "[C@]2": 348,
      "OCO": 349,
      "C(C)(C)C)": 350,
      "CN2": 351,
      "C#N)": 352,
      "[C@]1([H])": 353,
      "c(F)": 354,
      "c1nc(": 355,
      "N#": 356,
      "NS(=O)(=O)": 357,
      "OC)cc": 358,
      "2)c1\n": 359,
      "c2nc(": 360,
      "c(=O)[nH]": 361,
      "2)CC1\n": 362,
      "[C@@H]3": 363,
      "c12)": 364,
      "n(C)": 365,
      "c2c1\n": 366,
      "C(O)": 367,
      "nc3": 368,
      "c4)": 369,
      "C4": 370,
      "o1\n": 371,
      "N3": 372,
      "c2ccc(-": 373,
      "c2[nH]": 374,
      "s1\n": 375,
      "N=C(": 376,
      "[C@]([H])": 377,
      "c4ccccc4)": 378,
      ")cc2": 379,
      ")cc1)": 380,
      "c1cc2": 381,
      "Cc2ccccc2)": 382,
      "c1ccc2c(c1)": 383,
      "c2c1": 384,
      "n(": 385,
      "CCn1": 386,
      "c3cn": 387,
      "c4c(": 388,
      ".Cl\n": 389,
      "c21\n": 390,
      "c3cccc(": 391,
      "OC(C)=O)": 392,
      "C(=O)N2": 393,
      "CCOCC": 394,
      "n1)": 395,
      "C(=S)": 396,
      "n3)": 397,
      "(C)C)": 398,
      "n(-": 399,
      "C1CCCC": 400,
      "c2ccc3c(": 401,
      "CCC(=O)O)": 402,
      "c2cc3": 403,
      "P(=O)(O)": 404,
      "Nc1n": 405,
      "=C(C)": 406,
      "3CC": 407,
      "Cc1cn": 408,
      "c3ccc(F)cc": 409,
      "(C)(=O)": 410,
      "[C@]4": 411,
      "C[C@H]1": 412,
      "c5cccc": 413,
      "c(N)": 414,
      "([O-])": 415,
      "CCNC(=O)": 416,
      "CCC(=O)N": 417,
      "O)cc1)": 418,
      "OC)c(OC)": 419,
      "nc1": 420,
      "COc1ccc(-": 421,
      "S(C)(=O)": 422,
      "C[C@@H]1": 423,
      "cn1\n": 424,
      "[n+]": 425,
      "c3ccc(Cl)cc": 426,
      "COc1cccc(": 427,
      "cc3": 428,
      "CN(C": 429,
      ")ccc1": 430,
      "n2)cc1\n": 431,
      "C(=N": 432,
      ")cc(": 433,
      "3CCCC": 434,
      "COc1ccccc1": 435,
      "C(N)": 436,
      "Cc1c[nH]": 437,
      "Cc2ccc(": 438,
      "c2ccccc21\n": 439,
      "C(=O)O)cc": 440,
      "c1cccc2": 441,
      "c2ccc(Cl)cc2)": 442,
      ")cc2)": 443,
      "C2CCCC": 444,
      "Cc1ccc(-": 445,
      "c6": 446,
      "3)cc1\n": 447,
      "c1ccc(O": 448,
      "Cl.": 449,
      "C(F)(F)F\n": 450,
      "=C2": 451,
      "c2ccc3c(c2)": 452,
      "CC[C@H](": 453,
      "c2cccn": 454,
      "[C@]3([H])": 455,
      "c(C(=O)N": 456,
      "=C(\\": 457,
      "CCN(C)": 458,
      "3)cc2": 459,
      "CCS": 460,
      "c2ccccc12)": 461,
      "[C@@](C)": 462,
      ".O=C(O)": 463,
      "Cc1cccc(": 464,
      "c1ccc(N": 465,
      "F)cc1\n": 466,
      "Cn2": 467,
      "c2nc(-": 468,
      "C#N": 469,
      "O[C@@H](": 470,
      "[C@@]4": 471,
      "c2)cc1\n": 472,
      "/C(=N": 473,
      "Cc1ccccc1\n": 474,
      "CC(N)=O)": 475,
      "(C#": 476,
      "CCN(CC)": 477,
      "c1cc(-": 478,
      "CC(=O)N1": 479,
      "=C1": 480,
      "no": 481,
      "c2ccc(F)cc2)": 482,
      "Cc1ccccc1": 483,
      "=O)cc1\n": 484,
      "c2cc(-": 485,
      "[H][C@@]12CC": 486,
      "n(C": 487,
      "CC(O)": 488,
      "CCCN(": 489,
      "O1\n": 490,
      "Cl)cc1\n": 491,
      "=N/": 492,
      "/N=C/": 493,
      "CCN2": 494,
      "OC(": 495,
      "C(=O)N(": 496,
      "C)cc1\n": 497,
      "COc1cc2": 498,
      "n4": 499,
      "C2=O)": 500,
      "[C@@]([H])": 501,
      "CCCN1C(=O)": 502,
      "C2=O\n": 503,
      "c2ncn": 504,
      "C(=O)N[C@@H](CC(C)C)": 505,
      "[C@]([H])(": 506,
      "c1ccc(Cl)cc": 507,
      "cn2": 508,
      "CCC(N)=O)": 509,
      "C[C@H](O)": 510,
      "c34)": 511,
      "2CCC(": 512,
      "CC2)cc1\n": 513,
      "c5ccccc5": 514,
      "CN(C(=O)": 515,
      "Cl)c(Cl)": 516,
      "[C@@H](O)[C@H](O)": 517,
      "[C@@]3([H])": 518,
      "(N)": 519,
      "C=C": 520,
      "C(=O)N[C@@H](CCCNC(=N)N)": 521,
      "[H][C@]12CC": 522,
      "O[C@H](CO)": 523,
      "C(=O)N[C@@H](CCCCN)": 524,
      "CCC2": 525,
      "/C=C\\": 526,
      "CC4)": 527,
      "(CC)": 528,
      "OCCO": 529,
      "c2c[nH]": 530,
      "2)cc1": 531,
      "c2n1\n": 532,
      "c3ccccc23)": 533,
      "c1OC\n": 534,
      "C(=O)OC)": 535,
      "CC(=O)N[C@@H](": 536,
      "N1CCN(": 537,
      "Cc1ccc(O)cc1)": 538,
      "NC(=O)[C@H](CC(C)C)": 539,
      "CS(=O)(=O)": 540,
      "c1C\n": 541,
      "CCC1": 542,
      "c3[nH]": 543,
      "nc(C)": 544,
      "1C\n": 545,
      "c2ccccc12\n": 546,
      "c2=O)": 547,
      "1)N": 548,
      "CC3": 549,
      "C[C@@H](O)": 550,
      "c3ccc(F)cc3)": 551,
      "(C(=O)N": 552,
      "c1nc(-": 553,
      "[C@@H](C)O)": 554,
      "3)cc2)": 555,
      "NC(=O)CNC(=O)": 556,
      "CCCO": 557,
      "c2cccc3": 558,
      "C(C)C\n": 559,
      "CCC[C@H]1": 560,
      "c2ccccc2)cc1\n": 561,
      "n1-": 562,
      "CC2\n": 563,
      "n[nH]": 564,
      "c2s": 565,
      "CCOCC2)": 566,
      "C(=O)N[C@@H](C)": 567,
      "c2ncc": 568,
      "Cc1c(": 569,
      "C(=S)N": 570,
      "c4cc(": 571,
      "c1cccn": 572,
      "c2cc1": 573,
      "NC(=O)O": 574,
      "=C(N)": 575,
      "C(=O)N(C)": 576,
      "Cc1c[nH]c2ccccc12)": 577,
      "Cc1cc(C)": 578,
      "12\n": 579,
      "c3cccn": 580,
      "N(C": 581,
      "O=S(=O)": 582,
      "c1ccc(F)cc": 583,
      "C(=O)NC": 584,
      "CCOCCO": 585,
      "CC1(C)": 586,
      "+]1": 587,
      "c(O": 588,
      "c(cc1": 589,
      "CCC3": 590,
      "(N": 591,
      "c2ccc(O": 592,
      "CCOCC3)": 593,
      "[C@@]1(C)": 594,
      "C4)": 595,
      "[Na": 596,
      "cccc2": 597,
      "NC(=O)[C@H](C)": 598,
      "c1O\n": 599,
      "[Na+]": 600,
      "CCCC(=O)": 601,
      "c2)c1\n": 602,
      "c3ccc(Cl)cc3)": 603,
      "/C(=C\\": 604,
      ".[Na+]": 605,
      "-]\n": 606,
      "/C=C": 607,
      "cs1\n": 608,
      "O=c1": 609,
      ".[": 610,
      "nc(N)": 611,
      "N=C(N)": 612,
      "N2CCCC": 613,
      ")cc3)": 614,
      "C2)cc1\n": 615,
      "c1O": 616,
      "CC[C@@H](": 617,
      "c3c2": 618,
      "c1ccc(Cl)cc1\n": 619,
      "[S": 620,
      "NC": 621,
      "(Cl)": 622,
      "[C@]1(C)": 623,
      "NC(=O)[C@H](CCCNC(=N)N)": 624,
      "N1C(=O)": 625,
      "(F)(F)": 626,
      "c2nc(N": 627,
      "c1cccc(-": 628,
      "c3ccc(-": 629,
      "O)cc1\n": 630,
      "nn2": 631,
      "[C@](C)": 632,
      "(C)C\n": 633,
      "C(N)=O\n": 634,
      "c2o": 635,
      "NC(=O)[C@@H](N)": 636,
      "C(=O)NCC": 637,
      "O)cc2)": 638,
      "NC1": 639,
      "CN1C(=O)": 640,
      "(C(F)(F)F)": 641,
      "c2ccc(Cl)cc2": 642,
      "Cl)c(": 643,
      "4)cc3)": 644,
      "CC(=O)O": 645,
      "C=C(": 646,
      "N1CCCC": 647,
      "N4": 648,
      "c2nc3ccccc3": 649,
      "(N)(=O)": 650,
      "NC(=O)[C@@H]1": 651,
      "nc1\n": 652,
      "CN1CCN(": 653,
      "CCCN2": 654,
      "/C(=C/": 655,
      "S(C)(=O)=O)": 656,
      "CCOc1ccc(": 657,
      "cn1)": 658,
      "(CO)": 659,
      "C(=O)N[C@@H](Cc1ccccc1)": 660,
      "[C@H]1O\n": 661,
      "n2cc": 662,
      "3\n": 663,
      "c2cc(Cl)cc": 664,
      "c1s": 665,
      "/C(=N\\": 666,
      "c2ccncc": 667,
      "O)c(": 668,
      "c2c(-": 669,
      "nc(S": 670,
      "c2cccc(Cl)": 671,
      "s2)": 672,
      "CC[C@H](C)": 673,
      "NC(C)=O)": 674,
      "NC(=O)[C@H](CCCCN)": 675,
      "c3ccc4c(": 676,
      "c2)CC1\n": 677,
      "C2CC2)": 678,
      "O2\n": 679,
      "n2cn": 680,
      "CN3": 681,
      "C(=C)": 682,
      "CCOCC1\n": 683,
      "Cc2ccccc2": 684,
      "/C=C(\\": 685,
      "N\n": 686,
      "(CCCC": 687,
      "S(N)(=O)": 688,
      "cn2)": 689,
      "/C(C)": 690,
      "c5ccc(": 691,
      "c3cc4": 692,
      "[H]\n": 693,
      "c(NC(=O)": 694,
      "C(=O)N1CCC[C@H]1": 695,
      "C)cc1": 696,
      "c4cn": 697,
      "C3=O)": 698,
      "N2CCN(": 699,
      "(C#N)": 700,
      "[C@]1(C)CC": 701,
      "[C@]4([H])": 702,
      "OC)c1OC\n": 703,
      "O)c(O)": 704,
      "Nc1ccc(": 705,
      "c2cccs": 706,
      "C2=N": 707,
      "c2ccco": 708,
      "NC(=O)[C@H](CO)": 709,
      "[C@@H](C)CC)": 710,
      "[C@@]3(C)": 711,
      "[n+]1": 712,
      "c2c(C)": 713,
      "O)cc2": 714,
      "[N+]([O-])": 715,
      "N(C(=O)": 716,
      "c1nc(N": 717,
      "NCC": 718,
      "CCCCCCCCCCCC": 719,
      "4CC": 720,
      "5)cc": 721,
      "C3CCCC": 722,
      "[C@]3(C)": 723,
      "Cc3ccccc3)": 724,
      "c1c[nH]": 725,
      "c1ncc": 726,
      "=C(N)N)": 727,
      "c(S": 728,
      "[C@@H](O": 729,
      "CCCNC(=O)": 730,
      "cccc1": 731,
      "s1)": 732,
      "C)cc2)": 733,
      "c3ncc": 734,
      "[H][C@@]1(": 735,
      ".O=C(O)C(F)(F)F\n": 736,
      "C1CCN(": 737,
      "/C=N/": 738,
      "N(C)C)": 739,
      "[C@H](O": 740,
      "n2)c1\n": 741,
      "3)CC2)": 742,
      "c2c(=O)": 743,
      "CN(CC": 744,
      "c1ccc(NC(=O)": 745,
      "N1\n": 746,
      "C1=O)": 747,
      "OC)c(OC)c(OC)": 748,
      "c2cs": 749,
      "=S)": 750,
      "O=[N+]([O-])": 751,
      "CCCN=C(N)N)": 752,
      "cnc2": 753,
      "CSc1n": 754,
      "NC(=O)[C@H](Cc1ccccc1)": 755,
      "[C@H]4": 756,
      "C(=O)N[C@@H](CO)": 757,
      "Cl)cc1": 758,
      "c1c(C)": 759,
      "CCCn1": 760,
      "c3ccc4c(c3)": 761,
      "c2)cc1": 762,
      "c32)": 763,
      "c1cccc(Cl)": 764,
      "=C3": 765,
      "[nH]c(=O)": 766,
      "c1ccc(Cl)cc1)": 767,
      "C1(": 768,
      "[H][C@]1(": 769,
      "N1CCC(": 770,
      "cc(C)": 771,
      "nc12\n": 772,
      "C1=": 773,
      "CCO)": 774,
      "F)c(F)": 775,
      "Cc3ccc(": 776,
      "C(=O)N(C": 777,
      "CN)": 778,
      "C(=O)CC": 779,
      "c1ccc(F)cc1\n": 780,
      "[C@@]2([H])": 781,
      "NC1=O\n": 782,
      "c2ccc(Br)cc": 783,
      "C(=O)OC": 784,
      "CCc1n": 785,
      "C)cc3)": 786,
      "C)cc2": 787,
      "no1\n": 788,
      "[C@@]2(C)": 789,
      "c1ccco": 790,
      "C(=O)N3": 791,
      "C(C)=O\n": 792,
      "[N+](C)": 793,
      "[C@@H](OC(C)=O)": 794,
      "C(=O)N[C@@H](CCC(=O)O)": 795,
      "ncc2": 796,
      "CCS(=O)(=O)": 797,
      "c2-": 798,
      "c3ncn": 799,
      "c2ccccc2)CC1\n": 800,
      "c2ccc(N": 801,
      "C(=N)N": 802,
      "[C@@]([H])(": 803,
      "[C@@H]1O\n": 804,
      "c3ccc(O": 805,
      "c1Cl\n": 806,
      "[nH]1\n": 807,
      "CCCCN": 808,
      "c4n": 809,
      "[C@@H]4": 810,
      "N(C)C(=O)": 811,
      "C[C@H]2": 812,
      "C2CCCCC2)": 813,
      "C1=C(": 814,
      "c2ccccn2)": 815,
      "/C=C2": 816,
      "CCC(C)": 817,
      "[C@@]21": 818,
      "[C@@H](N)": 819,
      "nn1\n": 820,
      "Cc1cc2": 821,
      "c1ccncc": 822,
      "C(F)(F)F": 823,
      "c3ccncc": 824,
      "N1CC": 825,
      "nc2c1\n": 826,
      "oc(": 827,
      "CC1CCCC": 828,
      "cccc3": 829,
      "c2ccc(F)cc2": 830,
      "4CCCC": 831,
      "NC(": 832,
      "c4c3": 833,
      "[C@]21C\n": 834,
      "6)": 835,
      "C5": 836,
      "c2cc(C)": 837,
      "c(C(=O)O)": 838,
      "[C@@H](OC(=O)": 839,
      "Oc1ccc(": 840,
      "CC[C@H](C)[C@H](": 841,
      "C[C@@H]2": 842,
      "c3cc(Cl)cc": 843,
      "c1ccccc1-": 844,
      "c(C)c1": 845,
      "c1cc(Cl)cc": 846,
      ".[Na+]\n": 847,
      "nn1": 848,
      "c(C)c1\n": 849,
      "c23)cc1\n": 850,
      "(C(=O)O)": 851,
      ")cc3": 852,
      "[C@]2([H])": 853,
      "C1=N": 854,
      "OP(=O)(O)": 855,
      "c3o": 856,
      "c2c[nH]c3ccccc23)": 857,
      "c3cccc4": 858,
      "Cc1nc(": 859,
      "c(-c2ccccc2)": 860,
      "CC(C)C[C@H](": 861,
      "O2)": 862,
      "c4ccc(F)cc": 863,
      "c2cccc(F)": 864,
      "C(=O)/C=C/": 865,
      "CCCCCC": 866,
      "c2ccc(N3": 867,
      "c2cccnc2)": 868,
      "c1ccc(F)cc1)": 869,
      "N2C(=O)": 870,
      "O[C@H](CO)[C@@H](O)[C@H](O)": 871,
      "C2(": 872,
      "c3ccco": 873,
      "c5cc": 874,
      "cn3)": 875,
      "c4ccccc34)": 876,
      "c2C)": 877,
      "c1=O)": 878,
      "c2ccc3ccccc3": 879,
      "ccc3": 880,
      "O)cc1": 881,
      "c(=O)n2": 882,
      "3CCOCC3)": 883,
      "[C@H]2CC": 884,
      "C3CC3)": 885,
      "n1cn": 886,
      "cc(O)": 887,
      "[H][C@@]12C": 888,
      "/C=C(\\C)": 889,
      "CC(=O)N2": 890,
      "c3cccc(Cl)": 891,
      "c1cs": 892,
      "[C@@]1([H])C(C)(C)": 893,
      "4)CC3)": 894,
      "c(F)cc": 895,
      "NC(=O)[C@H](CCC(=O)O)": 896,
      "C(=O)N[C@@H](CCC(N)=O)": 897,
      "c3s": 898,
      "C(=O)NC(": 899,
      "CCc1ccc(": 900,
      "CCN1C(=O)": 901,
      "COc1ccc2c(c1)": 902,
      "c3nn": 903,
      "c2cc(O)": 904,
      "NC(=O)C(": 905,
      "c3ccccc32)": 906,
      "c(-c2ccc(": 907,
      "CC3)cc": 908,
      "NC(=O)[C@H](CC(=O)O)": 909,
      "C1CCCCC1\n": 910,
      "C(=O)Nc1ccc(": 911,
      "CN(C)C(=O)": 912,
      "CC\n": 913,
      "c2ccco2)": 914,
      "[C@@]1([H])CC": 915,
      "C(=O)N[C@@H](CC(=O)O)": 916,
      "CC2)cc1": 917,
      "c3ccccn3)": 918,
      "cs1)": 919,
      "[C@H](OC(=O)": 920,
      "OCO3)": 921,
      "CCOCC1)": 922,
      "CC(C)(C)O": 923,
      "C[C@H](C)": 924,
      "nc4": 925,
      "O=C(/C=C/": 926,
      "3CCN(": 927,
      "cc4": 928,
      "C2=C(": 929,
      "CCC[C@H](": 930,
      "C2=O)cc1\n": 931,
      "4)cc3": 932,
      "NC(=O)[C@H](CCC(N)=O)": 933,
      "cc(C(=O)N": 934,
      "c2cccs2)": 935,
      "C(=O)NCC(=O)N[C@@H](": 936,
      "=C(/": 937,
      "CC2)c1\n": 938,
      "c2ccccc2Cl)": 939,
      "c2cc(F)cc": 940,
      "O=C1N": 941,
      "nc1-": 942,
      "s3)": 943,
      "c1nc2ccccc2": 944,
      "n(CC": 945,
      "c3)cc": 946,
      "cs3)": 947,
      "Cc3ccccc3": 948,
      "Br\n": 949,
      "CCCCC2)": 950,
      "c1ccc(Cl)cc1": 951,
      "N2CCOCC2)": 952,
      "=C(C)C)": 953,
      "N)ncn": 954,
      "c(=O)o": 955,
      "CO\n": 956,
      "S(C)(=O)=O)cc": 957,
      "Cc1ccc(NC(=O)": 958,
      "C[C@@H](C)": 959,
      "c1[nH]": 960,
      "c2ccc([N+](=O)[O-]": 961,
      "c4ccc(Cl)cc": 962,
      "c1ccc(-c2n": 963,
      "(O)(": 964,
      "(CC(C": 965,
      ")cc(OC)c1OC\n": 966,
      "c2cccc(-": 967,
      "NC(=O)CNC(=O)[C@H](": 968,
      "N[C@@H](": 969,
      "CCN(C)CC": 970,
      "c2)n1\n": 971,
      "c3cccnc3)": 972,
      "c(-c3ccc(": 973,
      "o2)": 974,
      "Cc1ccc2c(c1)": 975,
      "n3cc": 976,
      "=C)": 977,
      "Nc1nc(": 978,
      "CCCN1C(=O)[C@H](": 979,
      "c3nc(": 980,
      "c(OC)c1\n": 981,
      "c2cc3c(": 982,
      ".[Br": 983,
      "OC)c(": 984,
      "=CC(=O)": 985,
      "[C@@]1(C)CC": 986,
      "CSS": 987,
      "c1cccc(F)": 988,
      "/C=N": 989,
      "(OC)": 990,
      "I)": 991,
      "nc21\n": 992,
      "c2ccc(NC(=O)": 993,
      "c4[nH]": 994,
      "[C@H](OC(C)=O)": 995,
      "n2)CC1\n": 996,
      "C2CCN(": 997,
      "CCCC1": 998,
      "nn2)": 999,
      "c2ccccc2-": 1000,
      "[C@@]4([H])": 1001,
      "c5ccccc5)": 1002,
      "3CCCCC3)": 1003,
      "/C=C2\\": 1004,
      "C1CC1\n": 1005,
      "[C@H](O)[C@@H](O)": 1006,
      "CC(=O)N(": 1007,
      "c(C(F)(F)F)": 1008,
      "Cc1cc(-": 1009,
      "COc1cc(-": 1010,
      "COP(=O)(O)": 1011,
      "c2cccc(C(F)(F)F)": 1012,
      "c[nH]1)": 1013,
      "[N+](=O)[O-]\n": 1014,
      "c(Br)": 1015,
      "c1c(O)": 1016,
      "3)cc1": 1017,
      "OC1": 1018,
      "C(=O)N[C@@H](CC(N)=O)": 1019,
      "c3cc(-": 1020,
      "ccc2": 1021,
      "c5)": 1022,
      "c2ccc(C(F)(F)F)cc": 1023,
      "Cn1cn": 1024,
      "NC(=O)c1ccc(": 1025,
      "N(CC": 1026,
      "CCCCCCCCCCCCCCCC": 1027,
      "%1": 1028,
      "S(=O)(=O)c1ccc(": 1029,
      "nn3": 1030,
      "CCCC2": 1031,
      "Cn1cc(": 1032,
      "/N=C(\\": 1033,
      "CN2CC": 1034,
      "c1ccc2c(": 1035,
      "c-": 1036,
      "NC(=O)[C@H](C": 1037,
      "nc(NC(=O)": 1038,
      "C(=O)C(": 1039,
      "CC#": 1040,
      "c2ccncc2)": 1041,
      "S(N)(=O)=O)cc": 1042,
      "c3ccco3)": 1043,
      "C(C)(C)C\n": 1044,
      "[S+]": 1045,
      "[C@@]5": 1046,
      "[C@@H](NC(=O)": 1047,
      "c3ccccc3)cc": 1048,
      "O=S(=O)(": 1049,
      "c(C#N)": 1050,
      "[C@]1(C)CC[C@@]1([H])C(C)(C)": 1051,
      "C1CC": 1052,
      "c1F\n": 1053,
      "[H][C@@]1(O": 1054,
      "c([N+](=O)[O-])": 1055,
      "Cn1cc": 1056,
      "c5c(": 1057,
      "OCO2\n": 1058,
      "CS)": 1059,
      "O)cc3)": 1060,
      "C[C@@H]3": 1061,
      "4CCOCC": 1062,
      "c1ccc2[nH]": 1063,
      "c2cccc(Cl)c2)": 1064,
      "COc1cc2c(cc1": 1065,
      "CCCCO": 1066,
      "c1ccc2ccccc2": 1067,
      "n4)": 1068,
      "[C@H]2O)": 1069,
      "CCCN(C": 1070,
      "OC[C@H]1": 1071,
      "c2ccccc2F)": 1072,
      "CCCC)": 1073,
      "Cn1c(=O)": 1074,
      "C[C@]1": 1075,
      "NC(=O)[C@H](CC(N)=O)": 1076,
      "c7": 1077,
      "3)c1\n": 1078,
      "O=C(Nc1ccc(": 1079,
      "C(F)F)": 1080,
      "CC1(": 1081,
      "cn3": 1082,
      "[C@@H](CO)": 1083,
      "c3c[nH]": 1084,
      "[C@H]3O)": 1085,
      "n2)cc1": 1086,
      "cc(OC)": 1087,
      "(CC1)": 1088,
      "c2c(F)cc": 1089,
      "c3ccc(Cl)cc3": 1090,
      "n1C\n": 1091,
      "c2c1)": 1092,
      "C/C=C\\": 1093,
      "/C(=N/": 1094,
      "sc1": 1095,
      "N)cc": 1096,
      "Cc1cccc2": 1097,
      "[Cl": 1098,
      "c2c(O)": 1099,
      "Cc1cnc[nH]1)": 1100,
      "COc1ccc(NC(=O)": 1101,
      "[C@]5": 1102,
      "CCN(CC": 1103,
      "=CC": 1104,
      "ncc1": 1105,
      "[N+](=O)[O-])cc": 1106,
      "CN1CCC(": 1107,
      "/C=C/C(=O)": 1108,
      "=C1\\": 1109,
      "[n+]2": 1110,
      "CCN(C)C)": 1111,
      "O[C@H](C)": 1112,
      "C(=O)N[C@@H](Cc1c[nH]c2ccccc12)": 1113,
      "c13)": 1114,
      "[C@@]21[H]\n": 1115,
      "Cc2ccc(O)cc2)": 1116,
      "c3c2)": 1117,
      "c1cc(C)": 1118,
      "S(=O)(=O)O)": 1119,
      "CCCN(C(=O)": 1120,
      "c2ccc(C(=O)N": 1121,
      "c3cccc(F)": 1122,
      "OC(C)(C)": 1123,
      "Cc1no": 1124,
      "c3cc(O)": 1125,
      "N2CC": 1126,
      "n3cn": 1127,
      "N#Cc1ccc(": 1128,
      "CC(=O)Nc1ccc(": 1129,
      "/C1": 1130,
      "S(=O)(=O)N2": 1131,
      "c3ccc(F)cc3": 1132,
      "C=O)": 1133,
      "c2ccc(S(=O)(=O)N": 1134,
      "c3cc(C)": 1135,
      "c3c(C)": 1136,
      "c2cccc3cccc": 1137,
      "/C(C)=C/": 1138,
      "c2ncccc2": 1139,
      "C[C@]1([H])": 1140,
      "(=O)o": 1141,
      "C(=O)N1CCC(": 1142,
      "n2cc(": 1143,
      "NC(=O)CC": 1144,
      "C1CCCCC1)": 1145,
      "[C@H](N)": 1146,
      "c2F)": 1147,
      "n2c(": 1148,
      "c3ccc(OC)cc": 1149,
      "c3)cc2": 1150,
      "CCN1CCN(": 1151,
      "C)cc3": 1152,
      "c3ccncc3)": 1153,
      "C(=O)O)cc1\n": 1154,
      "c1N": 1155,
      "c3ccc(Br)cc": 1156,
      "n(-c2ccccc2)": 1157,
      "CCC3)": 1158,
      "=[N+]": 1159,
      "c1ccc(F)cc1": 1160,
      "C(c2ccccc2)": 1161,
      "(F)(F)F)": 1162,
      "c2ccc(OC)cc": 1163,
      "c2ccc3c(c2)OCO3)": 1164,
      "(C3": 1165,
      "C(F)(F)F)cc1\n": 1166,
      "CC1=C(": 1167,
      "nc2-": 1168,
      "CCCN)": 1169,
      "NCCCC": 1170,
      "c(Cl)c1\n": 1171,
      "Cc1cccc(-": 1172,
      "n2-": 1173,
      "c3cccs3)": 1174,
      "[C@]3(O)": 1175,
      "c2nc3c(": 1176,
      "c3ccccc3)cc2)": 1177,
      "Br)cc1\n": 1178,
      "O)cc3": 1179,
      "2)C1\n": 1180,
      "c2c(Cl)cc": 1181,
      "NC(=O)[C@H](Cc1ccc(O)cc1)": 1182,
      "c3nc4ccccc4": 1183,
      "c(=O)n(C)": 1184,
      "O[C@H](CO)[C@@H](O)": 1185,
      "[C@H](NC(=O)": 1186,
      "N1CCOCC1\n": 1187,
      "c2cc3cccc": 1188,
      "COc1cccc2": 1189,
      ".[Br-]\n": 1190,
      "Cl)cc2": 1191,
      "[C@H](O)[C@H](O)": 1192,
      "CC(C": 1193,
      "cc(Cl)": 1194,
      "C[C@H](NC(=O)": 1195,
      "CCOC(=O)C1": 1196,
      "C#N\n": 1197,
      "(CO": 1198,
      "nc2)": 1199,
      "CCC)": 1200,
      "C(=O)N[C@@H](Cc1ccc(O)cc1)": 1201,
      "(c2ccccc2)": 1202,
      "c(=O)[nH]c1=O\n": 1203,
      "CN2CCN(": 1204,
      "c2ccccc2)c1\n": 1205,
      "c(-c3ccccc3)": 1206,
      "n12\n": 1207,
      "NC(=S)N": 1208,
      "[nH]c(": 1209,
      "O=S(=O)(N": 1210,
      "COc1cccc(-": 1211,
      "FC(F)(F)": 1212,
      "c2=O)cc1\n": 1213,
      "CN2C(=O)": 1214,
      "CCN)": 1215,
      "c3nc(-": 1216,
      "2)n1\n": 1217,
      "c1cccnc1)": 1218,
      "C(=O)OCC)": 1219,
      "c1ncn2": 1220,
      "3CCCC3)": 1221,
      "OCO4)": 1222,
      "COc1cc(OC)": 1223,
      "/C=N/N": 1224,
      "CCN3": 1225,
      "c1ccc([N+](=O)[O-]": 1226,
      "c2cc(NC(=O)": 1227,
      "c1cccs1\n": 1228,
      "c1cccnc1\n": 1229,
      "Cc1ccc(C(=O)N": 1230,
      "CC(C)O": 1231,
      "CCSC)": 1232,
      "c(F)c1\n": 1233,
      "S(=O)(=O)c2ccc(": 1234,
      "ncc3": 1235,
      "C2)c1\n": 1236,
      "Cc1ccc(S(=O)(=O)N": 1237,
      "OCC(=O)N": 1238,
      "c2nnn": 1239,
      "n2nc(": 1240,
      "O3)": 1241,
      "O[C@@H]1": 1242,
      "o2)cc1\n": 1243,
      "cccn": 1244,
      "C=C1": 1245,
      "c2Cl)": 1246,
      "C(=O)N1CCN(": 1247,
      "CN1CC": 1248,
      "c2c3c(": 1249,
      "c2nnc(-": 1250,
      "c2nnc(": 1251,
      "c2n1": 1252,
      "COc1n": 1253,
      "OCCCC": 1254,
      "NC(=O)OC(C)(C)C)": 1255,
      "n3)cc": 1256,
      "c1cc2cccc": 1257,
      "CC[C@@H](C)": 1258,
      "C[C@H](N)": 1259,
      "c3ccccc3)CC2)": 1260,
      "o1)": 1261,
      "c3ccc(C(F)(F)F)cc": 1262,
      "[C@]([H])(C": 1263,
      "c3=O)": 1264,
      "c3ccccc3)cc2": 1265,
      "c3ccc(N4": 1266,
      "nn3)": 1267,
      "[C@@]12": 1268,
      "CC5)": 1269,
      "C(C(=O)N": 1270,
      "C)cc(C)": 1271,
      "1(=O)": 1272,
      "(CC(=O)N": 1273,
      "C(F)(F)F)c1\n": 1274,
      "CCCCNC(=O)": 1275,
      "C1CC1)": 1276,
      "C(=O)N[C@H]1": 1277,
      "c1)N": 1278,
      "C(=O)N1CC": 1279,
      "C[C@@](C)": 1280,
      "c1cc(F)cc": 1281,
      "C(=O)NCC(=O)N": 1282,
      "c3cc4c(": 1283,
      "[C@H](Cc1ccccc1)": 1284,
      "[C@H](CO)": 1285,
      "C2=": 1286,
      "c1ccccc1)c1ccccc1\n": 1287,
      "(CCC)": 1288,
      "c2nc(C)": 1289,
      "[C@]12": 1290,
      "c3cccc(Cl)c3)": 1291,
      "Cc1cs": 1292,
      "c3cc(F)cc": 1293,
      "c2cc(C(=O)N": 1294,
      "CC[C@]21C\n": 1295,
      "n1cc": 1296,
      ".[Cl": 1297,
      ")cc12\n": 1298,
      "c1ccccn1\n": 1299,
      "[C@]2(C)": 1300,
      "c3C)": 1301,
      "c45)": 1302,
      "CCCCC1\n": 1303,
      "NC(=O)[C@H](Cc1c[nH]c2ccccc12)": 1304,
      "CCC4": 1305,
      ".[I": 1306,
      "C2)cc1": 1307,
      "OC)cc1\n": 1308,
      "CCC2(CC1)": 1309,
      "C/C=C/": 1310,
      "#N)": 1311,
      "c1c(-": 1312,
      "CCCC2)": 1313,
      "C1CCCC1\n": 1314,
      "n2cnc3c(": 1315,
      "nc3)": 1316,
      "Cc1cccn": 1317,
      "s2)cc1\n": 1318,
      "(C)c1": 1319,
      "OC2": 1320,
      "c2no": 1321,
      "CNS(=O)(=O)": 1322,
      "c2cc1OC\n": 1323,
      "[C@](C)(O)": 1324,
      "C(=O)OC(C)(C)C)": 1325,
      "=N\\": 1326,
      "N=C(N)N": 1327,
      "C=C(C)": 1328,
      "C(F)(F)F)cc(C(F)(F)F)": 1329,
      "COc1ccc(C2": 1330,
      "c6cccc": 1331,
      "CCC1\n": 1332,
      "C(F)(F)F.": 1333,
      "c1cccc2cccc": 1334,
      "C/C(=N\\": 1335,
      "c2ccccc2)cc1)": 1336,
      "C3)cc": 1337,
      "C)cc1)": 1338,
      "Nc2n": 1339,
      "c4cccn": 1340,
      "c2ccc(Br)cc2)": 1341,
      "c2ccc(Cl)cc2Cl)": 1342,
      "c2cc(O": 1343,
      "c3ccc(C(=O)N": 1344,
      "c3ccc(C)cc3)": 1345,
      "2)ccc1": 1346,
      "CCCC2\n": 1347,
      "[C@@]34": 1348,
      "NC(=O)C1": 1349,
      "c3c(F)cc": 1350,
      "C(=O)N2CC": 1351,
      "O[C@H]1": 1352,
      "O[C@@H]2": 1353,
      "[N+](C)(C)": 1354,
      "c2cc3c(cc2": 1355,
      "CCCCC": 1356,
      "F)cc1": 1357,
      "c3ccc4ccccc4": 1358,
      "c1C(=O)N": 1359,
      "P(=O)(": 1360,
      "C3CCCCC3)": 1361,
      "O[C@H](CO": 1362,
      "P(=O)(O": 1363,
      "c1ccc(OC": 1364,
      "[H][C@@]12O": 1365,
      "c2ccs": 1366,
      "[C@]6": 1367,
      "CCCC1\n": 1368,
      "/C=C/C": 1369,
      "CCC2)": 1370,
      "c1ccco1\n": 1371,
      "[n+](": 1372,
      "CC[C@]4": 1373,
      "c2ccc(Cl)c(Cl)": 1374,
      "CC(=O)O\n": 1375,
      "[S+]([O-])": 1376,
      "o3)": 1377,
      "C4=O)": 1378,
      "P(=O)(O)O)": 1379,
      "C[C@H]3": 1380,
      "O[C@@H](C)": 1381,
      "[C@@](C)(CC": 1382,
      "CCCS": 1383,
      "c1ccco1)": 1384,
      "c(C(=O)": 1385,
      "c4ccccc43)": 1386,
      "CC3)cc2": 1387,
      "O=C(CC": 1388,
      "CCCC(": 1389,
      "OCC(O)": 1390,
      "Cc1c[nH]cn1)": 1391,
      "c2cccc(F)c2)": 1392,
      "[H][C@]1(O": 1393,
      "[nH]2)": 1394,
      "c2ccc(O)cc2)": 1395,
      "CCC(O)": 1396,
      "c2[nH]1\n": 1397,
      "[N-]": 1398,
      "C=CC": 1399,
      "CS(=O)(=O)N": 1400,
      "3)CC1\n": 1401,
      "C2(C)C\n": 1402,
      "c2cc(F)": 1403,
      "c1ncn": 1404,
      "nc2c(": 1405,
      "c1nc2c(": 1406,
      "4CCOCC4)": 1407,
      "(C)(C)": 1408,
      "NC(=O)CS": 1409,
      "COc1cc2c(cc1OC)": 1410,
      "=O)cc1": 1411,
      "c1cc2c(": 1412,
      "c1O)": 1413,
      "C(=O)N[C@@H](C": 1414,
      "c1-c1ccc(": 1415,
      "Cc1o": 1416,
      "CCCN3": 1417,
      "on1\n": 1418,
      "C/C(=C\\": 1419,
      "[C@@H](C)O\n": 1420,
      "nc1)": 1421,
      "CNC(=O)N": 1422,
      "CCC[C@@H]1": 1423,
      ".[I-]\n": 1424,
      "c1ccncc1\n": 1425,
      "C[C@@]1([H])": 1426,
      "c4ccc(F)cc4)": 1427,
      "CC1CC1)": 1428,
      "c3c(-": 1429,
      "c1ccccc1Cl\n": 1430,
      "C2CC": 1431,
      "nc2c1": 1432,
      "Cc1nc(-": 1433,
      "Nc1ncn": 1434,
      "c(=O)n1": 1435,
      "NC(=O)CO": 1436,
      "O[C@@H]3": 1437,
      "c1ccc(-c2cn": 1438,
      "N2CCN(C(=O)": 1439,
      "c2nc(N)": 1440,
      "[C@@]1(": 1441,
      "c2ccc3ccccc3c2)": 1442,
      "c3ccccc3Cl)": 1443,
      "n1cc(": 1444,
      "CC[C@]3(C)": 1445,
      "F)c(Cl)": 1446,
      "C(=O)OC\n": 1447,
      "Cc1ccc(S(=O)(=O)": 1448,
      "c1cccc(Cl)c1\n": 1449,
      "CN2CCC(": 1450,
      "3[H])": 1451,
      ".[Cl-]\n": 1452,
      "c1ccccn1)": 1453,
      "Cn1c(": 1454,
      "c1c(Cl)cc": 1455,
      "c1cc(N": 1456,
      "[C@@]1(O)": 1457,
      "OCc2ccccc2)": 1458,
      "/C=C/C(=O)N": 1459,
      "Cc1ccc(O": 1460,
      "C(F)(F)F)cc1)": 1461,
      "C2CCCC2)": 1462,
      "[nH]1)": 1463,
      "[C@@H]2O)": 1464,
      "nn(-": 1465,
      "CCC(=O)": 1466,
      "O=c1[nH]": 1467,
      "c1c(F)cc": 1468,
      "n2C)": 1469,
      "CCC2\n": 1470,
      "OC[C@H]1O[C@@H](": 1471,
      "[C@@H]5": 1472,
      "c(N3": 1473,
      "c1ccc(C(=O)N": 1474,
      "CNC": 1475,
      "4)cc2": 1476,
      "COc1ccc(C(=O)N": 1477,
      "c3ccccc3F)": 1478,
      "[C@@]4(C)": 1479,
      "Cl.Cl.": 1480,
      "COc1ccc(S(=O)(=O)N": 1481,
      "CC(N)": 1482,
      "c2O)": 1483,
      "CC(C)=": 1484,
      "CCCC(=O)N": 1485,
      "Cc1ccc(C)": 1486,
      "nn1)": 1487,
      "c2cc(S(=O)(=O)N": 1488,
      "c2ncc(": 1489,
      "C(F)(F)F)c3)": 1490,
      "N3CCCC": 1491,
      "c1cc2c(cc1": 1492,
      "c3ccccc23)cc1\n": 1493,
      "n4cn": 1494,
      "c1ccc(Cl)c(Cl)": 1495,
      "c2ccc(C)": 1496,
      "2)cc1OC\n": 1497,
      "S1(=O)": 1498,
      "Cn1cc(-": 1499,
      "l)": 1500,
      "CC2CC": 1501,
      "c1cccc(NC(=O)": 1502,
      "Br)cc1": 1503,
      "CC1CCCCC1)": 1504,
      "3)C1)": 1505,
      "c2cc(OC)c(OC)c(OC)": 1506,
      "[C@@]([H])(O": 1507,
      "C3\n": 1508,
      "c2cccc(C(F)(F)F)c2)": 1509,
      "[P": 1510,
      "CCOc1cc(": 1511,
      "c(=O)c(C(=O)O)": 1512,
      "c3cccc(F)c3)": 1513,
      "c1ccccc1)N": 1514,
      "c2ccc3[nH]": 1515,
      "c2cccc3ccccc23)": 1516,
      "3)cc2)cc1\n": 1517,
      "c2ccc3n": 1518,
      "C(N": 1519,
      "CC2)ccc1": 1520,
      "C(N)=N": 1521,
      "ncc(": 1522,
      "c4c3)": 1523,
      "c1cccc(O": 1524,
      "CCCN2C(=O)": 1525,
      ")cc(-": 1526,
      "c1cccc(N": 1527,
      "Cc1cc(N": 1528,
      "C(C)=C(": 1529,
      "C4CC4)": 1530,
      "CCOc1ccccc1": 1531,
      "OC(C)=O\n": 1532,
      "C(=O)C": 1533,
      "Cc1ccc(N": 1534,
      "Br.": 1535,
      "c2ccc(OC": 1536,
      "CNCC": 1537,
      "C(C)C)C(C)C)": 1538,
      "C(=O)N[C@@H](CCCN=C(N)N)": 1539,
      "Cc1ccco": 1540,
      "NS(=O)(=O)c1ccc(": 1541,
      "CC2(": 1542,
      "c2cccc(O)": 1543,
      "C(=O)C1": 1544,
      "c3ccccc32)cc1\n": 1545,
      "c1ccccc12\n": 1546,
      "(CC2)": 1547,
      "CCn1cc(": 1548,
      "[C@@](C)(": 1549,
      "N1CCN(C(=O)": 1550,
      "c4ccc(Cl)cc4)": 1551,
      "c2ccccc21)": 1552,
      "C(=C)C)": 1553,
      "c3cccnc3": 1554,
      "/C=N/NC(=O)": 1555,
      "c(O)c(": 1556,
      "c2ccccc2)cc1": 1557,
      "Cl.Cl\n": 1558,
      "c1cccs1)": 1559,
      "c2ccc(C)cc2)": 1560,
      "c2cc(N": 1561,
      "Br)cc1)": 1562,
      "c1nnc(": 1563,
      "Cc1cn(": 1564,
      "=C(O)": 1565,
      "C(C)(C)O)": 1566,
      "Cc2cn": 1567,
      "CSCC[C@H](": 1568,
      "c3cc2": 1569,
      "C[n+]1": 1570,
      "c2cccnc2": 1571,
      "Cc2c(": 1572,
      "2CC3CC": 1573,
      "ccc1": 1574,
      "c(S(=O)(=O)N": 1575,
      "NC2=O\n": 1576,
      "[C@@H](O)[C@H](": 1577,
      "c(=O)[nH]1\n": 1578,
      "NC(=O)[C@]([H])(": 1579,
      "c3ccc4c(c3)OCO4)": 1580,
      "nc2ccccc12\n": 1581,
      "C(=O)NCCCC": 1582,
      "c(=O)n3": 1583,
      "SCC(=O)N": 1584,
      "c4cccc(": 1585,
      "[C@@]1([H])CC[C@]1(C)": 1586,
      "c1o": 1587,
      "c2ccc(Cl)": 1588,
      "c1cc3": 1589,
      "[H][C@]12C": 1590,
      "[Si": 1591,
      "[C@@H]2CC": 1592,
      "2)cc1)": 1593,
      "c1cc(O)": 1594,
      "C(Cl)": 1595,
      "CC4": 1596,
      "nn2)cc1\n": 1597,
      "C2)n1\n": 1598,
      "[nH]cc": 1599,
      "CCNCC3)": 1600,
      "c1cccc(O)": 1601,
      "CC2)CC1\n": 1602,
      "c4ccccc4)cc3)": 1603,
      "c1nc(C)": 1604,
      "c5cc(": 1605,
      "[C@H](O)[C@@H]1O\n": 1606,
      "N1CCN(C": 1607,
      "c2ccn": 1608,
      "S(C)(=O)=O\n": 1609,
      "c1cn(": 1610,
      "c3ccc(OC)cc3)": 1611,
      "c(=O)n(": 1612,
      "/c(": 1613,
      "CCC[C@H]2": 1614,
      "COc1ccccc1-": 1615,
      "C(=O)N[C@@H](Cc2ccccc2)": 1616,
      "[Si]": 1617,
      "c2ccc(OC)cc2)": 1618,
      "[C@@](": 1619,
      "Nc1cc": 1620,
      "Oc2ccc(": 1621,
      "COc1c(": 1622,
      "S(=O)(=O)[O-])": 1623,
      "c43)": 1624,
      "c2ccc([N+](=O)[O-])cc2)": 1625,
      "CCCCC1)": 1626,
      "cc1-": 1627,
      "S(=O)(=O)N2CCCC": 1628,
      "COc1ccc(N": 1629,
      "c2C1\n": 1630,
      "nc(O)": 1631,
      "C(C)C)cc": 1632,
      "(Cc2ccccc2)": 1633,
      "c1nnc(-": 1634,
      "S(N)(=O)=O)": 1635,
      ".[Na+].[Na+]": 1636,
      "Cc1[nH]": 1637,
      "O[C@H]3": 1638,
      "c-2": 1639,
      "P(=O)([O-])": 1640,
      "[C@@](C)(O)": 1641,
      "c(=O)[nH]c2=O)": 1642,
      "c4ccc(-": 1643,
      "C12": 1644,
      "CCCN(C)": 1645,
      "S\n": 1646,
      "c3cc4c(cc3": 1647,
      "n2cc(-": 1648,
      "NC(=O)[C@H](Cc2ccccc2)": 1649,
      "e]": 1650,
      "COCCO": 1651,
      "[C@](O)": 1652,
      "CCC[C@@H](": 1653,
      "c2n[nH]": 1654,
      "c2cc(Br)cc": 1655,
      "n5": 1656,
      "COC(=O)N": 1657,
      "CC[C@@]3(C)": 1658,
      "CO[C@H]1": 1659,
      "c2c(F)cccc2": 1660,
      "C(c1ccccc1)": 1661,
      "4)ccc3": 1662,
      "CCCO)": 1663,
      "c2cc(Cl)ccc2": 1664,
      "c54)": 1665,
      "c2cccc(C)": 1666,
      "c1ccccc1F\n": 1667,
      "cn1": 1668,
      "C(=O)[O-])": 1669,
      ".O=C(O)C(=O)O\n": 1670,
      "CC(NC(=O)": 1671,
      "C=CC(=O)N": 1672,
      "CN(C)C)": 1673,
      "[C@]34": 1674,
      "Cc1ccccc1-": 1675,
      "c3ccc([N+](=O)[O-]": 1676,
      "c2cc(=O)": 1677,
      "C(=O)N2CCN(": 1678,
      "CC2)n1\n": 1679,
      "CC(C)N": 1680,
      "COC(=O)C1": 1681,
      "CCC(CC)": 1682,
      "OCO3\n": 1683,
      "O1)": 1684,
      "N5": 1685,
      "NC(=O)[C@@H]2": 1686,
      "c4ccc5c(": 1687,
      "C(N)=O)cc": 1688,
      "NC(=O)[C@@H]1CCCN1C(=O)": 1689,
      "c1nc(N)": 1690,
      "C(=O)N1\n": 1691,
      "/N=N/": 1692,
      "O[C@H]2": 1693,
      "[N+](=O)[O-])c1\n": 1694,
      "OC3": 1695,
      "O=C(O": 1696,
      "C(C#N)": 1697,
      "COC(=O)c1ccc(": 1698,
      "c1ccccc1Cl)": 1699,
      "O=C(NCC": 1700,
      "[n+]([O-])": 1701,
      "c34)cc": 1702,
      "c2c(c1": 1703,
      "C#N)cc": 1704,
      "NC(=O)[C@@H]1CCCN1C(=O)[C@H](": 1705,
      "c(=O)n(C": 1706,
      "c1ccc(-c2ccc(": 1707,
      "c2)C1\n": 1708,
      "CC(C)[C@H](": 1709,
      "cc12\n": 1710,
      "c3c(Cl)cc": 1711,
      "nc(SCC(=O)N": 1712,
      "OCC\n": 1713,
      "NC(=O)OCc1ccccc1)": 1714,
      "c6ccccc6": 1715,
      "CCn1c(": 1716,
      "c23)cc": 1717,
      "cnc1": 1718,
      "CN4": 1719,
      "c3nc(N": 1720,
      "c1c2c(": 1721,
      "c(SCC(=O)N": 1722,
      "c1ccc(Br)cc1\n": 1723,
      "4\n": 1724,
      "OCCN": 1725,
      "C(=O)O1\n": 1726,
      "4)C2)": 1727,
      "[C@]([H])(CC": 1728,
      "c2nc(-c3ccccc3)": 1729,
      "c1ccc(O)cc1\n": 1730,
      "[C@@]6": 1731,
      "c2ccc(C(F)(F)F)cc2)": 1732,
      "c3ccc(N": 1733,
      "cccc4": 1734,
      "c3ccs": 1735,
      "NC(=O)[C@H](C(C)C)": 1736,
      "Cc1c(-": 1737,
      "CC1=O\n": 1738,
      "Cc1c(C(=O)N": 1739,
      "ccc(N)": 1740,
      "CC[C@H]1": 1741,
      "c1cccc2c1": 1742,
      "C(O)(": 1743,
      "c4ccncc": 1744,
      "c2cccc([N+](=O)[O-])": 1745,
      "C#C": 1746,
      "O=C(O)C(F)(F)F.": 1747,
      "c2c1=O\n": 1748,
      "c2ccnc(N": 1749,
      "CCN(C)CC3)": 1750,
      "O4)": 1751,
      "OCCCO": 1752,
      "2H]": 1753,
      "c4ccccc4)CC3)": 1754,
      "Cn2cn": 1755,
      "N1CCCC1\n": 1756,
      "c1ccncc1)": 1757,
      "c3ccccc13)": 1758,
      "[2H]": 1759,
      "OCCO2\n": 1760,
      "c2ccc(OC)": 1761,
      "C(=O)NC2": 1762,
      "[C@H]5": 1763,
      "c2cncc": 1764,
      "2CC3CC(CC(C": 1765,
      "[C@@H](OC)": 1766,
      "c%1": 1767,
      "CC[C@@H]1": 1768,
      "Nc1ncc": 1769,
      "cc(N": 1770,
      "[O-]\n": 1771,
      "n1-c1ccccc1\n": 1772,
      "O=C(CSc1n": 1773,
      "[nH]3)": 1774,
      "(C4": 1775,
      "c1cnc(N": 1776,
      "[N+]1": 1777,
      "sc2c1\n": 1778,
      "[H][C@]12CC=C3": 1779,
      "nc3c(": 1780,
      "COC(": 1781,
      "c4)cc": 1782,
      "[C@H](CC(C)C)": 1783,
      "3CC4CC": 1784,
      "CC(C)(": 1785,
      "[C@H]1CC[C@H](": 1786,
      "5)cc4)": 1787,
      "c3cc(Cl)ccc3": 1788,
      "c3cs": 1789,
      "CC(N": 1790,
      "c(C": 1791,
      "cnc2c1ncn2": 1792,
      "OC)c1\n": 1793,
      "OC[C@H]3": 1794,
      "c3cccc4cccc": 1795,
      "Clc1ccc(": 1796,
      "CCCCn1": 1797,
      "c1ccccc1O": 1798,
      "2CC3CC(CC(C3)C1)": 1799,
      "CC(=O)N(C)": 1800,
      "OCO2)": 1801,
      "[H][C@@]1(O[C@@H]2": 1802,
      "c3ccc(NC(=O)": 1803,
      "Cc1nc(N": 1804,
      "Cl)cc1)": 1805,
      "[C@]5([H])": 1806,
      "C(=O)N[C@@H](CCCCN)C(=O)N[C@@H](CCCCN)": 1807,
      "C)cc2)cc1\n": 1808,
      "B(O)": 1809,
      "CC1CCN(": 1810,
      "c1cccc(C": 1811,
      "CCNS(=O)(=O)": 1812,
      "COc1ccc(C(=O)": 1813,
      "[C@](C)(": 1814,
      "CCOCCOCCOCCO": 1815,
      "c2cccc(O": 1816,
      "c1ccc(O)cc1)": 1817,
      "c4cc5": 1818,
      "CCc1cc(": 1819,
      "c2)ccc1": 1820,
      "C2)CC1\n": 1821,
      "CCC3(CC2)": 1822,
      "C2=O)c1\n": 1823,
      "CN(C)c1ccc(": 1824,
      "COc1ccc(-c2n": 1825,
      "[C@]4(C)": 1826,
      "O.": 1827,
      "c(F)c2)": 1828,
      "c1ccc2c(c1)OCO2\n": 1829,
      "c3ccc(O)cc3)": 1830,
      "c3ccc(Br)cc3)": 1831,
      "C(NC(=O)": 1832,
      "c1cncc": 1833,
      "COc2ccc(": 1834,
      "nc2ccccc21\n": 1835,
      "c1ncc(": 1836,
      "3)ccc2": 1837,
      "/C1=C\\": 1838,
      "c4=O)": 1839,
      "c3ccc(C)": 1840,
      "CCOCC2)cc1\n": 1841,
      "[C@]21": 1842,
      "C(=O)c2ccccc2": 1843,
      "c2c(Cl)cccc2": 1844,
      "2(=O)": 1845,
      "ncn2": 1846,
      "[C@@](C)(CC[C@@]4": 1847,
      "CCCC4)": 1848,
      "COc1ccc(Cl)cc1": 1849,
      "C1CCCC1)": 1850,
      "c3c(O)": 1851,
      "Cn2cc": 1852,
      "c3ncccc3": 1853,
      "n3cc(": 1854,
      "c3cccc(C)": 1855,
      "c3cccc(C(F)(F)F)c3)": 1856,
      "NC(=O)C2": 1857,
      "N2CCN(C": 1858,
      ".O=C(O)C(F)(F)F": 1859,
      "NC(=O)/C=C/": 1860,
      "c3ccc(Cl)c(Cl)": 1861,
      "c1cccc(Cl)c1)": 1862,
      "c4cccc5": 1863,
      "nn12\n": 1864,
      "c1nc(-c2ccccc2)": 1865,
      "CC(C)(O)": 1866,
      "C[C@@H]1CN(": 1867,
      "C1CCN(C": 1868,
      "N=C1": 1869,
      "c1cccc(F)c1\n": 1870,
      "CCn1c(=O)": 1871,
      "n(-c3ccccc3)": 1872,
      "Cc1nn(C)": 1873,
      "F)cc1)": 1874,
      "Cc1s": 1875,
      "CCc2ccccc2)": 1876,
      "c3ccc4": 1877,
      "C(F)(F)F)cc1": 1878,
      "c(N)n": 1879,
      "CCC(C)(C)": 1880,
      "c(O)c1\n": 1881,
      "Fc1ccc(": 1882,
      "[C@@]5([H])": 1883,
      "c4ccco": 1884,
      "CCNCC2)": 1885,
      "c2ccccc2c1=O\n": 1886,
      "CCCC1)": 1887,
      "c2cnc(N": 1888,
      "Nc1nc(N": 1889,
      ")ccn1\n": 1890,
      "C(O)C(O)": 1891,
      "c1cc2cc(": 1892,
      "C3CC": 1893,
      "c1NC(=O)": 1894,
      "c1no": 1895,
      "[C@@H](CC)": 1896,
      "c1cc(=O)": 1897,
      "C5)": 1898,
      "[C@H](OC)": 1899,
      "Nc1ccccc1": 1900,
      "C3=N": 1901,
      "c1Cl)": 1902,
      "SC": 1903,
      "oc2c1\n": 1904,
      "/C=C(/": 1905,
      "COc1ccc2[nH]": 1906,
      "c1cn(-": 1907,
      "CCCC[C@H](": 1908,
      "n2)C1\n": 1909,
      "N1CCCCC1\n": 1910,
      "c1ccc(S(=O)(=O)N": 1911,
      "C(=O)N[C@@H](CCCNC(=N)N)C(=O)N[C@@H](CCCNC(=N)N)": 1912,
      "=[N+]=": 1913,
      "CCOC)": 1914,
      "O=C1c2ccccc2": 1915,
      "[C@](O)(": 1916,
      "c5cn": 1917,
      "C3)cc2": 1918,
      "Cc1cc(C)cc(": 1919,
      "CCN1CCC(": 1920,
      "cc(C)c(=O)[nH]": 1921,
      "=N)": 1922,
      "c4cc(Cl)cc": 1923,
      "ncnc(N": 1924,
      "[C@@H](Cc1ccccc1)": 1925,
      "43)": 1926,
      "CC=C(C)C)": 1927,
      "O=C(N/N=C/": 1928,
      "c1ncccc1": 1929,
      "C(F)(F)F)c1)": 1930,
      "c3cco": 1931,
      "c3c[nH]c4ccccc34)": 1932,
      "[C@@](O)(": 1933,
      "c2cc(N3": 1934,
      "c(F)c(F)": 1935,
      "C(=O)c1ccccc1": 1936,
      "CO1\n": 1937,
      "c3F)": 1938,
      "c3cc4cccc": 1939,
      "c2co": 1940,
      "CC1=N": 1941,
      "CCCCCCCC(=O)": 1942,
      "CN(C)S(=O)(=O)": 1943,
      "N=": 1944,
      "[C@]1(O)": 1945,
      "CCCCC1": 1946,
      "c2ccc(Br)cc2": 1947,
      "c1c(N": 1948,
      "[C@@]2(": 1949,
      "(C#N)cc": 1950,
      "(c1ccccc1)": 1951,
      "c2ccccc2)CC1)": 1952,
      "CCN2C(=O)": 1953,
      "nn(C)": 1954,
      "NC(=O)c1cc(": 1955,
      "cs2)": 1956,
      "c2c(N": 1957,
      "F)cc2": 1958,
      "c2cccc(OC)": 1959,
      "c1ccc(F)cc1F\n": 1960,
      "n2c(=O)": 1961,
      "c(F)cc2": 1962,
      "CCNC(=O)N": 1963,
      "NC(=O)N2": 1964,
      "C1)N2": 1965,
      "c1ccc(O)c(O)": 1966,
      "c2ccc(O)cc2": 1967,
      "CSSC[C@@H](": 1968,
      "nc2n1": 1969,
      "c1cccc2ccccc12\n": 1970,
      "CCCC3)": 1971,
      "c1ccc2ccccc2c1\n": 1972,
      "O=C(CN1": 1973,
      "3CC4CC(CC(C": 1974,
      "c2ccc(C(=O)O)cc": 1975,
      "C[C@H](OC(=O)": 1976,
      "CO2)": 1977,
      "c32)cc1\n": 1978,
      "COc1cc(N": 1979,
      "NC(=O)[C@H](CCCN=C(N)N)": 1980,
      "OCc3ccccc3)": 1981,
      "c2ccc(F)": 1982,
      "3)ccc21\n": 1983,
      "/C=C3": 1984,
      "NC(=O)C": 1985,
      "c23)c1\n": 1986,
      "c21)": 1987,
      "n4cc": 1988,
      "c3cccc(-": 1989,
      "c2ccc(Cl)c(Cl)c2)": 1990,
      "c3cc(OC)c(OC)c(OC)": 1991,
      "C(=O)O[C@H](": 1992,
      "OC[C@H]3O[C@@H](": 1993,
      "C(CO)": 1994,
      "[C@]6([H])": 1995,
      "C(F)(F)F)cc2": 1996,
      "NC(=O)[C@H]1": 1997,
      "c2cccc3c2": 1998,
      "c(n1)": 1999,
      "c3ccc(C(F)(F)F)cc3)": 2000,
      "c[n+]": 2001,
      "c2ccccc2n1\n": 2002,
      "CCCN(C)C)": 2003,
      "c4ncc": 2004,
      "CCN(C)CC2)": 2005,
      "SC)": 2006,
      "c23)CC1\n": 2007,
      "CCN(S(=O)(=O)": 2008,
      "c2ccc(F)cc2F)": 2009,
      ".Cl.Cl\n": 2010,
      "CCO\n": 2011,
      "c2ccc(Cl)cc2)cc1\n": 2012,
      "OC)cc1)": 2013,
      "c1ccccc1F)": 2014,
      "S)=N": 2015,
      "S1\n": 2016,
      "N[C@H](": 2017,
      "C(=O)N2\n": 2018,
      "(C2)": 2019,
      "c(-c4ccc(": 2020,
      "O[C@H](C)C[C@H](": 2021,
      "C3CCCC3)": 2022,
      "c4ccc5c(c4)": 2023,
      "C(C)(C)C)cc": 2024,
      "c1cc(-c2ccccc2)": 2025,
      "CC(O": 2026,
      "n4cnc5": 2027,
      "C(=O)N[C@H](C)": 2028,
      "[C@]1(": 2029,
      "C3=O)cc": 2030,
      "c1ccc([N+](=O)[O-])cc1\n": 2031,
      "cn2)CC1\n": 2032,
      "oc(=O)": 2033,
      "C2)C1\n": 2034,
      "[C@H](C": 2035,
      "COC1": 2036,
      "c3cc(OC)c(OC)": 2037,
      "c3)CC2)": 2038,
      "Cc1noc(C)c1": 2039,
      "N)ncnc32)": 2040,
      "n(CC(=O)N": 2041,
      "c1ccc(-n2": 2042,
      "C(=O)OCC(=O)N": 2043,
      ")cc1OC\n": 2044,
      "CC(C(=O)N": 2045,
      "[C@@H](CC(C)C)": 2046,
      "c1ccc(Cl)": 2047,
      "NC(=O)CN": 2048,
      "c2ccc(-c3ccccc3)cc2)": 2049,
      "CCN(CC)C(=O)": 2050,
      "c1cccc(Br)": 2051,
      "c1.Cl\n": 2052,
      "c3ccccc3-": 2053,
      "[H][C@]12CC[C@@]3([H])": 2054,
      "(CCO)": 2055,
      "c3c(F)cccc3": 2056,
      "[H][C@]1(O[C@H]2": 2057,
      "=[N+]=[N-]": 2058,
      "N2CCO": 2059,
      "c4cccc(Cl)": 2060,
      "COC)": 2061,
      "c(C(N)=O)": 2062,
      "[C@@H](C": 2063,
      "C3=O\n": 2064,
      "c[nH]1\n": 2065,
      "c2ccncc2": 2066,
      "c3)cc2)": 2067,
      "C(=O)NS(=O)(=O)": 2068,
      "C2(C)C)": 2069,
      "c2ccc(C#N": 2070,
      "CO2\n": 2071,
      "C3=C(": 2072,
      "c2ccccc2)C1\n": 2073,
      "3CC4CC(CC(C4)C2)": 2074,
      "(F)F)": 2075,
      "CCCN(CCC)": 2076,
      "Cc1c(C)": 2077,
      "c3c(=O)": 2078,
      "[C@@]21C\n": 2079,
      "O)c(OC)": 2080,
      "c1ccc2o": 2081,
      "c1C(=O)": 2082,
      "c(CN": 2083,
      "c3n2": 2084,
      "CCNCC1\n": 2085,
      "c3c([nH]": 2086,
      "c1co": 2087,
      "C)c1\n": 2088,
      "CCc1ccccc1)": 2089,
      "CN2CCCC": 2090,
      "[C@@]43[H])": 2091,
      "CCN(CC(=O)N": 2092,
      "c3-": 2093,
      "c2ccc(-c3ccc(": 2094,
      "nc32)": 2095,
      "c4ccccc4)cc": 2096,
      "c1cc(Cl)": 2097,
      "[C@@H](O)[C@@H](O)": 2098,
      "c1ccc(F)": 2099,
      "nc3ccccc3": 2100,
      "SS": 2101,
      "CCCCN1": 2102,
      "nc1C\n": 2103,
      "nn2-": 2104,
      "c(NC": 2105,
      "OCc1ccccc1\n": 2106,
      "C(F)(F)C(F)(F)": 2107,
      "CC1CCCO": 2108,
      "[H][C@@]12CC=C3": 2109,
      "C(C)C)cc1\n": 2110,
      "c2=O)c1\n": 2111,
      "C1=C(O)": 2112,
      "CCC(=O)N1": 2113,
